const countries = {
  ma: {
    flag: "./images/waving-flags/ma-gif-flag.gif",
    countryName: {
      ar: "المغرب",
      ch: "摩洛哥",
    },
    geo: {
      map: "./images/ma (3).svg",
      title: {
        ar: "الموقع الجغرافي",
        ch: "地理位置",
      },
      content: {
        ar: `تقع المغرب في شمال غرب إفريقيا،الرباط هي عاصمة المغرب، تقع عند مصب نهر أبي رقراق في شمال غرب المغرب، وتطل على المحيط الأطلسي، وهي المركز السياسي للمغرب.  وتبلغ مساحتة المغرب حوالي 446,550 كيلومترًا مربعًا. يحدها الجزائر من الشرق، والمحيط الأطلسي من الغرب، والبحر الأبيض المتوسط من الشمال، بساحل يمتد لمسافة حوالي 1,835 كيلومترًا. تتمتع البلاد بتضاريس متنوعة، حيث تمتد جبال الأطلس في الوسط والشمال، بينما توجد الهضاب والصحارى في الشرق والجنوب، أما المناطق الساحلية الشمالية الغربية فتتسم بسهل ضيق. يتمتع الساحل الشمالي بمناخ البحر الأبيض المتوسط شبه الاستوائي، حيث يكون الشتاء معتدلًا وممطرًا، بينما يكون الصيف حارًا وجافًا. تمتلك المغرب عددًا قليلًا من الأنهار، ومعظمها أنهار موسمية، كما أن البحيرات غالبًا ما تكون موسمية أيضًا. وتُعد المياه الجوفية موردًا وفيرًا مما يجعلها مصدرًا رئيسيًا للاستخدام الزراعي والمعيشي`,
        ch: `摩洛哥位于非洲西北部，拉巴特是摩洛哥的首都位于摩洛哥西北部的布雷格雷格河河口，濒临大西洋，是摩洛哥的政治中心。摩洛哥面积约为446,550平方公里。东部与阿尔及利亚接壤，西临大西洋，北濒地中海，海岸线总长约1,835公里。摩洛哥的地形多样，中部和北部为阿特拉斯山脉，东部和南部是高原和前撒哈拉高原，西北沿海地区为狭长的平原。北部沿海地区属于亚热带地中海气候，冬季温和多雨，夏季炎热干燥。摩洛哥境内河流稀少，主要为季节性河流，湖泊也多为季节性水体。地下水资源丰富，是农业和生活用水的重要来源。`,
      },
      popover: {
        ar: [
          {
            name: "نهر أبي رقراق",
            info: "يقع نهر أبي رقراق في شمال غرب المغرب، وينبع من جبال الأطلس في شمال وسط المغرب. يتجه بشكل عام من الشمال الغربي إلى الجنوب الشرقي، ويبلغ طوله حوالي 190 كيلومترًا، وينتهي بتصبه في المحيط الأطلسي بالقرب من الرباط",
          },
          {
            name: "جبال الأطلس",
            info: "تقع جبال الأطلس في شمال غرب أفريقيا، وتمتد عبر المغرب والجزائر وتونس، ويبلغ طولها حوالي 2400 كيلومتر وعرضها 450 كيلومتر. هي سلسلة الجبال الرئيسية في منطقة المغرب العربي، تمتد من أكادير في جنوب غرب المغرب إلى شمال شرق تونس العاصمة.",
          },
        ],
        ch: [
          {
            name: "布雷格雷格河",
            info: "布雷格雷格河位于摩洛哥西北部，发源于摩洛哥中北部的阿特拉斯山脉。大致呈西北 - 东南走向，全长约 190 公里，最终在拉巴特附近注入大西洋。",
          },
          {
            name: "阿特拉斯山脉",
            info: "阿特拉斯山脉位于非洲西北部，横跨摩洛哥、阿尔及利亚和突尼斯三国，全长约2,400公里，宽度达450公里。它是马格里布地区的主要山脉，从摩洛哥西南部的阿加迪尔延伸至突尼斯首都突尼斯东北部。",
          },
        ],
      },
    },
    economy: {
      title: {
        ar: `الموارد الطبيعية و مصادر الدخل `,
        ch: `自然资源与收入来源`,
      },
      content: {
        ar: [
          {
            icon: "./images/gold.png",
            title: "التعدين والموارد المعدنية",
            text: "تمتلك المغرب موارد طبيعية غنية، حيث تتميز بثروة معدنية متنوعة، ويعد الفوسفات أهم هذه الموارد، إذ تبلغ احتياطاته المؤكدة 50 مليار طن، ما يمثل 71% من إجمالي الاحتياطيات العالمية، مما يجعلها واحدة من أكبر منتجي الفوسفات في العالم. بالإضافة إلى ذلك، تحتوي البلاد على كميات كبيرة من الحديد، الرصاص، الكوبالت، المنغنيز، الباريوم، والنحاس، حيث تحتل احتياطيات خام الرصاص والأنتيمون المرتبة الثانية في إفريقيا، بينما تحتل احتياطيات خام الزنك المرتبة الثالثة. من الناحية الاقتصادية، يُعد قطاع التعدين والصناعات المرتبطة به أحد الركائز الأساسية لاقتصاد المغرب، حيث يمثل ما بين 8% إلى 10% من الناتج المحلي الإجمالي.",
          },
          {
            icon: "./images/fishermen.png",
            title: "الموارد السمكية والصيد البحري",
            text: "كما أن الثروة السمكية في المغرب غنية أيضًا، حيث تطل على المحيط الأطلسي من الغرب والبحر الأبيض المتوسط من الشمال، وتمتلك خطًا ساحليًا طويلًا، مما يجعلها أكبر دولة منتجة للأسماك في إفريقيا. يمتد الساحل المغربي لأكثر من 1700 كيلومتر، ما يمنحها موارد بحرية وفيرة، مما يجعلها أكبر دولة صيد في إفريقيا والسابعة عشرة عالميًا في إنتاج الأسماك.",
          },
          {
            icon: "./images/planting.png",
            title: "الزراعة",
            text: "أما الزراعة، فهي تلعب دورًا مهمًا في الاقتصاد الوطني، إذ تعد المغرب أكبر منتج زراعي في شمال إفريقيا، وتشمل المحاصيل الرئيسية القمح، الذرة، فول الصويا، والقطن.",
          },
          {
            icon: "./images/travel-and-tourism.png",
            title: "السياحة",
            text: "السياحة أيضًا مصدر رئيسي للدخل في المغرب، حيث تتميز البلاد بتنوعها الثقافي والتاريخي الفريد، وتمتلك العديد من المواقع التاريخية والمعالم السياحية المتميزة مثل مدينة شفشاون القديمة، الدار البيضاء الحديثة، مدينة أكادير الساحلية، وقصر الباهية في مراكش. تجذب هذه الوجهات ملايين السياح سنويًا، مما يجعل قطاع السياحة ركيزة مهمة في الاقتصاد المغربي.",
          },
        ],
        ch: [
          {
            icon: "./images/gold.png",
            title: "矿业与矿产资源",
            text: "摩洛哥拥有丰富的自然资源，其中矿产资源丰富且种类繁多，磷酸盐是最主要的矿产资源，已探明储量500亿吨，占世界储量的71%，使其成为全球最大的磷酸盐生产国之一。此外，该国还蕴藏丰富的铁、铅、钴、锰、钡、铜等矿产资源，其中铅矿石与锑矿石储量位居非洲第二，锌矿石储量位居非洲第三。",
          },
          {
            icon: "./images/fishermen.png",
            title: "渔业资源",
            text: "渔业资源同样丰富，摩洛哥西濒大西洋，北临地中海，拥有漫长的海岸线，是非洲第一大产鱼国。摩洛哥拥有长达1700多公里的海岸线，渔业资源丰富，是非洲第一大、世界第十七大渔业国。",
          },
          {
            icon: "./images/planting.png",
            title: "农业",
            text: "农业在经济中占据重要地位，摩洛哥是北非最大的农业生产国之一，主要种植小麦、玉米、大豆、棉花等作物。",
          },
          {
            icon: "./images/travel-and-tourism.png",
            title: "旅游业",
            text: "旅游业也是摩洛哥的重要收入来源，该国融合多元文化，拥有丰富的历史遗产和独特风情，如古城舍夫沙万、现代化的卡萨布兰卡、沿海的阿加迪尔，以及马拉喀什的巴丹宫等，每年吸引大量游客，推动旅游业成为经济的重要支柱。",
          },
        ],
      },
    },
    cities: {
      title: {
        ar: "العاصمة و الوجهات السياحية",
        ch: "首都与旅游地",
      },
      content: {
        ar: [
          {
            img: "./images/ma/c1.jpg",
            title: "ساحة جامع الفنا",
            description:
              "المعروفة أيضًا باسم ساحة الأرق، في مراكش بالمغرب. وهي الساحة الوحيدة في العالم التي لا تزال قيد الاستخدام والمدرجة ضمن قائمة التراث الثقافي العالمي. ساحة جامع الفنا لها تاريخ يمتد لألف عام وشهدت العديد من التغيرات التاريخية والتكاملات الثقافية في المغرب، وهي رمز مهم لتاريخ وثقافة المغرب.",
          },
          {
            img: "./images/ma/c2.jpg",
            title: "شفشاون",
            description:
              'هي مدينة تقع في شمال غرب المغرب، إحدى دول شمال أفريقيا، وتعرف باسم "المدينة الزرقاء". تم بناء مدينة شفشاون في عام 1471 كحصن صغير للدفاع ضد الغزو البرتغالي. تقع في جبال الريف في شمال غرب المغرب، في واد واسع، بالقرب من البحر الأبيض المتوسط، وتواجه مضيق جبل طارق من الشمال، وعلى الجانب الآخر من البحر من الأندلس، المنطقة الواقعة في أقصى جنوب إسبانيا. وتحتفظ المنطقة المحلية بعادات تقليدية غنية، مثل الحرف اليدوية التقليدية، بما في ذلك الجلود والمنسوجات والأواني الحديدية وأعمال النجارة التقليدية، حيث تعد المنتجات الخشبية من أكثر منتجات الحرف اليدوية مبيعا.',
          },
          {
            img: "./images/ma/c3.jpg",
            title: "الرباط",
            description:
              "الرباط عاصمة المغرب تقع عند مصب نهر أبي رقراق شمال غرب المغرب، على ساحل المحيط الأطلسي. وهي المركز السياسي للمغرب. تتميز الرباط أيضًا بطراز معماري فريد يجمع بين العناصر المعمارية العربية والأوروبية. وتتمتع المدينة بمناظر طبيعية خلابة تجذب العديد من السياح",
          },
        ],
        ch: [
          {
            img: "./images/ma/c1.jpg",
            title: "拉巴特",
            description:
              "拉巴特是摩洛哥位于西北部的布雷格雷格河口，濒临大西洋，是摩洛哥的政治中心。拉巴特还具有独特的建筑风格，融合了阿拉伯、欧洲的建筑元素，城市风景优美，吸引着众多游客前来观光游览",
          },
          {
            img: "./images/ma/c2.jpg",
            title: "杰马夫纳广场",
            description:
              "位于摩洛哥马拉喀什，又称不眠广场，是全球唯一还在使用的被列入世界文化遗产的广场。杰马夫纳广场已有一千年历史，见证了摩洛哥众多历史变迁和文化交融，是摩洛哥历史文化的重要象征",
          },
          {
            img: "./images/ma/c3.jpg",
            title: "舍夫沙万",
            description:
              "舍夫沙万是位于北非国家摩洛哥西北部的一座城市，被称为“蓝色之城”。舍夫沙万始建于1471年，最初是一个小型的堡垒，目的是抵御葡萄牙侵略。它位于摩洛哥西北部里夫山脉中，处于宽阔的山谷之中，临近地中海，北临直布罗陀海峡，与西班牙最南端的安达卢西亚地区隔海相望。当地保留着丰富的传统习俗，如传统的手工艺制作，包括皮革、纺织、铁器和传统木匠工作等，其中木制品是最畅销的手工业产品。",
          },
        ],
      },
    },
    recipies: {
      title: {
        ar: "الاطباق المميزة",
        ch: "特色菜",
      },
      content: {
        ar: [
          {
            img: "./images/ma/f1.jpg",
            title: "الطاجين",
            description:
              "يعد هذا أحد الأطباق الأكثر شهرة في المغرب، ويمكنك أيضًا تذوق الطاجين الأصيل في شفشاون. عادة ما يتم طهي اللحوم والخضروات والتوابل ببطء في وعاء طاجن خاص. يصبح اللحم طريًا والخضروات طرية والحساء غنيًا.",
          },
          {
            img: "./images/ma/f2.jpg",
            title: "الكسكس",
            description:
              "مصنوع من الكسكس ويقدم مع الخضار أو اللحوم أو المأكولات البحرية، يتميز بقوام ناعم ودبق بعد الطهي على البخار، كما تمتزج نكهات المكونات المختلفة معًا مما يجعله لذيذًا.",
          },
          {
            img: "./images/ma/f3.jpg",
            title: "لحم الضأن المشوي المغربي",
            description:
              "يتم اختيار لحم الضأن المحلي، ويتبل بالتوابل الخاصة ويتم تحميصه على نار الفحم، مع جلد ذهبي ومقرمش",
          },
        ],
        ch: [
          {
            img: "./images/ma/f1.jpg",
            title: "塔吉锅",
            description:
              "这是摩洛哥最具代表性的美食之一，在舍夫沙万也能品尝到正宗的塔吉锅。通常将肉类、蔬菜和香料放入特制的塔吉锅中慢炖而成，肉质鲜嫩，蔬菜软烂，汤汁浓郁。",
          },
          {
            img: "./images/ma/f2.jpg",
            title: "库斯库斯",
            description:
              "由粗麦粉制成，搭配蔬菜、肉类或海鲜，蒸熟后口感软糯，各种食材的味道相互融合，美味可口。",
          },
          {
            img: "./images/ma/f3.jpg",
            title: "摩洛哥烤羊",
            description:
              "选用当地的羊肉，经过特殊的香料腌制后在炭火上烤制，外皮金黄酥脆",
          },
        ],
      },
    },
  },
  tn: {
    flag: "./images/waving-flags/tunisia-flag-gif.gif",
    countryName: {
      ar: "تونس",
      ch: "突尼斯",
    },
    geo: {
      map: "./images/tn (1).svg",
      title: {
        ar: "الموقع الجغرافي",
        ch: "地理位置",
      },
      content: {
        ar: `تقع تونس في شمال أفريقيا وتبلغ مساحتها حوالي 163,610 كيلومتر مربع، مما يجعلها من أصغر الدول في أفريقيا. يحدها ليبيا من الشرق، والجزائر من الغرب، والبحر الأبيض المتوسط ​​من الشمال والشرق، ويبلغ طول ساحلها حوالي 1300 كيلومتر. تتكون ثلثي مساحة البلاد من الجبال والهضاب، في حين يتكون الشمال من السهول والمناطق الجبلية. تشمل التضاريس جبال الأطلس في الشمال والسهول الساحلية في الشرق. تتكون الأجزاء الوسطى والجنوبية بشكل أساسي من الصحاري وشبه الصحراوية، وتغطي الصحراء الكبرى جزءًا من البلاد. تتمتع المناطق الساحلية الشمالية بمناخ البحر الأبيض المتوسط ​​شبه الاستوائي، مع شتاء معتدل ممطر وصيف حار وجاف. يوجد عدد قليل من الأنهار في تونس، النهر الرئيسي هو نهر مجردة، ومعظم البحيرات عبارة عن مسطحات مائية موسمية. تعتبر موارد المياه الجوفية وفيرة  تعد مصدر للمياه المستخدمة في الزراعة والحياة اليومية.`,
        ch: `突尼斯位于非洲北部，面积约为163,610平方公里，是非洲面积较小的国家之一。东部与利比亚接壤，西部与阿尔及利亚为邻，北部和东部濒临地中海，海岸线长约1,300公里。全国三分之二的地区为山地和高原，北部为平原和丘陵地带。地形包括北部的阿特拉斯山脉和东部的沿海平原。中部和南部以沙漠和半沙漠为主，撒哈拉沙漠覆盖了部分国土。北部沿海地区属于亚热带地中海气候，冬季温和多雨，夏季炎热干燥,突尼斯境内河流稀少，主要河流为迈杰尔达河，湖泊也多为季节性水体。地下水资源丰富，是农业和生活用水的重要来源。`,
      },
      popover: {
        ar: [
          {
            name: "الصحراء الكبرى",
            info: "تقع في شمال أفريقيا، يحدها المحيط الأطلسي من الغرب، وجبال الأطلس والبحر الأبيض المتوسط ​​من الشمال، والبحر الأحمر من الشرق. تمتد عبر عدة دول بما في ذلك المغرب والجزائر وليبيا وموروتنيا ومصر. تبلغ طولها من الشرق إلى الغرب حوالي 5600 كيلومتر، وعرضها من الشمال إلى الجنوب حوالي 1600 كيلومتر، وتغطي مساحة تزيد على 9 ملايين كيلومتر مربع، وهي أكبر صحراء في العالم.",
          },
          {
            name: "جبال الأطلس",
            info: "تقع جبال الأطلس في شمال غرب أفريقيا، وتمتد عبر المغرب والجزائر وتونس، ويبلغ طولها حوالي 2400 كيلومتر وعرضها 450 كيلومتر. هي سلسلة الجبال الرئيسية في منطقة المغرب العربي، تمتد من أكادير في جنوب غرب المغرب إلى شمال شرق تونس العاصمة.",
          },
          {
            name: "نهر مجردة",
            info: "نهر المجردة هو نهر في شمال أفريقيا ينبع من جبال الأطلس، ويجري عبر شمال تونس، وأخيرا يتدفق إلى خليج تونس على البحر الأبيض المتوسط. ويبلغ الطول الإجمالي 450 كيلومترًا وتبلغ مساحة الحوض حوالي 23 ألف كيلومتر مربع.",
          },
        ],
        ch: [
          {
            name: "撒哈拉沙漠",
            info: "位于非洲北部，西临大西洋，北接阿特拉斯山脉和地中海，东濒红海，跨越摩洛哥、阿尔及利亚、利比亚、毛里塔尼亚和埃及。东西长度约为5600千米，南北宽度约1600千米，面积在900万平方千米以上，是世界上最大的沙漠",
          },
          {
            name: "阿特拉斯山脉",
            info: "阿特拉斯山脉位于非洲西北部，横跨摩洛哥、阿尔及利亚和突尼斯三国，全长约2,400公里，宽度达450公里。它是马格里布地区的主要山脉，从摩洛哥西南部的阿加迪尔延伸至突尼斯首都突尼斯东北部。",
          },
          {
            name: "迈杰尔达河",
            info: "迈杰尔达河是北非的一条河流，发源于的阿特拉斯山脉，流经突尼斯北部地区，最终注入地中海的突尼斯湾。全长450公里，流域面积约23000平方公里。",
          },
        ],
      },
    },
    cities: {
      title: {
        ar: "العاصمة و الوجهات السياحية",
        ch: "首都与旅游地",
      },
      content: {
        ar: [
          {
            img: "./images/tn/c1.jpg",
            title: "مدينة تونس",
            description:
              "تعد مدينة تونس عاصمة البلاد، وهي مزيج رائع بين الحداثة والتقاليد. فهي تضم مناطق تجارية مزدهرة ومبانٍ حديثة، إلى جانب المدينة العتيقة التي تتميز بأزقتها الضيقة والمتعرجة، والأسواق المليئة بالمشغولات اليدوية، مما يعكس الأجواء الثقافية والتاريخية الغنية للمدينة",
          },
          {
            img: "./images/tn/c2.jpg",
            title: "سيدى بوسعيد (البلدة الزرقاء و البيضاء )",
            description:
              'تقع هذه البلدة، المعروفة باسم سيدي بوسعيد، في شمال شرق العاصمة تونس. اكتسبت اسمها "البلدة الزرقاء والبيضاء" بسبب لون منازلها، حيث تتميز جدرانها باللون الأبيض ونوافذها وأبوابها باللون الأزرق، مما يخلق مشهدًا ساحرًا على حافة البحر الأبيض المتوسط. تُبهر هذه البلدة زوارها ببساطتها وجمالها الأخّاذ، حيث تمتد أزقتها المرصوفة بالحصى بشكل متعرج مع انحدار الجبال، مما يضفي عليها طابعًا فريدًا',
          },
          {
            img: "./images/tn/c3.jpg",
            title: "مدينة الحمامات",
            description:
              "تُعد الحمامات من أقدم المدن التاريخية وأحد أشهر الوجهات السياحية في تونس. تشتهر بشواطئها الساحرة، ومياهها البحرية الصافية، وأشعة شمسها الدافئة، مما يجعلها وجهة مثالية للاسترخاء والاستجمام. بالإضافة إلى ذلك، تحتضن الحمامات العديد من المعالم التاريخية والثقافية، مثل قلعة الحمامات وحدائق الأندلس، التي تعكس التراث الغني والتاريخ العريق لتونس.",
          },
        ],
        ch: [
          {
            img: "./images/tn/c1.jpg",
            title: "突尼斯城",
            description:
              "突尼斯的首都，融合了现代与传统特色。既有繁华的商业区、现代化建筑，也有充满阿拉伯风情的麦地那老城，其狭窄曲折的街道、琳琅满目的手工艺品店，展现出浓郁的历史文化氛围。",
          },
          {
            img: "./images/tn/c2.jpg",
            title: "蓝白小镇",
            description:
              "蓝白小镇北非小镇位于突尼斯首都突尼斯城东北部，名叫西迪之所以称它为“蓝白小镇”，是因为这个坐落在地中海边峭壁上的镇子，所有的房屋只有两种颜色，白色的墙，蓝色的门窗。如此单纯，却是如此美丽。整个小镇是沿山势蜿蜒而上的，布局很简单，一条鹅卵石铺就的街道，两边是在阳光下闪闪发亮的白色房屋。",
          },
          {
            img: "./images/tn/c3.jpg",
            title: "哈马马特",
            description:
              "一座历史悠久的古城，也是突尼斯著名的旅游区。这里有迷人的海滩、清澈的海水和温暖的阳光，是度假和休闲的理想之地。此外，哈马马特还有许多历史文化遗迹，如哈马马特城堡、安达卢西亚花园等，展示了突尼斯丰富的历史和文化底蕴。",
          },
        ],
      },
    },
    recipies: {
      title: {
        ar: "الاطباق المميزة",
        ch: "特色菜",
      },
      content: {
        ar: [
          {
            img: "./images/tn/f1.jpg",
            title: "شوربة السمك التونسية",
            description:
              "نظرًا لموقع تونس على البحر الأبيض المتوسط ووفرة الموارد البحرية، تُعد شوربة السمك من الأطباق المحببة والمميزة في المطبخ التونسي. تعتمد هذه الوصفة بشكل أساسي على الأسماك البحرية الطازجة، حيث يتم طهيها مع الطماطم، زيت الزيتون، والتوابل المتوسطية، مما يمنحها نكهة غنية ولذيذة. تُقدَّم هذه الشوربة عادةً مع الخبز أو الأرز، مما يجعلها وجبة متكاملة ومغذية",
          },
          {
            img: "./images/tn/f2.jpg",
            title: "البريك التونسي",
            description:
              "البريك هو نوع من المعجنات المقلية المقرمشة، يتميز بقشرة هشة وحشوة غنية. يُعتبر من الأطباق التقليدية التونسية التي تُحضر بحشوات مختلفة، ولكن النسخة الكلاسيكية منه تحتوي على البيض، التونة، البطاطس، والتوابل، ثم يُقلى حتى يصبح ذهبي اللون ومقرمشًا. يُعد البريك جزءًا أساسيًا من المائدة التونسية اليومية، وغالبًا ما يتم تناوله مع كوب من الشاي بالنعناع، مما يضفي عليه نكهة رائعة ومتوازنة",
          },
        ],
        ch: [
          {
            img: "./images/tn/f1.jpg",
            title: "突尼斯海鲜杂烩（鱼杂烩)",
            description:
              "由于突尼斯濒临地中海，海鲜资源丰富，鱼杂烩成为一道备受喜爱的美食。这道菜以新鲜海鱼为主，搭配番茄、橄榄油和地中海香料炖煮而成，味道鲜美，营养丰富，通常搭配面包或米饭享用。",
          },
          {
            img: "./images/tn/f2.jpg",
            title: "突尼斯布里克",
            description:
              "布里克是一种油炸酥皮点心，外皮酥脆，内馅丰富。经典的布里克通常包裹着鸡蛋、金枪鱼、土豆和香料，然后炸至金黄。布里克是突尼斯人日常餐桌上的常见美食，通常搭配一杯薄荷茶食用，口感极佳。",
          },
        ],
      },
    },
    economy: {
      title: {
        ar: `الموارد الطبيعية و مصادر الدخل `,
        ch: `自然资源与收入来源`,
      },
      content: {
        ar: [
          {
            icon: "./images/gold.png",
            title: "الموارد الطبيعية",
            text: "تعتبر الموارد الطبيعية في تونس محدودة نسبيًا، وتشمل بشكل رئيسي الفوسفات، النفط، الغاز الطبيعي، وخام الحديد. يُعد الفوسفات أحد أهم الموارد المعدنية في البلاد، حيث يُقدَّر احتياطيه بحوالي 2 مليار طن، مما يجعل تونس تحتل المرتبة الخامسة عالميًا. أما النفط، فقد بلغ احتياطيه المؤكد حوالي 70 مليون طن، بينما تصل احتياطيات الغاز الطبيعي إلى 615 مليار متر مكعب. بالإضافة إلى ذلك، تُقدَّر احتياطيات خام الحديد بحوالي 25 مليون طن. يلعب تطوير واستغلال هذه الموارد دورًا مهمًا في دعم نمو الاقتصاد التونسي.",
          },
          {
            icon: "./images/gold.png",
            title: "التعدين",
            text: " في قطاع التعدين، يشكل استخراج ومعالجة الفوسفات ركيزة مهمة للاقتصاد الوطني، حيث وصل إنتاج الفوسفات حوالي 2,9 مليون طن في عام 2023.",
          },
          {
            icon: "./images/planting.png",
            title: "الزراعة",
            text: "في الزراعة، يعد زيت الزيتون المنتج الزراعي الرئيسي للتصدير، حيث يمثل 4% إلى 9% من إجمالي إنتاج زيت الزيتون في العالم.",
          },
          {
            icon: "./images/travel-and-tourism.png",
            title: "السياحة",
            text: "تعد السياحة منذ فترة طويلة مصدرًا أساسيًا في الاقتصاد التونسي، حيث تمثل حوالي 7% من الناتج المحلي الإجمالي.",
          },
        ],
        ch: [
          {
            icon: "./images/gold.png",
            title: "自然资源",
            text: "突尼斯的自然资源相对有限，主要包括磷酸盐、石油、天然气、铁矿石等矿产资源。其中，磷酸盐是最重要的矿产资源之一，储量约为20亿吨，位居世界第五位。石油方面，探明储量约为7000万吨，天然气储量约为615亿立方米。此外，铁矿石储量约为2500万吨。这些矿产资源的开发和利用对突尼斯的经济发展起着重要作用",
          },
          {
            icon: "./images/gold.png",
            title: "矿业与矿产资源",
            text: "矿业方面，磷酸盐的开采和加工是国家经济的重要支柱，2023年磷酸盐产量达到290万吨。",
          },
          {
            icon: "./images/planting.png",
            title: "农业",
            text: "农业方面，橄榄油是主要的出口创汇农产品，产量占世界橄榄油总产量的4%至9%。",
          },
          {
            icon: "./images/travel-and-tourism.png",
            title: "旅游业",
            text: "旅游业长期以来一直是突尼斯国民经济的支柱产业，约占GDP的7%。",
          },
        ],
      },
    },
  },
  ly: {
    flag: "./images/waving-flags/libya-flag-gif.gif",
    countryName: {
      ar: "ليبيا",
      ch: "利比亚",
    },
    geo: {
      map: "./images/maps/ly.svg",
      title: {
        ar: "الموقع الجغرافي",
        ch: "地理位置",
      },
      content: {
        ar: `تقع ليبيا في شمال أفريقيا، وتبلغ مساحتها 1,759,540 كيلومتر مربع، ما يجعلها رابع أكبر دولة في أفريقيا. تحدها مصر من الشرق، والسودان من الجنوب الشرقي، وتشاد والنيجر من الجنوب، والجزائر وتونس من الغرب، والبحر الأبيض المتوسط ​​من الشمال، ويبلغ طول سواحلها حوالي 1900 كيلومتر. أكثر من 95% من مساحة البلاد صحراوية وشبه صحراوية. وتوجد سهول على طول الساحل الشمالي، لكن معظم المساحة صحراوية. بما في ذلك الصحراء الكبرى التي تغطي معظم أنحاء البلاد، والتي تهيمن عليها الهضاب والسهول الصخرية؛ وتتمتع المناطق الساحلية الشمالية بمناخ البحر الأبيض المتوسط ​​شبه الاستوائي. لا توجد أنهار وبحيرات دائمة في ليبيا، والآبار والينابيع منتشرة على نطاق واسع، وهي المصدر الرئيسي للمياه.`,
        ch: `利比亚位于非洲北部，面积1759540平方公里，是非洲面积第四大国家。东部与埃及交界，东南与苏丹为邻，南部同乍得和尼日尔毗连，西部与阿尔及利亚和突尼斯接壤，北部临地中海，海岸线长约1900余公里。全境95%以上地区为沙漠和半沙漠，北部沿海有平原，但大部分地区为沙漠。地形包括撒哈拉沙漠，它覆盖大部分国土，以岩石高原和平原为主；北部沿海地区气候为亚热带地中海气候利比亚境内没有常年性河流和湖泊，井泉分布较广，是主要水源`,
      },
      popover: {
        ar: [
          {
            name: "الصحراء الكبرى",
            info: "تقع في شمال أفريقيا، يحدها المحيط الأطلسي من الغرب، وجبال الأطلس والبحر الأبيض المتوسط ​​من الشمال، والبحر الأحمر من الشرق. تمتد عبر عدة دول بما في ذلك المغرب والجزائر وليبيا ومصر. يبلغ طولها من الشرق إلى الغرب حوالي 5600 كيلومتر، وعرضها من الشمال إلى الجنوب حوالي 1600 كيلومتر، وتغطي مساحة تزيد على 9 ملايين كيلومتر مربع، وهي أكبر صحراء في العالم.",
          },
        ],
        ch: [
          {
            name: "撒哈拉沙漠",
            info: "位于非洲北部，西临大西洋，北接阿特拉斯山脉和地中海，东濒红海，跨越摩洛哥、阿尔及利亚、利比亚、埃及等多个国家。东西长度约为5600千米，南北宽度约1600千米，面积在900万平方千米以上，是世界上最大的沙漠。",
          },
        ],
      },
    },
    cities: {
      title: {
        ar: "العاصمة و الوجهات السياحية",
        ch: "首都与旅游地",
      },
      content: {
        ar: [
          {
            img: "./images/ly/Tripoli.jpeg",
            title: "مدينة طرابلس",
            description:
              "طرابلس هي عاصمة ليبيا وأكبر مدينة في البلاد وميناء مهم. تقع في الشمال الغربي، وتتميز بمواقع تاريخية غنية، مثل موقع صبراتة الأثري الذي يعود إلى العصر الروماني، والذي يجمع بين الثقافة العربية والبحر المتوسط.",
          },
          {
            img: "./images/ly/Old-City-of-Ghadames.jpeg",
            title: "مدينة غدامس القديمة",
            description:
              "مدينة غدامس القديمة هي واحدة من أقدم الواحات في العالم، وتشتهر بأسلوبها المعماري الصحراوي وثقافتها التقليدية، وتُعد مكانًا رائعًا لاستكشاف طبيعة الحياة الصحراوية.",
          },
          {
            img: "./images/ly/Green-Mountain.jpeg",
            title: "الجبل الأخضر",
            description:
              "يقع الجبل الأخضر في المنطقة الساحلية شمال شرق ليبيا، وهو سلسلة جبال جيرية يبلغ طولها 160 كيلومترًا وعرضها 32 كيلومترًا، ويتميز بمناخ البحر الأبيض المتوسط. يُعد مكانًا مثاليًا للتنزه ورياضة المشي، حيث يمكن للزوار الاستمتاع بالمناظر الطبيعية الخلابة.",
          },
        ],
        ch: [
          {
            img: "./images/ly/Tripoli.jpeg",
            title: "黎波里",
            description:
              "黎波里是利比亚的首都，也是国家最大城市和重要港口，位于西北部，拥有丰富的历史遗迹，如罗马时期的塞卜拉泰考古遗址，融合了阿拉伯和地中海文化。",
          },
          {
            img: "./images/ly/Old-City-of-Ghadames.jpeg",
            title: "加达梅斯古城",
            description:
              "加达梅斯古城是世界上最古老的绿洲之一,以其沙漠建筑风格和传统文化闻名,是领略沙漠风情的好地方。",
          },
          {
            img: "./images/ly/Green-Mountain.jpeg",
            title: "绿山",
            description:
              "绿山位于利比亚东北部的沿海地区，是一个石灰岩山系，长160公里，宽32公里,属地中海式气候，适合徒步和登山，能欣赏到自然风光。",
          },
        ],
      },
    },
    recipies: {
      title: {
        ar: "الاطباق المميزة",
        ch: "特色菜",
      },
      content: {
        ar: [
          {
            img: "./images/ly/Bazeen.jpeg",
            title: "البازين",
            description:
              "يُعتبر البازين أحد أبرز الأطباق التقليدية في ليبيا، حيث يحمل في طياته تراثًا ثقافيًا عريقًا. يُحضَّر بشكل أساسي من دقيق الشعير، والذي يُعد من المحاصيل الزراعية الأساسية في ليبيا، ما يجعله طبقًا يعكس هوية المطبخ الليبي.",
          },
          {
            img: "./images/ly/Aseedah.jpeg",
            title: "العصيدة",
            description:
              "تحتل العصيدة مكانة مميزة في المطبخ الليبي، وهي رمز للفرح والاحتفال، حيث يتم إعدادها وتقديمها في المناسبات السعيدة والتجمعات العائلية. تتكون العصيدة من مكونات بسيطة تشمل دقيق القمح، زيت الزيتون، والزبدة.",
          },
          {
            img: "./images/ly/Harira-Soup.jpeg",
            title: "شوربة الحريرة",
            description:
              "تُعد شوربة الحريرة من الأطباق التقليدية الشهيرة في ليبيا، وتتمتع بمكانة خاصة في الثقافة الغذائية الليبية، لا سيما خلال شهر رمضان المبارك. فهي طبق أساسي على مائدة الإفطار عند كسر الصيام، وتتميز بقيمتها الغذائية العالية ونكهتها المميزة.",
          },
        ],
        ch: [
          {
            img: "./images/ly/Bazeen.jpeg",
            title: "巴津",
            description:
              "巴津是利比亚传统美食的杰出代表，承载着深厚的历史文化底蕴。它主要以大麦粉制作，在利比亚，大麦广泛种植，为这道美食提供了优质原料。",
          },
          {
            img: "./images/ly/Aseedah.jpeg",
            title: "阿西达",
            description:
              "阿西达是利比亚美食中占据特殊地位，是甜蜜与欢乐的象征，常出现在各类庆祝活动与家庭聚会中。它的制作原料简单，主要为小麦粉、橄榄油和黄油。",
          },
          {
            img: "./images/ly/Harira-Soup.jpeg",
            title: "哈里拉汤",
            description:
              "哈里拉汤是利比亚的饮食文化中占据重要地位，是一道极具代表性的传统汤品，尤其在斋月期间，它是人们开斋时必不可少的佳肴。",
          },
        ],
      },
    },
    economy: {
      title: {
        ar: `الموارد الطبيعية و مصادر الدخل `,
        ch: `自然资源与收入来源`,
      },
      content: {
        ar: [
          {
            icon: "./images/gold.png",
            title: "الموارد الطبيعية",
            text: "تتمتع ليبيا بموارد طبيعية غنية، حيث تعد احتياطيات النفط والغاز الطبيعي الأكثر بروزًا. تبلغ احتياطيات النفط في ليبيا حوالي 43 مليار برميل، مما يجعلها الأولى في أفريقيا من حيث الاحتياطي. أما احتياطيات الغاز الطبيعي المؤكدة فتصل إلى 1.54 تريليون متر مكعب، مما يجعلها رابع أكبر دولة في أفريقيا في هذا المجال.",
          },
          {
            icon: "./images/icons/mining-cart.png",
            title: "التعدين",
            text: "بالإضافة إلى ذلك، تمتلك ليبيا كميات كبيرة من الموارد المعدنية، مثل خام الحديد، الفوسفات، الجبس، والمعادن الأخرى. يقدر احتياطي خام الحديد بما بين 20 و30 مليار طن، ويتركز بشكل رئيسي في منطقة وادي الشاطئ جنوب البلاد. بينما تتركز الفوسفات في المناطق الجنوبية الشرقية، ويستخدم على نطاق واسع في الزراعة والصناعات الكيماوية.",
          },
          {
            icon: "./images/planting.png",
            title: "الزراعة",
            text: "ورغم القيود التي تفرضها الظروف المناخية وشح الموارد المائية، فإن الزراعة تحتل مكانة مهمة، خاصة في المناطق الساحلية. حيث يتم زراعة القمح والشعير والزيتون والتمور، وتُعد التمور وزيت الزيتون من المنتجات الزراعية الرئيسية المخصصة للتصدير.",
          },
          {
            icon: "./images/fishermen.png",
            title: "الصيد",
            text: "تتمتع ليبيا بثروة سمكية غنية على طول سواحلها التي تمتد لأكثر من 1900 كيلومتر على البحر الأبيض المتوسط. تشمل الثروة السمكية أنواعًا متعددة مثل التونة والسردين والإسفنج، ما يجعلها مصدرًا هامًا للدخل في المناطق الساحلية.",
          },
          {
            icon: "./images/factory.png",
            title: "الصناعة والبناء",
            text: "تشكل الصناعة وقطاع البناء جزءًا مهمًا من الاقتصاد الليبي، وتتركز بشكل خاص في مدينتي مصراتة وسرت، وتشمل إنتاج الصلب ومواد البناء والصناعات الكيميائية.",
          },
        ],
        ch: [
          {
            icon: "./images/gold.png",
            title: "自然资源",
            text: "利比亚自然资源丰富，尤其以石油和天然气储量最为突出。石油储量约为430亿桶，位居非洲之最，天然气探明储量达1.54万亿立方米，居非洲第四位。",
          },
          {
            icon: "./images/icons/mining-cart.png",
            title: "矿业与矿产资源",
            text: "此外，利比亚还拥有大量矿产资源，如铁矿石、磷酸盐、石膏和其他金属矿。铁矿石储量约为20至30亿吨，主要分布在南部的瓦迪沙提地区，而磷酸盐主要集中在东南部，广泛应用于农业和化工领域。",
          },
          {
            icon: "./images/planting.png",
            title: "农业",
            text: "农业虽然受到气候和水资源限制，但在沿海地区和人工灌溉区域，种植小麦、大麦、橄榄、枣椰等经济作物，枣椰和橄榄油已成为出口创汇的重要来源。",
          },
          {
            icon: "./images/fishermen.png",
            title: "渔业",
            text: "利比亚的海洋资源同样丰富，拥有1900多公里的地中海海岸线，渔业资源包括金枪鱼、沙丁鱼和海绵等海产品，成为沿海经济的重要组成部分。",
          },
          {
            icon: "./images/factory.png",
            title: "工业与建筑业",
            text: "此外，工业和建筑业也是利比亚经济的重要组成部分，主要集中在米苏拉塔和苏尔特等城市，涵盖钢铁、建材、化工等领域。",
          },
        ],
      },
    },
  },
  mr: {
    flag: "./images/waving-flags/mauritania-flag-gif.gif",
    countryName: {
      ar: "موروتنيا",
      ch: "毛里塔尼亚",
    },
    geo: {
      map: "./images/maps/mr.svg",
      title: {
        ar: "الموقع الجغرافي",
        ch: "地理位置",
      },
      content: {
        ar: `تقع موريتانيا في شمال غرب أفريقيا. عاصمتها نواكشوط وهي من أكبر مدن موريتانيا. كما أنها المركز السياسي والثقافي والتجاري والمالي للبلاد وواحدة من أكبر المدن في منطقة الساحل. تبلغ مساحة موريتانيا حوالي 1,030,700 كيلومتر مربع. تحدها الجزائر من الشرق والشمال الشرقي، ومالي من الجنوب الشرقي، والسنغال من الجنوب، والمحيط الأطلسي من الغرب، بساحل يبلغ طوله حوالي 754 كيلومترًا. تتكون تضاريس موريتانيا من هضاب وصحاري مسطحة، وتغطي الصحراء الكبرى معظم البلاد. تتكون الأجزاء الشمالية والوسطى من هضاب يبلغ متوسط ​​ارتفاعها حوالي 200 إلى 500 متر، في حين أن الجنوب عبارة عن سهل منخفض في حوض نهر السنغال. المناخ جاف، مع مناخ صحراوي استوائي في الشمال ومناخ السافانا الاستوائية في الجنوب، وهطول الأمطار نادر وغير متساوٍ. هناك عدد قليل من الأنهار في موريتانيا، النهر الرئيسي هو نهر السنغال، ومعظم البحيرات هي مسطحات مائية موسمية.`,
        ch: `毛里塔尼亚位于非洲西北部，努瓦克肖特是毛里塔尼亚的首都和最大城市，同时也是该国的政治、文化、商业、金融中心和萨赫勒地区最大城市之一。毛里塔尼亚的面积约为1,030,700平方公里。东部和东北部与阿尔及利亚接壤，东南部与马里相邻，南部与塞内加尔交界，西部濒临大西洋，海岸线长约754公里。毛里塔尼亚地形以平坦的高原和沙漠为主，撒哈拉沙漠覆盖了国土的大部分地区。北部和中部为高原，平均海拔约200至500米，南部为塞内加尔河流域的低地平原。气候干旱，北部为热带沙漠气候，南部为热带草原气候，降水稀少且不均匀。毛里塔尼亚境内河流稀少，主要河流为塞内加尔河，湖泊也多为季节性水体。`,
      },
      popover: {
        ar: [
          {
            name: "الصحراء الكبرى",
            info: "تقع في شمال أفريقيا، يحدها المحيط الأطلسي من الغرب، وجبال الأطلس والبحر الأبيض المتوسط ​​من الشمال، والبحر الأحمر من الشرق. تمتد عبر عدة دول بما في ذلك المغرب والجزائر وليبيا وموريتانيا ومصر. يبلغ طولها من الشرق إلى الغرب حوالي 5600 كيلومتر، وعرضها من الشمال إلى الجنوب حوالي 1600 كيلومتر، وتغطي مساحة تزيد على 9 ملايين كيلومتر مربع، وهي أكبر صحراء في العالم.",
          },
          {
            name: "نهر السنغال",
            info: "ينبع نهر السنغال من هضبة فوتا جالون في غينيا، ويتدفق عبر غينيا ومالي والسنغال وموريتانيا، ويتدفق أخيرًا إلى المحيط الأطلسي في سانت لويس السنغال.",
          },
        ],
        ch: [
          {
            name: "撒哈拉沙漠",
            info: "位于非洲北部，西临大西洋，北接阿特拉斯山脉和地中海，东濒红海，跨越摩洛哥、阿尔及利亚、利比亚、毛里塔尼亚和埃及。东西长度约为5600千米，南北宽度约1600千米，面积在900万平方千米以上，是世界上最大的沙漠。",
          },
          {
            name: "塞内加尔河",
            info: "塞内加尔河发源于几内亚的富塔贾隆高原，流经几内亚、马里、塞内加尔和毛里塔尼亚，最终在塞内加尔的圣路易注入大西洋。",
          },
        ],
      },
    },
    cities: {
      title: {
        ar: "العاصمة و الوجهات السياحية",
        ch: "首都与旅游地",
      },
      content: {
        ar: [
          {
            img: "./images/mr/c2.jpg",
            title: "نواكشوط",
            description:
              "نواكشوط هي عاصمة موريتانيا وأكبر مدنها، وتقع على الساحل الأطلسي في غرب البلاد. تتميز نواكشوط بأجواء ثقافية غنية، حيث تُقام فيها معارض فنية وفعاليات ثقافية تعكس الطابع الفريد للثقافة الموريتانية. كما تُعد المدينة مركزًا حيويًا يربط موريتانيا ببقية أنحاء العالم.",
          },
          {
            img: "./images/mr/c1.jpg",
            title: "عين الصحراء",
            description:
              "عين الصحراء تُعرف أيضًا باسم هيكل الريشات، وتقع بالقرب من هضبة أدرار في موريتانيا. وهي عبارة عن شكل دائري ضخم متحدة المركز يبلغ قطره حوالي 50 كيلومترًا في الصحراء الكبرى. كان من المعتقد في البداية أنها حفرة اصطدام نيزك، ولكن تم التعرف عليها الآن على أنها بنية قبة جيولوجية، وأصبحت معلمًا بارزًا لرواد الفضاء في الفضاء بسبب شكلها الفريد.",
          },
        ],
        ch: [
          {
            img: "./images/mr/c2.jpg",
            title: "努瓦克肖特",
            description:
              "努瓦克肖特是毛里塔尼亚的首都，也是该国最大的城市。它位于毛里塔尼亚西部大西洋沿岸，努瓦克肖特的文化氛围浓厚，有各种艺术展览和文化活动，展现着毛里塔尼亚独特的文化魅力，同时，它也是连接毛里塔尼亚与世界其他地区的重要枢纽。",
          },
          {
            img: "./images/mr/c1.jpg",
            title: "撒哈拉之眼",
            description:
              "撒哈拉之眼又称里沙特结构，位于毛里塔尼亚阿德拉尔高原附近，是撒哈拉沙漠中一个直径约50公里的巨大同心圆地貌。最初被认为是陨石撞击坑，但现在被认为是地质穹隆结构，因其独特的形状而成为宇航员在太空中的地标。",
          },
        ],
      },
    },
    recipies: {
      title: {
        ar: "الاطباق المميزة",
        ch: "特色菜",
      },
      content: {
        ar: [
          {
            img: "./images/mr/f1.jpg",
            title: "التّيش( الأرز بالسمك)",
            description:
              "الطبق الوطني الموريتاني، ثيبوديان، هو من الأطباق التي يجب على أي شخص يزور البلاد تجربتها. تتكون هذه الوجبة اللذيذة من السمك والأرز والطماطم، وغالبًا ما يتم تقديمها مع مجموعة متنوعة من الخضروات مثل البطاطا الحلوة والجزر والملفوف.",
          },
          {
            img: "./images/mr/f2.jpg",
            title: "الكسكس الموريتاني",
            description:
              "الكسكس هو أحد الأطعمة الرئيسية في المطبخ الموريتاني، ويتم تحضيره بعدة طرق مختلفة. في موريتانيا، يُطهى الكسكس على البخار حتى يصبح هشًا وخفيفًا، ويُقدم عادةً مع الخضروات أو اللحم المطهو ببطء. يُحضر هذا الحساء من الطماطم، البصل، الجزر، الكوسا، والتوابل، ما يجعله إضافة غنية ومشبعة إلى الكسكس الخفيف.",
          },
        ],
        ch: [
          {
            img: "./images/mr/f1.jpg",
            title: "蒂布迪安 (鱼饭)",
            description:
              "蒂布迪安是毛里塔尼亚的国菜，任何访问该国的人都必须尝试的美食。 这顿美味的餐点包括鱼、米饭和西红柿，通常配以各种蔬菜，如红薯、胡萝卜和卷心菜。",
          },
          {
            img: "./images/mr/f2.jpg",
            title: "毛里塔尼亚蒸粗麦粉",
            description:
              "蒸粗麦粉是毛里塔尼亚饮食中的主食，通常有多种制作方法。 在毛里塔尼亚，蒸粗麦粉被蒸至蓬松，通常与蔬菜或炖肉一起浇在上面。 这道炖菜由西红柿、洋葱、胡萝卜、西葫芦和香料制成，为清淡的谷物提供了丰富而丰盛的补充。",
          },
        ],
      },
    },
    economy: {
      title: {
        ar: `الموارد الطبيعية و مصادر الدخل `,
        ch: `自然资源与收入来源`,
      },
      content: {
        ar: [
          {
            icon: "./images/gold.png",
            title: "الموارد الطبيعية",
            text: "تمتلك موريتانيا موارد طبيعية غنية، وخاصة في قطاع المعادن، والثروة السمكية، والأراضي الزراعية.",
          },
          {
            icon: "./images/gold.png",
            title: "التعدين",
            text: "تمتلك موريتانيا احتياطيًا مثبتًا من خام الحديد يتجاوز 15 مليار طن، ونحو 2800 مليون طن من النحاس، وأكثر من 35 مليون أوقية من الذهب، وما يزيد عن 140 مليون طن من الفوسفات.",
          },
          {
            icon: "./images/fishermen.png",
            title: "الصيد",
            text: "أما الثروة السمكية، فتعتبر موريتانيا من أغنى الدول بها، حيث تمتلك خط ساحلي بطول 754 كيلومترًا، مما يجعلها واحدة من أغنى مناطق الصيد في العالم.",
          },
        ],
        ch: [
          {
            icon: "./images/gold.png",
            title: "自然资源",
            text: "毛里塔尼亚拥有丰富的自然资源，尤其是矿产、渔业和土地资源。",
          },
          {
            icon: "./images/gold.png",
            title: "矿业与矿产资源",
            text: "铁矿石储量超过15亿吨，铜矿储量约2800万吨，黄金储量超3500万盎司，磷酸盐储量超过1.4亿吨。",
          },
          {
            icon: "./images/fishermen.png",
            title: "渔业",
            text: "渔业资源同样丰富，毛里塔尼亚海岸线长达754公里，是世界上渔业资源最丰富的地区之一。",
          },
        ],
      },
    },
  },
  dz: {
    flag: "./images/waving-flags/algeria-flag-gif.gif",
    countryName: {
      ar: "الجزائر",
      ch: "阿尔及利亚",
    },
    geo: {
      map: "./images/maps/dz.svg",
      title: {
        ar: "الموقع الجغرافي",
        ch: "地理位置",
      },
      content: {
        ar: `تقع الجزائر في شمال أفريقيا، وتبلغ مساحتها حوالي 2,381,741 كيلومتر مربع، وهي أكبر دولة في أفريقيا وعاشر أكبر دولة في العالم. يحدها ليبيا والنيجر من الشرق، ومالي وموريتانيا من الجنوب، والمغرب من الغرب، والبحر الأبيض المتوسط ​​من الشمال، ويبلغ طول ساحلها نحو 1200 كيلومتر. أكثر من 80% من مساحة البلاد عبارة عن صحراء وشبه صحراوية، بما في ذلك جبال الأطلس في الشمال. تغطي الصحراء الكبرى مساحة كبيرة من جنوب الجزائر. تتمتع المناطق الساحلية الشمالية بمناخ البحر الأبيض المتوسط ​​شبه الاستوائي مع شتاء معتدل ممطر وصيف حار وجاف. هناك عدد قليل من الأنهار في الجزائر، ومعظمها أنهار موسمية، ومعظم البحيرات هي أيضًا مسطحات مائية موسمية. تعتبر موارد المياه الجوفية وفيرة وتشكل مصدرًا مهمًا للمياه للزراعة والاستخدام المنزلي.`,
        ch: `阿尔及利亚位于非洲北部，占地面积约为2,381,741平方公里，是非洲面积最大的国家，也是世界第十大国家。东部与利比亚、尼日尔接壤，南部与马里、毛里塔尼亚接壤，西部与摩洛哥接壤，北部濒临地中海，海岸线长约1,200公里。全国80%以上的地区为沙漠和半沙漠，地形包括北部的阿特拉斯山脉。撒哈拉沙漠覆盖了阿尔及利亚的大部分南部地区。北部沿海地区属于亚热带地中海气候，冬季温和多雨，夏季炎热干燥。阿尔及利亚境内河流稀少，多为季节性河流，湖泊也多为季节性水体。地下水资源丰富，是农业和生活用水的重要来源。`,
      },
      popover: {
        ar: [
          {
            name: "الصحراء الكبرى",
            info: "تقع في شمال أفريقيا، يحدها المحيط الأطلسي من الغرب، وجبال الأطلس والبحر الأبيض المتوسط ​​من الشمال، والبحر الأحمر من الشرق. تمتد عبر عدة دول بما في ذلك المغرب والجزائر وليبيا و موروتنيا  ومصر. يبلغ طولها من الشرق إلى الغرب حوالي 5600 كيلومتر، وعرضها من الشمال إلى الجنوب حوالي 1600 كيلومتر، وتغطي مساحة تزيد على 9 ملايين كيلومتر مربع، وهي أكبر صحراء في العالم.",
          },
          {
            name: "جبال الأطلس",
            info: "تقع جبال الأطلس في شمال غرب أفريقيا، وتمتد عبر المغرب والجزائر وتونس، ويبلغ طولها حوالي 2400 كيلومتر وعرضها 450 كيلومتر. هي سلسلة الجبال الرئيسية في منطقة المغرب العربي، تمتد من أكادير في جنوب غرب المغرب إلى شمال شرق تونس العاصمة.",
          },
        ],
        ch: [
          {
            name: "撒哈拉沙漠",
            info: "位于非洲北部，西临大西洋，北接阿特拉斯山脉和地中海，东濒红海，跨越摩洛哥、阿尔及利亚、利比亚、毛里塔尼亚和埃及。东西长度约为5600千米，南北宽度约1600千米，面积在900万平方千米以上，是世界上最大的沙漠。",
          },
          {
            name: "阿特拉斯山脉",
            info: "阿特拉斯山脉位于非洲西北部，横跨摩洛哥、阿尔及利亚和突尼斯三国，全长约2,400公里，宽度达450公里。它是马格里布地区的主要山脉，从摩洛哥西南部的阿加迪尔延伸至突尼斯首都突尼斯东北部。",
          },
        ],
      },
    },
    recipies: {
      title: {
        ar: "الأطباق المميزة",
        ch: "特色菜",
      },
      content: {
        ar: [
          {
            img: "./images/dz/f3.jpg",
            title: "طاجين الخضار",
            description:
              "طاجين الخضار هو انعكاس فريد لثقافة الطعام التقليدية في الجزائر. يُستخدم الطاجين، وهو وعاء فخاري مخروطي الشكل يُوزع الحرارة بالتساوي، كأفضل أداة لطهي هذا الطبق. يضم الطاجين مزيجًا من الخضروات الطازجة مثل الجزر والكوسا والباذنجان والبطاطس، والتي تُزرع في الأراضي الخصبة بالجزائر، مما يجعلها طازجة وطبيعية.",
          },
          {
            img: "./images/dz/f2.jpg",
            title: "الشكشوكة",
            description:
              "الشكشوكة هو طبق جزائري تقليدي يُحضر أساسًا من البصل والفلفل والطماطم والبيض والبقدونس. يتميز هذا الطبق بنكهته اللذيذة التي تجمع بين الطماطم الحمضية والبيض الطري، ويُعد خيارًا شائعًا على مائدة الإفطار أو الغداء في العائلات الجزائرية.",
          },
          {
            img: "./images/dz/f1.jpg",
            title: "السردين المقلي",
            description:
              "السردين المقلي الجزائري هو طبق بحري يتميز بالنكهات الجزائرية الأصيلة. يُعد باستخدام السردين الطازج الذي يتم تتبيله وتحميره بتقنيات خاصة. يُعد هذا الطبق شائعًا بشكل خاص في المناطق الساحلية الجزائرية.",
          },
        ],
        ch: [
          {
            img: "./images/dz/f3.jpg",
            title: "蔬菜塔吉锅",
            description:
              "蔬菜塔吉锅是阿尔及利亚传统饮食文化的独特结晶。塔吉锅作为当地特有的锥形陶锅，受热均匀，是烹饪这道菜的绝佳器具。锅中汇聚胡萝卜、西葫芦、茄子、土豆等各类新鲜蔬菜，这些蔬菜皆来自阿尔及利亚肥沃的土地，天然且新鲜。",
          },
          {
            img: "./images/dz/f2.jpg",
            title: "苏库卡",
            description:
              "苏库卡是一道阿尔及利亚特色菜，主要由洋葱、辣椒、番茄、鸡蛋和欧芹制成。鸡蛋与浓郁的番茄酱汁搭配，风味酸甜鲜美，常作为阿尔及利亚家庭早餐或早午餐的常见选择。",
          },
          {
            img: "./images/dz/f1.jpg",
            title: "香煎沙丁鱼",
            description:
              "阿尔及利亚香煎沙丁鱼是一道具有浓郁阿尔及利亚特色的海鲜菜品。它以新鲜的沙丁鱼为主要食材，经过独特的调味和煎制工艺制作而成。这道菜在阿尔及利亚的沿海地区尤为流行。",
          },
        ],
      },
    },
    cities: {
      title: {
        ar: "العاصمة و الوجهات السياحية",
        ch: "首都与旅游地",
      },
      content: {
        ar: [
          {
            img: "./images/dz/c1.jpg",
            title: "الجزائر",
            description:
              "الجزائر هي عاصمة الجزائر وأكبر مدينة فيها، وتقع على ساحل البحر الأبيض المتوسط. تتميز بتنوعها المعماري الغني، حيث تتجاور المباني القديمة ذات الطراز العربي الإسلامي مع ناطحات السحاب الحديثة. وتُعَدّ القصبة القديمة في الجزائر العاصمة أحد أبرز المعالم التاريخية، وقد تم إدراجها ضمن قائمة التراث الثقافي العالمي لليونسكو نظرًا لأهميتها الثقافية والتاريخية.",
          },
          {
            img: "./images/dz/c2.jpg",
            title: "وهران",
            description:
              "وهران هي ثاني أكبر مدينة في الجزائر، وتقع على ساحل البحر الأبيض المتوسط. تتميز المدينة بشواطئها الخلابة ومياهها الصافية، مما يجعلها وجهة مثالية للسياحة والاسترخاء. وتجمع المدينة بين العمارة العربية التقليدية والتأثيرات الأوروبية، مما يمنحها طابعًا ثقافيًا مميزًا.",
          },
          {
            img: "./images/dz/c3.jpg",
            title: "تلمسان",
            description:
              "تلمسان هي مدينة تاريخية وثقافية في الجزائر، تتمتع بإرث حضاري عريق. تضم المدينة العديد من المعالم التاريخية التي تعود إلى العصور الوسطى، مثل الأسوار القديمة والمساجد والقصور. وتتميز تلمسان بطراز معماري يجمع بين الأسلوب المغربي والأندلسي، ما يجعل التجول فيها أشبه برحلة عبر التاريخ.",
          },
        ],
        ch: [
          {
            img: "./images/dz/c1.jpg",
            title: "阿尔及尔",
            description:
              "阿尔及尔是阿尔及利亚的首都，也是该国最大的城市，位于地中海沿岸。这里建筑风格多样，既有阿拉伯-伊斯兰风格的古堡建筑，也有现代化的摩天大楼。阿尔及尔的卡斯巴哈老城区因其独特的文化与历史价值，被联合国教科文组织列为世界文化遗产。",
          },
          {
            img: "./images/dz/c2.jpg",
            title: "奥兰",
            description:
              "奥兰是阿尔及利亚第二大城市，位于地中海沿岸。这里拥有迷人的海滨风光，沙滩绵延，海水清澈，是旅游和度假的理想之地。城市的建筑风格融合了阿拉伯传统与欧洲文化，呈现出独特的文化魅力。",
          },
          {
            img: "./images/dz/c3.jpg",
            title: "特莱姆森",
            description:
              "特莱姆森是阿尔及利亚的一座历史文化名城，拥有悠久的文明遗产。这里保存着许多中世纪建筑，如古城墙、清真寺和宫殿，诉说着往昔的辉煌历史。城市的建筑风格融合了摩尔文化与安达卢西亚元素，漫步其中仿佛穿越时光，感受历史的厚重。",
          },
        ],
      },
    },
    economy: {
      title: {
        ar: "الموارد الطبيعية و مصادر الدخل",
        ch: "自然资源与收入来源",
      },
      content: {
        ar: [
          {
            icon: "./images/icons/oil-barrel.png",
            title: "النفط والغاز الطبيعي",
            text: "تتمتع الجزائر بموارد طبيعية غنية، حيث يُعد النفط والغاز الطبيعي الدعامة الأساسية لاقتصادها الوطني. تبلغ احتياطيات النفط المؤكدة حوالي 1.7 مليار طن، مما يجعلها تحتل المرتبة الخامسة عشرة عالميًا، في حين تبلغ احتياطيات الغاز الطبيعي 4.58 تريليون متر مكعب، لتحتل بذلك المرتبة العاشرة عالميًا. يساهم قطاع النفط والغاز بأكثر من 30% من الناتج المحلي الإجمالي، و60% من الإيرادات المالية للدولة، وأكثر من 90% من إجمالي الصادرات.",
          },
          {
            icon: "./images/gold.png",
            title: "الموارد المعدنية",
            text: "إلى جانب النفط والغاز، تمتلك الجزائر موارد معدنية أخرى مثل خام الحديد والرصاص والزنك والذهب والفوسفات. تقدر احتياطيات خام الحديد بحوالي 30 إلى 50 مليار طن، وتتركز بشكل رئيسي في المناطق الشرقية، بينما تبلغ احتياطيات الفوسفات 2 مليار طن، ويُستخدم على نطاق واسع في مجالي الزراعة والصناعات الكيميائية.",
          },
          {
            icon: "./images/planting.png",
            title: "الزراعة",
            text: "يحتل قطاع الزراعة أيضًا مكانة مهمة في الاقتصاد الجزائري، حيث تشمل المنتجات الزراعية الرئيسية القمح والشعير والعنب وزيت الزيتون والتمر. ويُصدّر جزء من هذه المنتجات إلى الأسواق الدولية، ويُعد زيت الزيتون والتمر من المصادر الرئيسية لجلب العملة الصعبة.",
          },
          {
            icon: "./images/travel-and-tourism.png",
            title: "السياحة",
            text: "كما يُعد القطاع السياحي محركًا هامًا لتنويع الاقتصاد، حيث تعتمد الجزائر على ما تزخر به من معالم ثقافية وطبيعية متنوعة لجذب السياح من داخل البلاد وخارجها، مما يعزز جهود الدولة لتنويع مصادر دخلها.",
          },
        ],
        ch: [
          {
            icon: "./images/icons/oil-barrel.png",
            title: "石油和天然气",
            text: "阿尔及利亚自然资源丰富，石油和天然气是其国民经济的支柱产业。石油探明储量约17亿吨，居世界第15位，天然气探明储量达4.58万亿立方米，居世界第10位，油气产业贡献了阿尔及利亚GDP的30%、财政收入的60%和出口总额的90%以上。",
          },
          {
            icon: "./images/gold.png",
            title: "矿产资源",
            text: "除油气外，阿尔及利亚还拥有铁矿、铅锌、磷酸盐、黄金等矿产资源，铁矿储量约30至50亿吨，主要分布在东部地区，磷酸盐储量达20亿吨，广泛用于农业和化工领域。",
          },
          {
            icon: "./images/planting.png",
            title: "农业部门",
            text: "农业在阿尔及利亚经济中也占据重要地位，主要农产品包括小麦、大麦、葡萄、橄榄油和椰枣，部分农产品出口至国际市场，尤其是橄榄油和椰枣已成为重要的创汇来源。",
          },
          {
            icon: "./images/travel-and-tourism.png",
            title: "旅游业",
            text: "旅游业依托于丰富的文化和自然景观，吸引着国内外游客，成为促进经济多样化的重要动力。",
          },
        ],
      },
    },
  },
  sd: {
    flag: "./images/waving-flags/sudan-flag-gif.gif",
    countryName: {
      ar: "السودان",
      ch: "苏丹",
    },
    geo: {
      map: "./images/maps/sd.svg",
      title: {
        ar: "الموقع الجغرافي",
        ch: "地理位置",
      },
      content: {
        ar: `تقع السودان في شمال شرق إفريقيا، وتبلغ مساحتها حوالي 1,886,068 كيلومتر مربع، مما يجعلها ثالث أكبر دولة في إفريقيا ، الخرطوم هي عاصمة السودان ، وتقع عند ملتقى النيل الأبيض والنيل الأزرق، وهي أكبر مدن البلاد ومركزها السياسي والاقتصادي والثقافي.تحدها مصر من الشمال، وإريتريا وإثيوبيا من الشرق، وجنوب السودان من الجنوب، وجمهورية إفريقيا الوسطى وتشاد وليبيا من الغرب، والبحر الأحمر من الشمال الشرقي، ويبلغ طول سواحلها حوالي 853 كيلومترًا.تتمتع البلاد بتضاريس متنوعة؛ حيث تقع الصحراء الكبرى في شمال السودان، بينما يتميز الوسط بسهول خصبة على طول نهر النيل، أما الجنوب فيتسم بالسافانا الاستوائية والغابات. يختلف المناخ من صحراوي في الشمال إلى استوائي في الجنوب. يوجد في السودان العديد من الأنهار، حيث يمر نهر النيل وروافده عبر البلاد بأكملها، مما يجعله مصدرًا حيويًا للمياه المستخدمة في الزراعة والاستخدام اليومي .`,
        ch: `苏丹位于非洲东北部，面积约为1,886,068平方公里，是非洲面积第三大的国家。喀土穆是苏丹的首都，位于白尼罗河和青尼罗河的交汇处，是该国最大的城市和政治、经济、文化中心。北部与埃及接壤，东部毗邻厄立特里亚和埃塞俄比亚，南部与南苏丹交界，西部与中非共和国、乍得和利比亚接壤，东北部濒临红海，海岸线长约853公里。全国地形多样，北部为撒哈拉沙漠的一部分，中部为尼罗河流域的肥沃平原，南部则是热带草原和森林。气候从北部的沙漠气候过渡到南部的热带气候。苏丹境内河流众多，尼罗河及其支流贯穿全境，是农业和生活用水的重要来源。`,
      },
      popover: {
        ar: [
          {
            name: "الصحراء الكبرى",
            info: "تقع في شمال أفريقيا، يحدها المحيط الأطلسي من الغرب، وجبال الأطلس والبحر الأبيض المتوسط ​​من الشمال، والبحر الأحمر من الشرق. تمتد عبر عدة دول بما في ذلك المغرب والجزائر وليبيا ومصر. يبلغ طولها من الشرق إلى الغرب حوالي 5600 كيلومتر، وعرضها من الشمال إلى الجنوب حوالي 1600 كيلومتر، وتغطي مساحة تزيد على 9 ملايين كيلومتر مربع، وهي أكبر صحراء في العالم.",
          },
          {
            name: "نهر النيل",
            info: "نهر النيل هو أطول نهر في العالم، حيث يبلغ طوله 6650 كيلومترًا. يقع في شمال شرق إفريقيا، وينبع من هضبة بوروندي في وسط إفريقيا، ويجري عبر عدة دول، منها مصر، السودان، وإثيوبيا، ليصب في النهاية في البحر الأبيض المتوسط",
          },
        ],
        ch: [
          {
            name: "撒哈拉沙漠",
            info: "位于非洲北部，西临大西洋，北接阿特拉斯山脉和地中海，东濒红海，跨越摩洛哥、阿尔及利亚、利比亚、埃及等多个国家。东西长度约为5600千米，南北宽度约1600千米，面积在900万平方千米以上，是世界上最大的沙漠",
          },
          {
            name: "尼罗河",
            info: "尼罗河是世界上最长的河流，全长6650千米，它位于非洲东北部，发源于非洲中部的布隆迪高原，流经多个国家，包括埃及、苏丹、埃塞俄比亚等，最终注入地中海。",
          },
        ],
      },
    },
    cities: {
      title: {
        ar: "العاصمة و الوجهات السياحية",
        ch: "首都与旅游地",
      },
      content: {
        ar: [
          {
            img: "./images/sd/c1.jpg", // You may want to replace with a Khartoum image
            title: "الخرطوم",
            description:
              "الخرطوم: عاصمة السودان، تقع عند التقاء النيل الأبيض والنيل الأزرق، وتتميز بمناظرها الفريدة. تضم المدينة مباني حديثة وشوارع ذات طابع تاريخي، ويمكن زيارة المتحف السودان القومي للتعرف على تاريخ وثقافة السودان.",
          },
          {
            img: "./images/sd/c2.jpg", // You may want to replace with a Nuba Mountains image
            title: "جبال النوبة",
            description:
              "جبال النوبة: تتميز بتضاريسها الجبلية الخلابة، وتحتوي على تنوع غني من النباتات والحيوانات، بالإضافة إلى ثقافة القبائل الفريدة. تضم المنطقة شلالات رائعة، وجداول مائية صافية، وغابات كثيفة، مما يجعلها وجهة مثالية لعشاق المشي لمسافات طويلة والمغامرات.",
          },
          {
            img: "./images/sd/c3.jpg", // You may want to replace with a Meroe Pyramids image
            title: "أهرامات مروي",
            description:
              "أهرامات مروي: تقع في شمال السودان، وهي من أبرز معالم الحضارة النوبية. تتميز هذه الأهرامات بتصاميمها الفريدة، ورغم أنها أصغر من الأهرامات المصرية، إلا أنها تقف شامخة في الصحراء منذ آلاف السنين، مما يضفي عليها طابعًا غامضًا وأثريًا رائعًا.",
          },
        ],
        ch: [
          {
            img: "./images/sd/c1.jpg", // You may want to replace with a Khartoum image
            title: "喀土穆",
            description:
              "喀土穆：苏丹首都，位于白尼罗河和蓝尼罗河的交汇处，城市风景独特。这里有现代化的建筑，也有充满历史韵味的街道，还可以参观国家博物馆，了解苏丹的历史和文化",
          },
          {
            img: "./images/sd/c1.jpg", // You may want to replace with a Nuba Mountains image
            title: "努巴山脉",
            description:
              "努巴山脉：这里山峦起伏，景色壮美，拥有丰富的动植物资源和独特的部落文化。山上有壮观的瀑布、清澈的溪流和茂密的森林，是徒步旅行和探险的好去处。",
          },
          {
            img: "./images/sd/c1.jpg", // You may want to replace with a Meroe Pyramids image
            title: "麦罗埃金字塔",
            description:
              "麦罗埃金字塔：位于苏丹北部，是努比亚文明的杰出代表。这些金字塔数量众多，虽比埃及金字塔小巧，但造型独特，在沙漠中矗立千年，充满古朴神秘气息。",
          },
        ],
      },
    },
    recipies: {
      title: {
        ar: "الأطباق المميزة",
        ch: "特色菜",
      },
      content: {
        ar: [
          {
            img: "./images/sd/f1.jpg",
            title: "القراصة",
            description:
              "القراصة هي طعام تقليدي يشبه الفطائر، وعادة ما يتم صنعها من دقيق القمح والماء، والتي يتم تخميرها ثم قليها. يمكن تناوله مع مجموعة متنوعة من الأطباق مثل اللحوم أو الخضروات أو الفاصوليا، وغالبًا ما يتم تناوله كوجبة إفطار أو كوجبة رئيسية.",
          },
          {
            img: "./images/sd/f2.jpg",
            title: "العصيدة",
            description:
              "العصيدة هي واحدة من الأطعمة الأساسية التقليدية في السودان، وعادة ما تكون عبارة عن عجينة مصنوعة من دقيق الدخن أو الذرة الممزوج بالماء. ويقدم عادة مع اللحوم أو الخضار أو الصلصات ويعتبر طبق شائع على موائد العائلة السودانية.",
          },
        ],
        ch: [
          {
            img: "./images/sd/f1.jpg",
            title: "卡拉萨",
            description:
              "卡拉萨是一种类似于薄饼的传统食物，通常由小麦粉和水制成，经过发酵后煎制而成。它可以搭配各种菜肴，如肉类、蔬菜或豆类，常作为早餐或主食食用。",
          },
          {
            img: "./images/sd/f2.jpg",
            title: "阿西达",
            description:
              "阿西达是苏丹传统的主食之一，通常由小米粉或玉米粉与水混合煮成的糊状食物。它通常搭配肉类、蔬菜或酱料一起食用，是苏丹家庭餐桌上常见的菜肴。",
          },
        ],
      },
    },
    economy: {
      title: {
        ar: "الموارد الطبيعية و مصادر الدخل",
        ch: "自然资源与收入来源",
      },
      content: {
        ar: [
          {
            icon: "./images/gold.png",
            title: "الموارد المعدنية",
            text: "تتمتع السودان بعدة معادن مثل الذهب والفضة والحديد والكروم والنحاس والمنغنيز والرصاص والزنك.",
          },
          {
            icon: "./images/planting.png",
            title: "الزراعة",
            text: "يشكل العاملون في الزراعة نحو 70% من إجمالي السكان، وتُعدّ المحاصيل الرئيسية في البلاد القطن والفول السوداني والسمسم والصمغ العربي، كما يعدّ أكبر منتج للفول السوداني في العالم العربي، ويتصدر إنتاج وتصدير السمسم على مستوى الدول العربية والإفريقية.",
          },
          // {
          //   title: "الثروة الحيوانية",
          //   text: "يتجاوز عدد رؤوس الماشية فيه 100 مليون رأس، بينما يبلغ عدد الدواجن قرابة 50 مليونًا.",
          // },
          {
            icon: "./images/fishermen.png",
            title: "الموارد المائية",
            text: "يعتمد السودان بشكل رئيسي على نهر النيل وروافده، لا سيما النيل الأزرق والنيل الأبيض، حيث يمتد النهر لمسافة 3300 كيلومتر داخل السودان، مما يجعله مصدرًا أساسيًا للري والزراعة، بالإضافة إلى كونه شريانًا مهمًا للنقل داخل البلاد.",
          },
        ],
        ch: [
          {
            icon: "./images/gold.png",
            title: "矿产资源",
            text: "苏丹蕴藏金、银、铁、铬、铜、锰、铅、锌等多种矿产。",
          },
          {
            icon: "./images/planting.png",
            title: "农业部门",
            text: "农业人口占全国总人口的70%，主要农作物包括棉花、花生、芝麻和阿拉伯胶，花生产量位列阿拉伯国家第一，芝麻的产量和出口量在阿拉伯及非洲国家中居首。",
          },
          // {
          //   title: "畜牧业",
          //   text: "牲畜存栏量超过1亿头/只，家禽数量近5000万只。",
          // },
          {
            icon: "./images/fishermen.png",
            title: "水资源",
            text: "苏丹主要依赖尼罗河及其支流青尼罗河和白尼罗河，尼罗河在苏丹境内长约3300公里，不仅为农业提供充足水源，也是国家重要的运输动脉。",
          },
        ],
      },
    },
  },
  dj: {
    flag: "./images/waving-flags/djibouti-flag.gif",
    countryName: {
      ar: "جيبوتي",
      ch: "吉布提",
    },
    geo: {
      map: "./images/maps/dj.svg",
      title: {
        ar: "الموقع الجغرافي",
        ch: "地理位置",
      },
      content: {
        ar: "تقع جيبوتي على الساحل الغربي لخليج عدن في شمال شرق أفريقيا، وتبلغ مساحتها 23 ألف كيلومتر مربع. وهي واحدة من اصغر الدول في أفريقيا ، وتتحكم في مضيق باب المندب، حيث انها نقطة استراتيجية يلتقي فيها البحر الأحمر بالمحيط الهندي. بفضل موقعها الجغرافي المتميز ومينائها الطبيعي العميق، أصبحت جيبوتي ذات أهمية متزايدة كمركز إقليمي للتجارة والعبور في منطقة القرن الأفريقي. يحدها الصومال من الجنوب الشرقي، وإريتريا من الشمال، وإثيوبيا من الغرب والجنوب الغربي والجنوب. يبلغ طول الساحل 372 كيلومترًا. تتكون المناطق الساحلية من السهول والهضاب، مع مناخ صحراوي استوائي في الغالب، وهو حار وقليل الأمطار على مدار السنة. وفي الوسط تقع بحيرة عسل، إحدى أخفض النقاط في أفريقيا، حيث تقع على عمق حوالي 155 متراً تحت مستوى سطح البحر، وتتميز مياه البحيرة بملوحة عالية للغاية. تتكون المنطقة الداخلية بشكل أساسي من الهضاب والجبال، مع مناخ السافانا الاستوائي.",
        ch: "吉布提位于非洲东北部亚丁湾西岸，面积2.3万平方公里，是非洲面积较小的国家之一，扼红海进入印度洋的要冲曼德海峡，由于地理位置优越，又有天然深水港，吉布提作为'非洲之角'的区域贸易和转运枢纽的地位日益重要。东南同索马里接壤，北与厄立特里亚为邻，西部、西南及南部与埃塞俄比亚毗连。海岸线长372公里。沿海为平原和高原，主要属热带沙漠气候，终年炎热少雨。中部有阿萨尔湖，是非洲海拔最低点之一，低于海平面约155米，湖水盐度极高。内地以高原和山地为主，属热带草原气候",
      },
      popover: {
        ar: [
          {
            name: "بحيرة عسل",
            info: "تقع بحيرة عسل في منطقة دخيل شمال غرب مدينة جيبوتي. وهي احد المعالم السياحية المشهورة عالميًا في مدينة جيبوتي. وتبلغ مساحتها أكثر من 10 كيلومتر مربع. يبلغ مستوى سطح البحيرة 150 متراً تحت مستوى سطح البحر، مما يجعلها أدنى نقطة في قارة افريقيا،وتعد ايضاً أكثر مسطح مائي مالح في العالم، حيث تصل نسبة تركيز الملح فيها إلى 34.8%، وهو أعلى من البحر الميت وأكثر من 10 أضعاف تركيز الملح في محيطات العالم.",
          },
        ],
        ch: [
          {
            name: "阿萨尔湖",
            info: "阿萨尔湖位于吉布提市西北面迪基尔地区，是吉布提市举世闻名的景点，方圆10多平方公里，湖面低于海平面150米，是非洲大陆的最低点,也是世界上最咸的水体，含盐浓度是34.8%，比死海还高，是世界海洋盐浓度的10倍多。",
          },
        ],
      },
    },
    cities: {
      title: {
        ar: "العاصمة و الوجهات السياحية",
        ch: "首都与旅游地",
      },
      content: {
        ar: [
          {
            img: "./images/dj/c1.jpg",
            title: "مدينة جيبوتي",
            description:
              "مدينة جيبوتي هي عاصمة جيبوتي، وتقع على الساحل الغربي لخليج عدن، على مضيق باب المندب الاستراتيجي. إنها ليست فقط المركز السياسي والاقتصادي والثقافي للبلاد، بل هي أيضًا مدينة ساحلية مهمة ومركز تجاري إقليمي.",
          },
          {
            img: "./images/dj/c2.jpg",
            title: "بحيرة عسل",
            description:
              "بحيرة عسل هي بحيرة بركانية تقع في منطقة دخيل شمال غرب مدينة جيبوتي. وتُعد من أشهر المعالم السياحية في جيبوتي، وتبلغ مساحتها أكثر من 10 كيلومترات مربعة. ويقع سطح البحيرة على عمق 150 متراً تحت مستوى سطح البحر، مما يجعلها أدنى نقطة في قارة أفريقيا.",
          },
          {
            img: "./images/dj/c3.jpg",
            title: "تاجورا",
            description:
              "تقع تاجورا في الطرف الغربي لخليج عدن، وتشتهر بخليجها الساحر، وشواطئها الهادئة، وغاباتها الجبلية، وتضاريسها البركانية. وتُبرز مبانيها البيضاء ومساجدها الطابع الإسلامي المميز، ولانها واحدة من اقدم مدن جيبوتي  فهي تبرز الآثار التاريخية التي تعكس تلاقي حضارات متعددة.",
          },
        ],
        ch: [
          {
            img: "./images/dj/c1.jpg",
            title: "吉布提市",
            description:
              "吉布提市是吉布提的首都，位于亚丁湾西岸，地处战略要地曼德海峡。它不仅是全国的政治、经济和文化中心，还是一个重要的港口城市和区域贸易枢纽。",
          },
          {
            img: "./images/dj/c2.jpg",
            title: "阿萨尔湖",
            description:
              "阿萨尔湖是在吉布提发现的一个火山湖。阿萨尔湖位于吉布提市西北面迪基尔地区。也是吉布提市举世闻名的景点,方圆10多平方公里,湖面低于海平面 150米,是非洲大陆的最低点。",
          },
          {
            img: "./images/dj/c3.jpg",
            title: "塔朱拉",
            description:
              "塔朱拉位于亚丁湾西端，以迷人海湾、宁静海滩、峡谷森林和火山地貌闻名。白色建筑与清真寺展现独特伊斯兰风貌，作为吉布提最古老城镇之一，历史遗迹丰富，体现多种文明交融。",
          },
        ],
      },
    },
    recipies: {
      title: {
        ar: "الأطباق المميزة",
        ch: "特色菜",
      },
      content: {
        ar: [
          {
            img: "./images/dj/f1.jpg",
            title: "حساء فاه فه",
            description:
              "فاه فاه هو حساء جيبوتي يؤكل عادة كمقبلات أو وجبة خفيفة. وهو عبارة عن خليط حار من السمك أو لحم الماعز مخلوط مع الخضار مثل الطماطم والبصل والفلفل الأخضر. إضافة الفلفل الحار والتوابل المحلية المتنوعة يمنحها نكهة فريدة تجعلك تشعر بالدفء.",
          },
          {
            img: "./images/dj/f2.jpg",
            title: "الكباب",
            description:
              "يعكس كباب جيبوتي التأثيرات الثقافية المتبادلة للبلاد، مع مزيج من نكهات الشرق الاوسط  وافريقيا على الأسياخ. يتم تتبيل قطع اللحم عادةً لحم الضأن أو الدجاج أو اللحم البقري - بمجموعة من التوابل بما في ذلك الكمون والكزبرة والكركم، ثم يتم شويها على نار مفتوحة حتى تصبح مدخنة بشكل مثالي.",
          },
          {
            img: "./images/dj/f3.jpg",
            title: "يخنة لحم الضأن التقليدية الجيبوتية",
            description:
              "يخنة لحم الضأن التقليدية هو عبارة عن حساء لحم ضأن تقليدي ويعتبر الطبق الوطني لجيبوتي. إنها تحفة فنية مطهوة ببطء، وعادة ما يتم تحضيرها باستخدام شرائح لحم الضأن الطرية والأرز ومزيج من التوابل العطرية مثل الهيل والكمون والقرنفل. يتم تقديم هذا الطبق عادة في المناسبات الخاصة ويعتبر مرادفًا للضيافة الجيبوتية.",
          },
        ],
        ch: [
          {
            img: "./images/dj/f1.jpg",
            title: "发发汤",
            description:
              "发发汤是一种吉布提汤，通常作为开胃菜或便餐食用。这是一种辛辣的混合物，由鱼或山羊肉以及西红柿、洋葱和青椒等蔬菜混合制成。辣椒和各种当地香料的添加赋予其独特的风味， 让你感到温暖。",
          },
          {
            img: "./images/dj/f2.jpg",
            title: "肉串",
            description:
              "吉布提的烤肉串反映了该国的跨文化影响，中东和非洲风味混合在串上。腌制的肉块——通常是羊肉、鸡肉或牛肉——用孜然、香菜和姜黄等一系列香料调味，然后在明火上烤至完美的烟熏味。",
          },
          {
            img: "./images/dj/f3.jpg",
            title: "吉布提传统炖羊肉",
            description:
              "是一种传统的炖羊肉，被认为是吉布提的国菜。这是一道慢煮杰作，通常由嫩羊肉片、大米和小豆蔻、小茴香和丁香等芳香香料混合而成。这道菜经常在特殊场合享用，是吉布提热情好客的代名词。",
          },
        ],
      },
    },
    economy: {
      title: {
        ar: "الموارد الطبيعية و مصادر الدخل",
        ch: "自然资源与收入来源",
      },
      content: {
        ar: [
          {
            icon: "./images/icons/port.png",
            title: "النقل والخدمات اللوجستية",
            text: "تعتمد جيبوتي على موقعها الجغرافي الجيد، حيث تتمتع بمرافق موانئ متطورة، وهو ما يسهم في دفع نمو قطاعي الخدمات اللوجستية والنقل. كما أن جيبوتي قامت ببناء خطوط للسكك الحديدية والطرق لربط البلاد بالدول المجاورة، ويشهد قطاع البنية التحتية تطورًا مستمرًا، مما يسرّع من تطور صناعة اللوجستيات والنقل في البلاد. يعتمد اقتصاد جيبوتي على خدمات الموانئ باعتبارها الصناعة الأساسية، حيث تمثل الخدمات أكثر من 70% من الناتج المحلي الإجمالي. ويُعد ميناء جيبوتي المنفذ البحري الرئيسي لإثيوبيا، كما أنه يشكل محورًا مهمًا يربط آسيا وأفريقيا وأوروبا. وتعتمد جيبوتي بشكل كبير على قطاعي اللوجستيات والنقل.",
          },
          {
            icon: "./images/travel-and-tourism.png",
            title: "السياحة",
            text: "تُعد السياحة واحدة من القطاعات الاقتصادية التي شهدت تطورًا سريعًا في جيبوتي خلال السنوات الأخيرة. وتشمل أبرز المعالم السياحية في جيبوتي: بحيرة عسل (أدنى نقطة في قارة أفريقيا)، بحيرة آبي، بركان أردوبا، غابة دايي البدائية، شلالات روندا-هينبونغوالي، وحديقة تاجورا المائية البحرية. وتتميز هذه المعالم الطبيعية بتضاريس بركانية، ومناظر بحيرات ملحية، وبيئة إيكولوجية فريدة، مما يمنحها قيمة سياحية ومشاهدية عالية جدًا.",
          },
          {
            icon: "./images/gold.png",
            title: "الموارد الطبيعية",
            text: "تتمتع جيبوتي بموارد غنية من مناجم الملح. بحيرة عسل هي عبارة عن حوض ملح طبيعي كبير يحتوي على ملح البوتاسيوم الغني والبروم. تبلغ نسبة الملح في كل لتر من الماء 330 جرامًا، وهي نسبة نادرة من الملح في العالم. يعد الملح أحد أهم الموارد الطبيعية في جيبوتي وأحد صادراتها الرئيسية. وتوجد أيضًا مساحات كبيرة من حقول الملح على طول الساحل.",
          },
        ],
        ch: [
          {
            icon: "./images/icons/port.png",
            title: "物流与运输业",
            text: "吉布提依靠比较好地理位置，这里港口设施比较好，这也是带动吉布提物流河运输业发展。吉布提也修建铁路和公路连接国内和周边国家，这些基础设施建设不断发展，也是加快对吉布提物流和运输业发展。吉布提经济以港口服务为支柱产业，服务业占国内生产总值的70%以上。吉布提港是埃塞俄比亚的主要出海口，也是连接亚洲、非洲与欧洲的重要枢纽。吉布提依靠物流和运输业。",
          },
          {
            icon: "./images/travel-and-tourism.png",
            title: "旅游业",
            text: "旅游业是吉布提近年来快速发展的经济板块之一。吉布提的主要旅游包括阿萨尔湖（非洲大陆最低点）、阿贝湖、阿尔都巴火山、达依原始森林、朗达兴奔古瓦莱瀑布和塔朱腊海水乐园等自然奇观。这些景点多呈现出火山地貌、盐湖景观和独特的生态环境，具有极高的旅游观赏价值",
          },
          {
            icon: "./images/gold.png",
            title: "自然资源",
            text: "吉布提有丰富的盐矿资源，阿萨尔湖是一个天然大盐田，含有丰富的钾盐、溴。每升水含盐达330克，其盐量之丰富，是世界上罕见的。盐是吉布提最主要的天然资源之一，也是主要的出口物资之一，附近沿海也有大面积的盐田。",
          },
        ],
      },
    },
  },
  qa: {
    flag: "./images/waving-flags/qatar-flag.gif",
    countryName: {
      ar: "قطر",
      ch: "卡塔尔",
    },
    geo: {
      map: "./images/maps/qa.svg",
      title: {
        ar: "الموقع الجغرافي",
        ch: "地理位置",
      },
      content: {
        ch: `卡塔尔位于阿拉伯湾西南海岸，是阿拉伯半岛上的国家。国土面积为11,521平方公里。东、北、西三面濒临波斯湾，海岸线总长约563公里，南部与沙特阿拉伯接壤。地势总体平坦，西部略高，最高海拔仅103米，境内多为沙漠和岩石戈壁，也没有常年性河流，水资源主要依赖地下水和海水淡化设施。卡塔尔属于热带沙漠气候，其战略的地理位置使其在海上交通和贸易中具有重要地位。`,
        ar: `تقع قطر على الساحل الجنوبي الغربي للخليج العربي، وهي دولة تقع في شبه الجزيرة العربية. تبلغ مساحتها 11,521 كيلومترًا مربعًا. يحدها الخليج العربي من الشرق والشمال والغرب، ويبلغ طول ساحلها نحو 563 كيلومترًا، بينما تحدها المملكة العربية السعودية من الجنوب. تتميز أرضها بشكل عام بأنها مسطحة، مع ارتفاع طفيف في الغرب حيث يبلغ أعلى ارتفاع فيها 103 أمتار فقط. يغلب على أراضيها الطابع الصحراوي والصخور الجرداء، ولا توجد فيها أنهار دائمة، وتعتمد في مواردها المائية على المياه الجوفية ومحطات تحلية مياه البحر. تتمتع قطر بمناخ صحراوي استوائي، ويمنحها موقعها الجغرافي الاستراتيجي أهمية كبرى في مجالات الملاحة والتجارة البحرية.`,
      },
      popover: {
        ar: [],
        ch: [],
      },
    },
    economy: {
      title: {
        ar: `الموارد الطبيعية و مصادر الدخل `,
        ch: `自然资源与收入来源`,
      },
      content: {
        ch: [
          {
            icon: "./images/gold.png",
            title: "自然资源 1",
            text: "卡塔尔自然资源品种较为单一，以石油和天然气以及相关伴生资源为主。油气资源丰富，卡塔尔天然气储量全球第三位，主要集中在卡塔尔的北部气田，该气田是全球最大的单一气田，其面积相当于卡塔尔国土面积一半，已探明储量超过900万亿立方英尺（约25.49万亿立方米），约占全球份额20%",
          },
          {
            icon: "./images/fishermen.png",
            title: "自然资源 2",
            text: "卡塔尔原油储量列全球第十四位，探明储量约252亿桶，约占全球份额1.5%。卡塔尔氦储量为101亿立方米，排全球第二，占全球储量的19.4%。卡塔尔是世界上最大的氦出口国和第二大生产国。",
          },
          {
            icon: "./images/planting.png",
            title: "2022年世界杯与旅游业",
            text: "卡塔尔旅游业近年来发展迅速,尤其在成功举办 2022年世界杯后,其国际知名度和吸引力显著提升。世界杯期间，大量游客涌入卡塔尔，直接带动了当地的旅游、酒店、餐饮、零售等行业的消费。据统计，世界杯进行期间的11月至12月，有118万名国际游客奔赴卡塔尔。",
          },
        ],
        ar: [
          {
            icon: "./images/gold.png",
            title: "الموارد الطبيعية 1",
            text: "الموارد الطبيعية في قطر متنوعة بشكل محدود، وتتمثل بشكل رئيسي في النفط والغاز الطبيعي والموارد المصاحبة لهما. تتمتع قطر بثروة وفيرة من النفط والغاز، حيث تحتل المرتبة الثالثة عالميًا في احتياطي الغاز الطبيعي، ويتركز معظمه في الحقل الشمالي الواقع في شمال قطر، والذي يُعد أكبر حقل غاز منفرد في العالم، وتبلغ مساحته ما يعادل نصف مساحة دولة قطر. وقد تم تقدير الاحتياطي المؤكد فيه بأكثر من 900 تريليون قدم مكعب (أي حوالي 25.49 تريليون متر مكعب)، وهو ما يمثل نحو 20% من الاحتياطي العالمي.",
          },
          {
            icon: "./images/fishermen.png",
            title: "الموارد الطبيعية 2",
            text: "تحتل قطر المرتبة الرابعة عشرة عالميًا في احتياطي النفط الخام، حيث يبلغ احتياطيها المؤكد حوالي 25.2 مليار برميل، وهو ما يمثل نحو 1.5% من إجمالي الاحتياطي العالمي. أما بالنسبة لاحتياطي الهيليوم، فيبلغ 10.1 مليار متر مكعب، مما يجعلها تحتل المرتبة الثانية عالميًا، بما يعادل 19.4% من إجمالي الاحتياطي العالمي. كما تُعد قطر أكبر مُصدّر للهيليوم في العالم، وثاني أكبر منتج له.",
          },
          {
            icon: "./images/planting.png",
            title: "كأس العالم و السياحة",
            text: "شهد قطاع السياحة في قطر تطورًا سريعًا في السنوات الأخيرة، خاصة بعد النجاح الكبير في استضافة كأس العالم 2022، مما زاد من شهرتها وجاذبيتها على الصعيد الدولي. وخلال فترة المونديال، تدفق عدد كبير من السياح إلى قطر، مما ساهم بشكل مباشر في تنشيط قطاعات السياحة والفنادق والمطاعم وتجارة التجزئة. وتشير الإحصائيات إلى أن ما يقارب 1.18 مليون سائح دولي زاروا قطر خلال شهري نوفمبر وديسمبر من فترة إقامة البطولة.",
          },
        ],
      },
    },
    cities: {
      title: {
        ar: "العاصمة و الوجهات السياحية",
        ch: "首都与旅游地",
      },
      content: {
        ch: [
          {
            img: "./images/qa/Doha.jpeg",
            title: "多哈",
            description:
              "多哈是卡塔尔的首都，也是政治、经济、文化和交通中心，同时是全国人口最密集的地区和最大城市。多哈拥有现代化的城市风貌，高楼大厦林立，同时也保留着许多传统的阿拉伯建筑和文化元素，作为波斯湾著名的港口城市，展现出新旧融合的独特魅力。",
          },
          {
            img: "./images/qa/lusail.jpeg",
            title: "卢赛尔",
            description:
              "卢赛尔是一座现代化且发展先进的城市，拥有高速光纤网络，构建起智能高效的数字生活。卢赛尔体育场是2022年世界杯的标志性场馆，设计灵感源自阿拉伯椰枣碗，被印在卡塔尔10里亚尔纸币上。",
          },
          {
            img: "./images/qa/Pearl-Qatar-Island.jpeg",
            title: "卡塔尔之珠",
            description:
              "一座人工岛屿，拥有采用地中海沿岸风格的游艇码头、高层住宅、别墅和酒店，还有众多高级设计师精品店和奢侈品购物场所，以及各种现代餐饮场所。",
          },
        ],
        ar: [
          {
            img: "./images/qa/Doha.jpeg",
            title: "الدوحة",
            description:
              "الدوحة هي عاصمة قطر، وتُعد مركزًا سياسيًا واقتصاديًا وثقافيًا وحيويًا للنقل في البلاد، كما أنها أكبر مدينة وأكثرها اكتظاظًا بالسكان. تجمع الدوحة بين الطابع العصري حيث تنتشر ناطحات السحاب، وبين الطابع التقليدي من خلال حفاظها على الكثير من العمارة والثقافة العربية الأصيلة، ما يجعلها واحدة من أبرز المدن الساحلية في الخليج العربي بطابعها المميز الذي يمزج بين الحداثة و التقاليد .",
          },
          {
            img: "./images/qa/lusail.jpeg",
            title: "لوسيل",
            description:
              "لوسيل هي مدينة حديثة ومتطورة، تمتلك شبكة ألياف ضوئية عالية السرعة، مما أسس لحياة رقمية ذكية وفعالة. استاد لوسيل هو أحد المعالم البارزة في كأس العالم 2022، وقد استُوحي تصميمه من وعاء التمر العربي، وتم طباعته على ورقة نقدية فئة 10 ريالات قطرية.",
          },
          {
            img: "./images/qa/Pearl-Qatar-Island.jpeg",
            title: "لؤلؤة قطر",
            description:
              " جزيرة صناعية تضم مرسى لليخوت على طراز شواطئ البحر المتوسط، بالإضافة إلى مبانٍ سكنية شاهقة، وفيلات وفنادق راقية، كما تحتوي على العديد من متاجر المصممين العالميين، ومحال العلامات التجارية الفاخرة، ومجموعة متنوعة من المطاعم العصرية.",
          },
        ],
      },
    },
    recipies: {
      title: {
        ar: "الاطباق المميزة",
        ch: "特色菜",
      },
      content: {
        ch: [
          {
            img: "./images/qa/Qatari-Harees.jpeg",
            title: "卡塔尔哈里斯粥",
            description:
              "哈里斯粥是一道传统的卡塔尔美食，由碾碎的小麦与鸡肉或羊肉慢炖而成，口感细腻浓郁，常在斋月或节日期间享用。",
          },
          {
            img: "./images/qa/Majboos.jpeg",
            title: "马什布斯",
            description:
              "马什布斯是卡塔尔的传统主食，用米饭加上丁香、豆蔻、肉桂等香料与鸡肉或羊肉炖煮而成，香气扑鼻，是节日必备的美食之一。",
          },
          {
            img: "./images/qa/Thareed.jpeg",
            title: "塔里德",
            description:
              "塔里德是一种用薄饼铺底，搭配炖煮的肉类、蔬菜和浓郁的汤汁层层叠加而成的传统佳肴，兼具口感和风味，常在家庭聚会和节庆中出现。",
          },
        ],
        ar: [
          {
            img: "./images/qa/Qatari-Harees.jpeg",
            title: "عصيدة الهريس القطرية",
            description:
              "الهريس هو طبق تقليدي قطري يُحضّر من القمح المجروش المطهو ببطء مع الدجاج أو لحم الضأن. يتميز بقوامه الناعم ومذاقه الغني، وغالبًا ما يُقدَّم خلال شهر رمضان أو في المناسبات والأعياد.",
          },
          {
            img: "./images/qa/Majboos.jpeg",
            title: "المجبوس",
            description:
              "المجبوس هو طبق رئيسي تقليدي في قطر، يُطهى من الأرز مع التوابل مثل القرنفل، الهيل، والقرفة، ويُضاف إليه الدجاج أو لحم الضأن. يتميز برائحته الزكية، ويُعد من الأطباق الأساسية في الأعياد.",
          },
          {
            img: "./images/qa/Thareed.jpeg",
            title: "الثريد",
            description:
              "الثريد هو طبق قطري تقليدي يتكون من طبقات من الخبز الرقيق في القاع، تُسكب فوقه طبقات من اللحم والخضروات والمرق الغني. يجمع بين المذاق الرائع والقوام المتعدد، ويُقدَّم كثيرًا في التجمعات العائلية والمناسبات.",
          },
        ],
      },
    },
  },
  km: {
    flag: "./images/waving-flags/comoros-flag-gif.gif",
    countryName: {
      ar: "جزر القمر",
      ch: "科摩罗",
    },
    geo: {
      map: "./images/maps/km.svg",
      title: {
        ar: "الموقع الجغرافي",
        ch: "地理位置",
      },
      content: {
        ar: `تقع جزر القمر في غرب المحيط الهندي، وتبلغ مساحتها حوالي 2236 كيلومترًا مربعًا. تقع عند المدخل الشمالي لمضيق موزمبيق، وتبعد قرابة 300 كيلومتر عن كلٍّ من مدغشقر شرقًا وموزمبيق غربًا. تتكوّن الدولة من أربع جزر رئيسية: القمر الكبرى، أنجوان، موهيلي، ومايوت. وتتميز تضاريس البلاد بالطبيعة البركانية الخلابة، حيث تُعد قمة "بركان كارتالا" في جزيرة القمر الكبرى أعلى نقطة في البلاد بارتفاع يصل إلى 2361 مترًا، وهو من البراكين النشطة.`,
        ch: `科摩罗位于印度洋西部，面积 2236 平方公里，地处莫桑比克海峡北端入口处，东、西分别与马达加斯加和莫桑比克相距约300公里。由大科摩罗、昂儒昂、莫埃利及马约特四个主要岛屿组成。 该国地形以火山为主，风景壮丽。大科摩罗岛上的卡塔拉火山是全国最高峰，海拔2361米，属于活火山。`,
      },
      popover: {
        ar: [],
        ch: [],
      },
    },
    economy: {
      title: {
        ar: `الموارد الطبيعية و مصادر الدخل`,
        ch: `自然资源与收入来源`,
      },
      content: {
        ar: [
          {
            icon: "./images/gold.png",
            title: "الثروة السمكية",
            text: "تُعد الثروة السمكية من أبرز الموارد الطبيعية المتوفرة في جزر القمر، حيث تتمتع البلاد بمياه بحرية واسعة وغنية بأنواع عديدة من الأسماك مثل التونة، والسمك الأحمر، والسمك الأزرق. وتوفر النظم البيئية البحرية المتنوعة، كالشعاب المرجانية والبحيرات الساحلية، بيئة مثالية لتكاثر الأسماك وازدهارها.",
          },
          {
            icon: "./images/fishermen.png",
            title: "النباتات العطرية",
            text: "تمتلك جزر القمر أيضًا ثروة غنية من النباتات العطرية، مثل الفانيليا والقرنفل والإيلنغ. وتُعد هذه النباتات العطرية من المحاصيل الاقتصادية الهامة، كما تُشكّل جزءًا مميزًا من المنظومة البيئية المحلية. وبفضل المناخ الملائم والتربة الخصبة، تتميز التوابل المزروعة في جزر القمر بجودة عالية، وتحظى بسمعة طيبة في الأسواق الدولية.",
          },
          {
            icon: "./images/planting.png",
            title: "الزراعة والسياحة",
            text: "تلعب الزراعة دورا رئيسيا في اقتصاد جزر القمر وتعد أحد المصادر الرئيسية للدخل. تُعرف البلاد باسم 'جزيرة التوابل' وتحتل مرتبة متقدمة بين دول العالم في إنتاج التوابل مثل الفانيليا والقرنفل واليلنغ يلانغ. يتم تصدير هذه التوابل بكميات كبيرة إلى دول مثل فرنسا والهند وألمانيا وباكستان وغيرها، مما يدر قدرًا كبيرًا من النقد الأجنبي على البلاد. كما تمتلك جزر القمر مقومات سياحية غنية، من شواطئ جميلة وطبيعة ساحرة إلى ثقافة إسلامية فريدة، مما جعلها وجهة مفضلة لعدد متزايد من السياح، خاصة مع تطور السياحة عالميًا.",
          },
        ],
        ch: [
          {
            icon: "./images/gold.png",
            title: "渔业",
            text: "渔业资源是科摩罗相对丰富的自然资源之一。其周边海域广阔，拥有丰富的金枪鱼、红鱼和青鱼等渔业资源。 多样的海洋生态环境，如珊瑚礁、泻湖等，为鱼类提供了良好的栖息和繁殖场所。",
          },
          {
            icon: "./images/fishermen.png",
            title: "香料植物",
            text: "科摩罗还拥有丰富的香料植物资源，如香草、丁香、依兰等。这些香料植物不仅是重要的经济作物，也构成了当地独特的生态景观元素。凭借适宜的气候和土壤条件，科摩罗种植的香料品质优良，在国际市场上具有一定的知名度。",
          },
          {
            icon: "./images/planting.png",
            title: "农业与旅游业",
            text: "农业在科摩罗经济中占据主导地位，是主要的收入来源之一。该国以‘香料岛’闻名于世，香草、丁香、依兰等香料产量位居世界前列。这些香料大量出口到法国、印度、德国、巴基斯坦等国家，为国家赚取了可观的外汇。科摩罗拥有丰富的旅游资源，迷人的海岛风光与独特的伊斯兰文化吸引着越来越多的游客。随着全球旅游市场的不断发展，来科摩罗旅游的游客数量逐渐增加。",
          },
        ],
      },
    },
    cities: {
      title: {
        ar: "العاصمة و الوجهات السياحية",
        ch: "首都与旅游地",
      },
      content: {
        ar: [
          {
            img: "./images/km/c1.jpg",
            title: "موروني",
            description:
              "موروني هي المركز السياسي والاقتصادي والثقافي لجزر القمر. يتميز الطراز المعماري للمدينة بأنه فريد من نوعه، إذ يجمع بين العناصر العربية والإفريقية.",
          },
          {
            img: "./images/km/c2.jpg",
            title: "محمية جزيرة موهيلي الطبيعية",
            description:
              "تحتفظ جزيرة موهيلي بطبيعتها البكر، حيث تنتشر في محميتها الطبيعية غابات كثيفة تُشكّل موطنًا للعديد من النباتات والحيوانات النادرة. ويمكن للزوار التجوّل في الغابات المطيرة ومشاهدة الكائنات الفريدة التي تتميز بها جزر القمر.",
          },
          {
            img: "./images/km/c3.jpg",
            title: "ميناء موتسامودو",
            description:
              "يقع ميناء موتسامودو في جزيرة أنجوان، وهو ليس فقط مركزًا مهمًا للنقل والمواصلات، بل أيضًا وجهة سياحية مفضّلة لدى الزوار. يتمتع هذا الميناء الساحلي بجو تاريخي مميز، حيث تُجسّد مبانيه القديمة عبق الماضي وتغيرات الزمن. ويمكن للسياح هناك خوض تجربة الصيد التقليدي، وركوب قوارب الصيد في عرض البحر للاستمتاع بجمال المناظر الطبيعية الخلابة للجزر والساحل.",
          },
        ],
        ch: [
          {
            img: "./images/km/c1.jpg",
            title: "莫罗尼",
            description:
              "莫罗尼是科摩罗的政治、经济和文化中心。城市建筑风格独特，融合了阿拉伯和非洲元素。",
          },
          {
            img: "./images/km/c2.jpg",
            title: "莫埃利岛自然保护区",
            description:
              "莫埃利岛保留了原始的自然风貌，岛上的自然保护区内生长着茂密的森林，是众多珍稀动植物的家园。游客可以漫步在雨林中，观赏到科摩罗特有的动植物。",
          },
          {
            img: "./images/km/c3.jpg",
            title: "穆察穆都港",
            description:
              "昂儒昂岛的穆察穆都港不仅是重要的交通枢纽，也是备受游客喜爱的旅游景点。港口城市充满历史韵味，古老的建筑见证了岁月的变迁，游客在此还能体验传统的渔业活动，乘坐渔船出海，欣赏美丽迷人的海岛海景。",
          },
        ],
      },
    },
    recipies: {
      title: {
        ar: "الاطباق المميزة",
        ch: "特色菜",
      },
      content: {
        ar: [
          {
            img: "./images/tajin.jpg",
            title: "الماتابا (Mataba)",
            description:
              "الماتابا هو طبق تقليدي كلاسيكي يُحضّر باستخدام أوراق الكسافا الطازجة وحليب جوز الهند المطهو على نار هادئة. يتميز بقوامه الناعم ومذاقه الغني، ويُعتبر من الأطباق التقليدية الشائعة في المنازل.",
          },
          {
            img: "./images/km/f1.jpg",
            title: "البيلاو (Pilao)",
            description:
              "البيلاو هو طبق رئيسي يتكوّن من الأرز المطهو مع اللحم (عادةً لحم البقر أو الدجاج) والتوابل مثل القرفة، القرنفل، والهيل. يتمتع برائحة قوية ونكهة مميزة، ويُعد من الأطباق الأساسية في الأعياد والتجمعات العائلية.",
          },
          {
            img: "./images/tajin.jpg",
            title: "البوسا (Poussa)",
            description:
              "البوسا هو طبق ذو طابع استوائي، يتكوّن من الموز الناضج المطهو مع السمك والتوابل. يجمع بين النكهتين الحلوة والمالحة، ويُعد من الأطعمة الشائعة في المناطق الساحلية.",
          },
        ],
        ch: [
          {
            img: "./images/tajin.jpg",
            title: "马图拉",
            description:
              "马图拉是经典菜肴使用新鲜的木薯叶和椰奶慢火炖煮，口感细腻滑嫩，富有营养。是家庭常见的传统食品。",
          },
          {
            img: "./images/km/f1.jpg",
            title: "皮拉乌",
            description:
              "皮拉乌是一种用肉类（通常是牛肉或鸡肉）与米饭和香料炖煮而成的主食。香料包括肉桂、丁香、豆蔻等，香气浓郁，是节日和家庭聚会中不可缺少的一道菜。",
          },
          {
            img: "./images/tajin.jpg",
            title: "珀萨",
            description:
              "珀萨是一种热带风味的菜肴，由熟香蕉与鱼类搭配香料炖制而成，甜咸交融，是沿海地区常见的美食。",
          },
        ],
      },
    },
  },
  ae: {
    flag: "./images/waving-flags/united-arab-emirates-flag-gif.gif",
    countryName: {
      ar: "الإمارات العربية المتحدة",
      ch: "阿拉伯联合酋长国",
    },
    geo: {
      map: "./images/maps/ae.svg",
      title: {
        ar: "الموقع الجغرافي",
        ch: "地理位置",
      },
      content: {
        ar: "تقع الإمارات في الجنوبي الشرقي من شبه الجزيرة العربية، يحدّها من الشرق سلطنة عمان، ومن الشمال الغربي دولة قطر، ومن الجنوب والجنوب الغربي المملكة العربية السعودية، بينما تطل من الشمال على الخليج العربي، وتفصلها عن إيران مياه هذا الخليج. تبلغ مساحة الدولة حوالي 83,600 كيلومتر مربع. تأخذ الإمارات شكل الهلال، ولا توجد فيها أنهار أو بحيرات للمياه العذبة. تتكون المناطق الساحلية من سهول منخفضة، بينما تقع الجبال في الجزء الشمالي الشرقي من شبه الجزيرة، حيث تمتد سلسلة جبال الحجر، ويبلغ ارتفاع أعلى قمة فيها 2438 مترًا عن سطح البحر.",
        ch: "阿联酋位于阿拉伯半岛东南端，东与阿曼毗邻，西北与卡塔尔接壤，南部和西南与沙特阿拉伯王国交界，北临阿拉伯湾，与伊朗隔海相望。国土面积约为 8.36 万平方公里。阿联酋全境呈新月形,境内无淡水河流或湖泊,沿海是地势较低的平原,半岛的东北部分属山地,横贯其间的哈杰尔山脉最高峰海拔2438米。",
      },
      popover: {
        ar: [],
        ch: [],
      },
    },
    economy: {
      title: {
        ar: "الموارد الطبيعية و مصادر الدخل",
        ch: "自然资源与收入来源",
      },
      content: {
        ar: [
          {
            icon: "./images/gold.png",
            title: "الموارد الطبيعية",
            text: "يعد النفط والغاز الطبيعي أهم الموارد الطبيعية في الإمارات، حيث تقع أكثر من 95% من هذه الموارد في إمارة أبوظبي. وقد تجاوزت الاحتياطيات المؤكدة من النفط 107 مليار برميل، بينما بلغت احتياطيات الغاز الطبيعي المؤكدة نحو 8.2 تريليون متر مكعب، ما يجعل الإمارات تحتل المرتبة السادسة عالميًا في كلا الموردين. وبالإضافة إلى النفط والغاز، تمتلك الدولة أيضًا موارد معدنية أخرى مثل الكبريت، والمغنيسيوم، والحجر الجيري، والتي تستخدم في قطاعات صناعية مختلفة داخل الدولة.",
          },
          {
            icon: "./images/factory.png",
            title: "الصناعة",
            text: "تُعد الصناعات البتروكيماوية الركيزة الأساسية للقطاع الصناعي في دولة الإمارات العربية المتحدة. وتشمل مجالات الصناعة الأخرى: تسييل الغاز الطبيعي، وصناعة الألمنيوم، ومنتجات البلاستيك، ومواد البناء، وصناعة الملابس، وتجهيز الأغذية، وغيرها من القطاعات التي شهدت تطورًا ملحوظًا في العقود الأخيرة.",
          },
          {
            icon: "./images/travel-and-tourism.png",
            title: "السياحة والطيران",
            text: "بعد عقود من التنمية المتواصلة، أصبحت دبي واحدة من أهم مراكز الأعمال والسياحة والنقل البحري في العالم. وعلى صعيد السياحة الدولية، تُصنَّف دبي باستمرار ضمن أكثر عشر وجهات سياحية شهرةً على مستوى العالم. كما أنشأت دولة الإمارات مطار دبي الدولي المصنّف ضمن أفضل مطارات العالم نظرًا لموقعها الجغرافي الاستراتيجي، حيث يقع في نقطة التقاء طرق النقل بين آسيا، وأوروبا، وأفريقيا، ويتميّز بكفاءة عالية في خدمات الترانزيت وسهولة الوصول.",
          },
        ],
        ch: [
          {
            icon: "./images/gold.png",
            title: "自然资源",
            text: "最重要的资源是石油和天然气,其中超过95%位于阿布扎比。已探明的石油储量超过1070亿桶,已探明的天然气储藏量8.2万亿立方米,均位居世界第6。其他矿产资源还有:硫磺、镁、石灰岩等。",
          },
          {
            icon: "./images/factory.png",
            title: "工业",
            text: "阿联酋以石油化工工业为主。此外还有天然气液化、炼铝、塑料制品、建筑材料、服装、食品加工等工业。",
          },
          {
            icon: "./images/travel-and-tourism.png",
            title: "旅游业与航空业",
            text: "经过数十年的发展,迪拜已是全球最重要的商务、旅游和航运中心之一。国际旅游方面,迪拜常年位于世界前十大旅游城市榜单内。由于地理位置优越，阿联酋建设了世界级的迪拜国际机场。该机场位于连接亚洲、欧洲和非洲的重要交通枢纽上，具备极高的中转效率和通达能力。",
          },
        ],
      },
    },
    cities: {
      title: {
        ar: "العاصمة و الوجهات السياحية",
        ch: "首都与旅游地",
      },
      content: {
        ar: [
          {
            img: "./images/ae/Dubai.jpeg",
            title: "أبوظبي",
            description:
              "أبوظبي هي عاصمة الإمارات وهي مركز سياسي وصناعي وثقافي وتجاري مهم في الدولة. تقع أبوظبي على الساحل الغربي الأوسط من الإمارات، وتتميز بامتلاكها ثروات نفطية هائلة، حيث يُشكّل قطاع النفط الركيزة الأساسية لاقتصادها.",
          },
          {
            img: "./images/ae/Burj-Khalifa.jpeg",
            title: "برج خليفة",
            description:
              "يُعتبر برج خليفة حاليًا أطول مبنى في العالم، حيث يبلغ ارتفاعه 828 مترًا ويتكوّن من 163 طابقًا. يمكن للزوار الصعود عبر مصاعد سريعة إلى منصّة المشاهدة، حيث يُمكنهم التمتع بإطلالة بانورامية مدهشة على المدينة وخليج العرب. كما يُعد البرج مكانًا مثاليًا للاستمتاع بمنظر دبي الليلي الباهر.",
          },
          {
            img: "./images/ae/Palm-Islands.jpeg",
            title: "جزيرة النخيل",
            description:
              "جزيرة النخيل هي جزيرة صناعية فريدة من نوعها على مستوى العالم، وقد سُمّيت بهذا الاسم لأن شكلها يُشبه شجرة النخيل. تضم الجزيرة فنادق فاخرة ومنتجعات راقية ومساكن خاصة، وتُعد رمزًا للحياة الفاخرة في دبي. يمكن للزوار الاستمتاع بخدمات من فئة خمس نجوم والمشاركة في أنشطة مائية متنوعة، إلى جانب الاسترخاء على الشواطئ الاصطناعية المصممة بعناية.",
          },
        ],
        ch: [
          {
            img: "./images/ae/Dubai.jpeg",
            title: "阿布扎比",
            description:
              "阿布扎比是阿联酋，也是阿联酋重要的政治、工业、文化和商业中心。阿布扎比位于阿拉伯联合酋长国的中西边海岸，拥有丰富的石油资源，石油产业是其经济的重要支柱。",
          },
          {
            img: "./images/ae/Burj-Khalifa.jpeg",
            title: "哈利法塔",
            description:
              "作为目前世界上最高的建筑物,它高达 828米,共有163层。游客可以乘坐高速电梯到达观景台,壮丽的城市全景和波斯湾美景尽收眼底。此外,这里还是享受迪拜夜景的理想之地。",
          },
          {
            img: "./images/ae/Palm-Islands.jpeg",
            title: "棕榈岛",
            description:
              "棕榈岛是地球上独一无二的人工岛屿，因其形状酷似棕榈树而得名。岛上拥有豪华酒店、度假村以及私人住宅，是奢华生活的象征。在这里，游客不仅可以享受五星级的服务，还可以参与各种水上活动，探索人造海滩。",
          },
        ],
      },
    },
    recipies: {
      title: {
        ar: "الأطباق المميزة",
        ch: "特色菜",
      },
      content: {
        ar: [
          {
            img: "./images/ae/Jabab.jpeg",
            title: "الجباب",
            description:
              "يُعد الجباب من أشهر الأطباق التقليدية المحبوبة لدى السكان المحليين والسياح على حد سواء. وهو عبارة عن فطيرة إماراتية رقيقة ومقرمشة، تتميز بطعمها اللذيذ. غالبًا ما يُقدَّم كوجبة فطور، حيث يُسكب فوقه شراب التمر الكثيف، ليشكّل بداية مثالية ليوم مميز.",
          },
          {
            img: "./images/ae/Madruba.jpeg",
            title: "المضروبة",
            description:
              "طبق تقليدي يعكس حب الإماراتيين العميق للمأكولات البحرية. يُحضَّر من السمك المملح والتوابل وصلصة كثيفة القوام. يُعد هذا الطبق من الوجبات الدسمة، ويحظى بشعبية خاصة خلال شهر رمضان الكريم، حيث يُقدَّم كإفطار غني ومغذي.",
          },
          {
            img: "./images/ae/Ruqaq.jpeg",
            title: "الرقاق",
            description:
              "الرقاق هو خبز إماراتي مسطح ومقرمش، يُستخدم غالبًا كمرافق للأطباق الرئيسية مثل البيض والجبن. يُصنع من عجين خالٍ من الماء، ويُقدَّم بشكل شائع في وجبتي الإفطار والعشاء.",
          },
        ],
        ch: [
          {
            img: "./images/ae/Jabab.jpeg",
            title: "Chabab",
            description:
              "可能是最受当地居民和游客欢迎的美食。这种阿联酋版的薄煎饼口感酥脆,味道十分可口。Chabab经常作为早餐,被淋上浓郁的椰枣糖浆,是人们开启美好一天的绝佳选择。",
          },
          {
            img: "./images/ae/Madruba.jpeg",
            title: "Madrooba",
            description:
              "一道体现了阿联酋对鱼类深厚喜爱的传统美食。它由咸鱼、香料和浓稠的酱汁组合而成。这是一顿丰盛的餐食,也是斋月期间颇受欢迎的开斋饭。",
          },
          {
            img: "./images/ae/Ruqaq.jpeg",
            title: "Regag",
            description:
              "一种酥脆的阿联酋扁平面包,常用来搭配各种配菜和主菜,例如鸡蛋和奶酪。这种面包由无水面团制作而成,大多在早餐和晚餐时供应。",
          },
        ],
      },
    },
  },
  ye: {
    flag: "./images/waving-flags/yemen-flag-gif.gif",
    countryName: {
      ar: "اليمن",
      ch: "也门",
    },
    geo: {
      map: "./images/maps/ye.svg",
      title: {
        ar: "الموقع الجغرافي",
        ch: "地理位置",
      },
      content: {
        ar: `تقع اليمن في الجنوب الغربي من شبه الجزيرة العربية، حيث تحدها المملكة العربية السعودية من الشمال، وسلطنة عمان من الشرق، وتُطل من الغرب على البحر الأحمر، ومن الجنوب على خليج عدن وبحر العرب، ويبلغ طول سواحلها نحو 1906 كيلومترًا. تبلغ مساحة البلاد 528,000 كيلومتر مربع. يقع في جنوبها الغربي مضيق باب المندب، وهو من أهم الممرات البحرية الدولية، حيث يربط بين المحيط الهندي والبحر المتوسط، ويُعد ممرًا استراتيجيًا هامًا لحركة التجارة بين آسيا وأفريقيا وأوروبا. تتمتع المنطقة الجنوبية من اليمن بمناخ استوائي جاف، بينما المنطقة الغربية على ساحل البحر الأحمر والمعروفة بمنطقة تهامة تتميز بمناخ حار ورطب.`,
        ch: `也门位于阿拉伯半岛西南端，北部与沙特阿拉伯接壤，东部与阿曼为邻，西濒红海，南临亚丁湾和阿拉伯海，海岸线总长约1906公里。国土面积为52.8万平方公里。位于西南的曼德海峡是国际重要通航海峡之一，连接印度洋和地中海，是欧、亚、非三大洲的海上交通要道，具有极其重要的战略地位。也门南部属于热带干旱气候，而西部红海沿岸的帖哈麦地区则气候炎热潮湿。`,
      },
      popover: {
        ar: [],
        ch: [],
      },
    },
    economy: {
      title: {
        ar: "الموارد الطبيعية و مصادر الدخل",
        ch: "自然资源与收入来源",
      },
      content: {
        ar: [
          {
            icon: "./images/icons/oil-barrel.png",
            title: "النفط والغاز الطبيعي",
            text: "يُعد النفط والغاز الطبيعي من أهم الموارد الطبيعية في اليمن. ومنذ ثمانينيات القرن العشرين، أصبحت صناعة النفط والإنتاج الصناعي والتصدير الركيزة الأساسية للاقتصاد الوطني.",
          },
          {
            icon: "./images/planting.png",
            title: "الزراعة",
            text: "تبلغ مساحة الأراضي الصالحة للزراعة في اليمن حوالي 1.45 مليون هكتار، في حين أن المساحة المزروعة فعليًا تبلغ نحو 1.37 مليون هكتار. يشكل القطاع الزراعي مصدر رزق لما يقارب 71% من سكان البلاد. وتشمل المنتجات الزراعية الرئيسية: القطن، القهوة، الذرة الرفيعة، الذرة، الشعير، البقوليات، والسمسم.",
          },
        ],
        ch: [
          {
            icon: "./images/icons/oil-barrel.png",
            title: "石油和天然气",
            text: "石油和天然气是最主要自然资源。20 世纪 80 年代起，石油工业化生产和出口成为国民经济支柱产业。",
          },
          {
            icon: "./images/planting.png",
            title: "农业",
            text: "全国有可耕地145万公顷，已耕地面积约137万公顷。农业人口约占全国人口的71%。农产品主要有棉花、咖啡、高粱、玉米、大麦、豆类、芝麻等。",
          },
        ],
      },
    },
    cities: {
      title: {
        ar: "العاصمة و الوجهات السياحية",
        ch: "首都与旅游地",
      },
      content: {
        ar: [
          {
            img: "./images/ye/c1.jpg",
            title: "صنعاء",
            description:
              "صنعاء هي عاصمة اليمن، تقع في سهل صنعاء بين جبلي 'أيبان' و'نقم'، ويبلغ متوسط ارتفاعها عن سطح البحر حوالي 2200 متر. تُعد المركز السياسي والاقتصادي والثقافي للبلاد. كما تُعتبر مدينة تاريخية إسلامية.",
          },
          {
            img: "./images/ye/c2.jpg",
            title: "جزيرة سقطرى",
            description:
              "تقع جزيرة سقطرى في غرب المحيط الهندي، على بعد حوالي 350 كيلومترًا جنوب شبه الجزيرة العربية، شرق القرن الإفريقي، عند التقاء بحر العرب بخليج عدن. تتكوّن من أربع جزر، وتبلغ مساحتها حوالي 3650 كيلومترًا مربعًا. تم إدراجها في قائمة التراث العالمي لليونسكو عام 2008.",
          },
        ],
        ch: [
          {
            img: "./images/ye/c1.jpg",
            title: "萨那",
            description:
              "萨那是也门首都，位于阿邦山和纳卡穆山之间的萨那盆地，平均海拔2200米，是也门全国政治、经济、文化中心。它是伊斯兰历史名城。",
          },
          {
            img: "./images/ye/c2.jpg",
            title: "索科特拉岛",
            description:
              "索科特拉岛位于印度洋西部，位置在阿拉伯半岛以南约350公里，非洲之角以东，阿拉伯海与亚丁湾的交接处。该群岛由4岛组成，群岛面积3650平方公里。2008年列入联合国教科文组织世界遗产名录。",
          },
        ],
      },
    },
    recipies: {
      title: {
        ar: "الاطباق المميزة",
        ch: "特色菜",
      },
      content: {
        ar: [
          {
            img: "./images/recipies/ye/yemen-recipe-1.png",
            title: "المندي",
            description:
              "المندي هو طبق تقليدي نشأ في منطقة حضرموت في اليمن، ويتكون أساسًا من اللحم والأرز مع خليط خاص من التوابل. يُطهى غالبًا في فرن تقليدي تحت الأرض يسمى 'الميفى'. وهو منتشر بشكل واسع في شبه الجزيرة العربية، ويُعد من أشهر الأطباق اليمنية على الإطلاق.",
          },
          {
            img: "./images/recipies/ye/yemen-recipe-2.png",
            title: "الملوح",
            description:
              "هذا نوع من الخبز اليمني التقليدي، يتميز بكونه مكوّن من طبقات تُطوى وتُطهى مع السمن أو الزبدة، مما يمنحه قوامًا مقرمشًا وطعمًا لذيذًا. يُقدم عادةً مع الشاي أو بجانب الأطباق الرئيسية.",
          },
          {
            img: "./images/recipies/ye/yemen-recipe-3.png",
            title: "السلطة اليمنية",
            description:
              "السلطة اليمنية بسيطة وتُحضّر من مكونات طازجة مثل الخس، الطماطم، الخيار، وأحيانًا الجزر. عادةً ما تكون بدون صلصة، أو يُضاف إليها الزبادي أو صلصة بسيطة. وتُقدم غالبًا كمقبلات قبل الوجبة.",
          },
        ],
        ch: [
          {
            img: "./images/recipies/ye/yemen-recipe-1.png",
            title: "曼迪饭",
            description:
              "曼迪饭是一道起源于也门哈德拉毛的传统菜肴。主要由肉和米饭以及特殊的香料混合而成，它在阿拉伯半岛的大部分地区很受欢迎，尤其是也门人民。",
          },
          {
            img: "./images/recipies/ye/yemen-recipe-2.png",
            title: "马挂瓦",
            description:
              "马挂瓦是也门多种面包中的一种。是什么让它独特的是，它是分层和折叠与黄油或酥油，使其非常好吃。",
          },
          {
            img: "./images/recipies/ye/yemen-recipe-3.png",
            title: "也门沙拉",
            description:
              "也门沙拉一般很简单，包括生菜，西红柿，黄瓜，有时还有胡萝卜。有时在上面没有敷料，其他时候有一个简单的酸奶或番茄酱。沙拉也在饭前开始。",
          },
        ],
      },
    },
  },
  om: {
    flag: "./images/waving-flags/oman-flag.gif",
    countryName: {
      ar: "سلطنة عمان",
      ch: "阿曼",
    },
    geo: {
      map: "./images/maps/om.svg",
      title: {
        ar: "الموقع الجغرافي",
        ch: "地理位置",
      },
      content: {
        ar: "تقع عُمان في غرب آسيا على الساحل الجنوبي الشرقي لشبه الجزيرة العربية. يحدها من الشمال الغربي دولة الإمارات العربية المتحدة، ومن الغرب المملكة العربية السعودية، ومن الجنوب الغربي اليمن.تضم شمال شرق عُمان سلسلة جبال الحجر التي تمتد على طول الساحل من الشمال الغربي إلى الجنوب الشرقي، وتشكل حوالي ثلث مساحة البلاد. أعلى قمة فيها هي جبل شمس، الذي يبلغ ارتفاعه 3352 مترًا، ويُعد أعلى قمة في عُمان.أما باقي المناطق خارج الشمال الشرقي الجبلي،تنتمي للمناخ الصحراوي المداري.",
        ch: "阿曼位于西亚、阿拉伯半岛东南沿海，西北与阿拉伯联合酋长国接壤，西面毗邻沙特阿拉伯，西南靠近也门。阿曼境内东北部为哈贾尔山脉，沿海岸从西北向东南延伸，约占国土面积1/3，其主峰沙姆山海拔3352米，为阿曼最高峰。除东北部山地外，均属热带沙漠气候。",
      },
      popover: {
        ar: [],
        ch: [],
      },
    },
    economy: {
      title: {
        ar: "الموارد الطبيعية و مصادر الدخل",
        ch: "自然资源与收入来源",
      },
      content: {
        ar: [
          {
            icon: "./images/gold.png",
            title: "الموارد الطبيعية",
            text: "يُعد قطاع النفط والغاز الركيزة الأساسية لاقتصاد سلطنة عُمان، حيث يشكل دخل النفط والغاز 68% من الإيرادات الحكومية، و41% من الناتج المحلي الإجمالي. وتُعد الصناعة العمانية قائمة بشكل رئيسي على استخراج النفط، حيث بدأت الحكومة تولي اهتمامًا متزايدًا بصناعة الغاز الطبيعي في السنوات الاخيرة.",
          },
          {
            icon: "./images/planting.png",
            title: "الزراعة",
            text: "تلعب الزراعة وتربية الماشية وصيد الأسماك دورًا مهمًا في الاقتصاد العماني غير النفطي، حيث تلبي 47.6% من احتياجات البلاد من الغذاء، و69% من احتياجات الأعلاف الحيوانية. وتبلغ مساحة الأراضي الصالحة للزراعة في البلاد نحو 100 ألف هكتار، بينما تُستغل فعليًا حوالي 73 ألف هكتار، وتُزرع فيها بشكل أساسي التمور والليمون والموز وغيرها من الفواكه والخضروات.",
          },
        ],
        ch: [
          {
            icon: "./images/gold.png",
            title: "自然资源",
            text: "石油、天然气产业是阿曼的支柱产业，油气收入占国家财政收入的68%，占国内生产总值的41%。工业以石油开采为主，近年来开始重视天然气工业。",
          },
          {
            icon: "./images/planting.png",
            title: "农业",
            text: "农、牧、渔业在国民经济非石油产业中举足轻重，能满足国内47.6％的粮食和69％的动物饲料需求。全国可耕地约10万公顷，已耕地7.3万公顷，主要种植椰枣、柠檬、香蕉等水果和蔬菜。",
          },
        ],
      },
    },
    cities: {
      title: {
        ar: "العاصمة و الوجهات السياحية",
        ch: "首都与旅游地",
      },
      content: {
        ar: [
          {
            img: "./images/om/c1.jpg",
            title: "مسقط",
            description:
              "مسقط هي عاصمة عمان، تقع على ساحل خليج عمان، وتُعد المركز السياسي و الاقتصادي والإداري في البلاد. تُعرف بجمال طبيعتها وموقعها الاستراتيجي المهم، كما تشتهر بتراثها الثقافي العربي العريق الذي يجعلها وجهة سياحية مفضلة لدى الزوار من مختلف أنحاء العالم.",
          },
          {
            img: "./images/om/c2.jpg",
            title: "قلعة نزوى",
            description:
              "تُعد قلعة نزوى المعلم الأبرز في مدينة نروي القديمة، وتقع في قلب المدينة، وهي واحدة من أقدم وأشهر القلاع في سلطنة عمان. يعود تاريخ بنائها إلى أواخر القرن الثامن الميلادي.",
          },
          {
            img: "./images/om/c3.jpg",
            title: "صور",
            description:
              "صور واحدة من أقدم الموانئ والمدن البحرية في العالم، ويعود تاريخها إلى القرن السادس عشر قبل الميلاد أو حتى قبل ذلك، وقد كانت ميناءً تجاريًا مهمًا في عُمان، ولعبت دورًا محوريًا في التبادل التجاري بين منطقة الخليج وشبه القارة الهندية.",
          },
        ],
        ch: [
          {
            img: "./images/om/c1.jpg",
            title: "马斯喀特",
            description:
              "马斯喀特是阿曼的首都，位于阿曼湾沿岸，是全国的政治、经济和行政中心。风景秀丽，战略地位重要。城市神秘和丰富的阿拉伯文化遗产每年都吸引着众多的海外游客。",
          },
          {
            img: "./images/om/c2.jpg",
            title: "尼兹瓦城堡",
            description:
              "尼兹瓦城堡是尼兹瓦古城当之无愧的地标建筑，位于整个城市的中心地带，是阿曼最古老最著名的城堡。堡垒始建于公元8世纪末",
          },
          {
            img: "./images/om/c3.jpg",
            title: "苏尔",
            description:
              "是世界上最古老的港口和航海城市之一，历史可追溯到公元前16世纪甚至更早。曾是阿曼重要的贸易港口，在连接海湾地区与印度次大陆的贸易往来中发挥了关键作用。",
          },
        ],
      },
    },
    recipies: {
      title: {
        ar: "الأطباق المميزة",
        ch: "特色菜",
      },
      content: {
        ar: [
          {
            img: "./images/om/f1.jpg",
            title: "الشواء",
            description:
              "الشواء هو طبق تقليدي عماني يُحضّر في المناسبات الخاصة. يتم تتبيل اللحم بتوابل عمانية خاصة، ثم يُلف بأوراق الموز أو النخيل، ويُطهى داخل فرن رملي تحت الأرض.",
          },
          {
            img: "./images/om/f2.jpg",
            title: "المجبوس",
            description:
              "المجبوس هو طبق من الأرز المخلوط، يُطهى عادةً مع اللحم المُتبل (مثل لحم البقر أو الدجاج) والخضروات، وأحيانًا يُقدَّم مع اللبن الزبادي أو السلطة الخضراء.",
          },
          {
            img: "./images/om/f3.jpg",
            title: "الخبز العماني",
            description:
              "يأتي الخبز العماني بعدة أشكال منها الخبز الدائري السميك والخبز الرقيق بحجم صحن الطعام. غالبًا ما يتم تحضيره في المنازل أو شراؤه من المخابز، ويُقدَّم بجانب مختلف الأطعمة.",
          },
        ],
        ch: [
          {
            img: "./images/om/f1.jpg",
            title: "舒瓦",
            description:
              "舒瓦意为烤肉，是阿曼的传统美食，通常在特殊场合准备。肉类用阿曼香料腌制后，用香蕉叶或棕榈叶包裹，放入地下沙炉中烹饪。",
          },
          {
            img: "./images/om/f2.jpg",
            title: "马赫布斯",
            description:
              "这是一种混合米饭菜肴，通常包含香料调味的肉类（牛肉或鸡肉）和蔬菜，有时还会配上酸奶或绿色沙拉。",
          },
          {
            img: "./images/om/f3.jpg",
            title: "阿曼面包",
            description:
              "阿曼面包有多种类型，包括厚的圆形面包和薄的餐盘大小的面包。这些面包通常是家庭自制或在面包店购买，常与各种菜肴一起食用。",
          },
        ],
      },
    },
  },
  bh: {
    flag: "./images/waving-flags/bahrain-flag-gif.gif",
    countryName: {
      ar: "مملكة البحرين",
      ch: "巴林",
    },
    geo: {
      map: "./images/maps/bh.svg",
      title: {
        ar: "الموقع الجغرافي",
        ch: "地理位置",
      },
      content: {
        ar: "البحرين هي دولة جُزُرِيّة تقع في الجنوب الغربي للخليج العربي، تقع بين قطر والمملكة العربية السعودية، وترتبط بالسعودية عبر جسر بحري. تبعد عن الساحل الشرقي للمملكة العربية السعودية 24 كيلومترًا، وعن الساحل الغربي لقطر 28 كيلومترًا. تبلغ مساحتها حوالي 780 كيلومترًا مربعًا.نظرًا لموقعها الجغرافي المتميز، كانت البحرين منذ القدم مركزًا مهمًا للتجارة البحرية، حيث تربط طرق الملاحة بين آسيا وأفريقيا وأوروبا.يتميز مناخ البحرين بأنه مناخ صحراوي استوائي، وتغلب على تضاريسها السهول، بينما تنتشر على سواحلها المسطحات الطينية والشعاب المرجانية، مع وجود بعض الكثبان الرملية والمناطق المالحة في المناطق الداخلية.",
        ch: "巴林是位于阿拉伯湾西南部的一个岛国，界于卡塔尔和沙特阿拉伯之间，与沙特有跨海大桥相连接，距沙特阿拉伯东海岸24公里，卡塔尔西海岸28公里，国土面积780平方公里。由于地理位置优越，巴林自古以来就是海上贸易的重要枢纽，连接了亚洲、非洲和欧洲的航线。巴林属热带沙漠气候，地形以平原为主，沿海地区多为浅滩和珊瑚礁，内陆则有少量沙丘和盐沼地带。",
      },
      popover: {
        ar: [],
        ch: [],
      },
    },
    economy: {
      title: {
        ar: "الموارد الطبيعية و مصادر الدخل",
        ch: "自然资源与收入来源",
      },
      content: {
        ar: [
          {
            icon: "./images/gold.png",
            title: "الموارد الطبيعية",
            text: "يُعد النفط والغاز الطبيعي أهم الموارد الطبيعية في البحرين، حيث يمثل قطاع النفط والغاز الدعامة الاستراتيجية لاقتصاد البلاد. وقد تم حتى الآن اكتشاف احتياطي نفطي يُقدّر بـ124.6 مليون برميل، واحتياطي غاز طبيعي يبلغ حوالي 3.25 تريليون قدم مكعب. ويُعتبر هذا القطاع أيضًا المصدر الرئيسي لإيرادات الحكومة البحرينية، إذ يساهم بنحو 76% من إيرادات الدولة، ويمثل حوالي 17.7% من الناتج المحلي الإجمالي.",
          },
          {
            icon: "./images/fishermen.png",
            title: "الموارد السمكية",
            text: "تُعد الموارد السمكية الغنية على السواحل من أهم الموارد الطبيعية في البحرين.توجد في المياه الإقليمية للبحرين أنواع عديدة من الأسماك مثل الهامور، والتونة، والروبيان.بالإضافة إلى ذلك، فإن الشعاب المرجانية وغيرها من الموارد البيئية البحرية لا تملك فقط قيمة بيئية عالية، بل توفر أيضًا أساسًا مهمًا لتطوير قطاع السياحة.",
          },
          {
            icon: "./images/travel-and-tourism.png",
            title: "السياحة",
            text: "أصبحت السياحة أحد أعمدة الاقتصاد البحريني، مدعومة بالتوسع في البنية التحتية الثقافية والترفيهية.تجمع البحرين بين عراقة المعالم التاريخية مثل قلعة البحرين وروعة المنشآت الحديثة كالفنادق ومراكز التسوق.وتُعد الفعاليات العالمية وعلى رأسها سباق الفورمولا 1، عامل جذب رئيسي للسياح من مختلف أنحاء العالم.",
          },
        ],
        ch: [
          {
            icon: "./images/gold.png",
            title: "自然资源",
            text: "石油和天然气是巴林最重要的自然资源，油气产业是巴林经济的战略支柱。目前已探明石油储量为1.246亿桶，天然气储量3.25万亿立方英尺。该产业也是巴林政府最主要的收入来源，对巴林财政贡献率达76%，产值约占国内生产总值的17.7%。",
          },
          {
            icon: "./images/fishermen.png",
            title: "海洋资源",
            text: "沿海丰富的渔业资源是重要自然资源。巴林海域有多种鱼类，如石斑鱼、金枪鱼、虾类等。此外，珊瑚礁等海洋生态资源不仅具有生态价值，还为旅游业发展提供了基础。",
          },
          {
            icon: "./images/travel-and-tourism.png",
            title: "旅游业",
            text: "旅游业发展迅速，成为经济增长的重要动力。巴林拥有丰富的历史文化遗迹，如巴林堡，见证了古代文明的繁荣；还有现代化的休闲娱乐设施，如豪华酒店、购物中心、主题公园等。此外，巴林每年举办各类国际赛事和活动，如巴林国际赛车场举办的 F1 大奖赛，吸引大量游客和媒体关注，带动了酒店、餐饮、交通等相关产业发展。",
          },
        ],
      },
    },
    cities: {
      title: {
        ar: "العاصمة و الوجهات السياحية",
        ch: "首都与旅游地",
      },
      content: {
        ar: [
          {
            img: "./images/bh/Manama.jpeg",
            title: "المنامة",
            description:
              "المنامة هي عاصمة البحرين وأكبر مدنها، كما تُعد المركز السياسي والاقتصادي والنقل والتجاري والثقافي للبلاد. تحتل مكانة مهمة في منطقة الخليج، وتُلقب بـ'لؤلؤة الخليج'.",
          },
          {
            img: "./images/bh/Bahrain-Fort.jpeg",
            title: "قلعة البحرين",
            description:
              "تقع على الساحل الشمالي لجزيرة البحرين، وتُعد واحدة من أهم المواقع التاريخية في البلاد. يعود تاريخها إلى حوالي عام 3000 قبل الميلاد. تتكون القلعة من عدة مبانٍ تشمل القصور والمعابد والمستودعات، حيث يمكن للزوار استكشاف الموقع والتعرف على التحولات التاريخية التي مرت بها البحرين.",
          },
          {
            img: "./images/bh/Bahrain-International-Circuit.jpeg",
            title: "حلبة البحرين الدولية",
            description:
              "تُقام فيها سباقات الجائزة الكبرى للفورمولا 1 والعديد من الفعاليات العالمية الأخرى لرياضة السيارات، مما يجذب اهتمام عشاق السباقات من جميع أنحاء العالم. حتى خارج مواسم السباقات، يمكن للزوار زيارة الحلبة وتجربة أنشطة مثل محاكاة سباقات السيارات والاستمتاع بأجواء رياضة المحركات.",
          },
        ],
        ch: [
          {
            img: "./images/bh/Manama.jpeg",
            title: "麦纳麦",
            description:
              "麦纳麦是巴林的首都，也是全国第一大城市，是全国政治、经济、交通、贸易和文化中心，在海湾地区具有重要地位，享有'波斯湾明珠'的美誉。",
          },
          {
            img: "./images/bh/Bahrain-Fort.jpeg",
            title: "巴林堡",
            description:
              "位于巴林岛北岸，是巴林最重要的历史遗迹之一。它建于公元前 3000 年左右。巴林堡由多个建筑组成，包括宫殿、寺庙、仓库等游客可以参观遗址，了解巴林的历史变迁。",
          },
          {
            img: "./images/bh/Bahrain-International-Circuit.jpeg",
            title: "巴林国际赛车场",
            description:
              "举办 F1 巴林大奖赛等国际顶级赛车赛事，吸引全球赛车爱好者关注。即使在非赛事期间，游客也可以参观赛车场，体验模拟赛车等项目，感受赛车运动的魅力。",
          },
        ],
      },
    },
    recipies: {
      title: {
        ar: "الأطباق المميزة",
        ch: "特色菜",
      },
      content: {
        ar: [
          {
            img: "./images/bh/Bahraini-Balaleet.jpeg",
            title: "البلاليط البحريني",
            description:
              "هو طبق فريد يجمع بين الطعم الحلو والمالح. يُحضَّر باستخدام الشعيرية ، حيث تُطهى مع الزعفران والسكر لإضفاء نكهة ورائحة مميزة وحلاوة لذيذة، ثم توضع فوقها طبقة من البيض المقلي أو يُضاف الصنوبر. يخلق هذا المزيج بين حلاوة الشعيرية وملوحة البيض أو الصنوبر تجربة مذاق مميزة.",
          },
          {
            img: "./images/bh/Khamir-Bread.jpeg",
            title: "خبز الخمير",
            description:
              "خبز الخمير هو خبز بحريني تقليدي ، يُعد من دقيق القمح، الخميرة، السكر، الهيل، وأحيانًا يُضاف الزعفران أو ماء الورد. يتميز بلونه الذهبي وقوامه الطري، وغالبًا ما يُطهى على الصاج أو في الفرن. يُقدم عادةً مع الشاي أو القهوة، ويُعتبر من الأطعمة التراثية في المناسبات البحرينية.",
          },
          {
            img: "./images/bh/Muhammar.jpeg",
            title: "المحمّر",
            description:
              "المحمّر هو طبق تقليدي في البحرين، يتم تحضيره من الأرز والسكر والزبدة والبهارات مثل الهيل والقرفة. يتميز بحبات أرز لامعة ذات لون أحمر وطعم حلو لذيذ. غالبًا ما يُقدم مع السمك المقلي أو المأكولات البحرية، ويُعد من الأطباق الأساسية في المناسبات والأعياد.",
          },
        ],
        ch: [
          {
            img: "./images/bh/Bahraini-Balaleet.jpeg",
            title: "巴拉利特",
            description:
              "是一道独特的甜咸交织的美食。由细面条制成，先将面条用藏红花和糖调味，使其具有独特的香气和甜味，然后在顶部放上煎蛋或松子。甜美的面条与咸香的煎蛋、松子搭配，创造出一种奇妙的口感组合。",
          },
          {
            img: "./images/bh/Khamir-Bread.jpeg",
            title: "巴林传统甜面包",
            description:
              "是一种传统的巴林甜面包，由小麦粉、酵母、糖、豆蔻，有时还加入藏红花或玫瑰水制成。它呈金黄色，质地柔软，通常在平底锅或烤箱中烘烤。通常与茶或咖啡一起食用，是巴林节庆中的传统食品之一。",
          },
          {
            img: "./images/bh/Muhammar.jpeg",
            title: "穆哈马尔",
            description:
              "穆哈马尔是巴林的一道传统美食。它用米饭、糖、黄油和香料（如豆蔻和肉桂）烹制而成，米粒晶莹剔透，色泽红亮，味道甜美。通常与油炸鱼或海鲜一起食用，是节日期间和家庭聚会中不可或缺的菜肴之一",
          },
        ],
      },
    },
  },
  eg: {
    flag: "./images/waving-flags/egypt-flag-gif.gif",
    countryName: {
      ar: "جمهورية مصر العربية",
      ch: "阿拉伯埃及共和国",
    },
    geo: {
      map: "./images/maps/eg.svg",
      title: {
        ar: "الموقع الجغرافي",
        ch: "地理位置",
      },
      content: {
        ar: "تقع مصر شمال شرق قارة أفريقيا ، وتبلغ مساحتها حوالي مليون كيلومتر مربع، مما يجعلها واحدة من أكبر الدول مساحةً في أفريقيا. يحدها البحر المتوسط من الشمال ، ومن الشرق البحر الأحمر، ومن الغرب ليبيا، ومن الجنوب السودان. تمتلك مصر ساحلًا طويلًا، إذ يبلغ طول ساحلها على البحر الأبيض المتوسط حوالي 1000 كيلومتر، وعلى البحر الأحمر حوالي 1500 كيلومتر. يتمتع الساحل الشمالي بمناخ البحر المتوسط، بينما تسود باقي المناطق المناخ الصحراوي الحار. تتكون تضاريس مصر من سهول ووديان وهضاب. وتعتمد مصر بشكل أساسي على نهر النيل كمصدر رئيسي للمياه، إذ تتركز معظم الموارد المائية في وادي النيل. ولا توجد في مصر أنهار دائمة أخرى، وتُعد المياه الجوفية مصدرًا هامًا إضافيًا للمياه.",
        ch: "埃及位于非洲东北部，面积约100万平方公里，是非洲面积较大的国家之一。北临地中海，东界限为红海，西接利比亚，南邻苏丹。埃及拥有较长的海岸线，地中海沿岸大约有1000公里，红海沿岸约1500公里。北部沿海属地中海型气候，属于地区属热带沙漠气候。由平原、河谷和高原组成。埃及主要依赖尼罗河作为水源，因为尼罗河是该国主要的水源，所有主要水体都集中在尼罗河谷。埃及没有其他常年性河流，地下水是另一个重要的水源。",
      },
      popover: {
        ar: [
          {
            name: "نهر النيل",
            info: "نهر النيل هو أطول نهر في العالم، حيث يبلغ طوله 6650 كيلومترًا. يقع في شمال شرق إفريقيا، وينبع من هضبة بوروندي في وسط إفريقيا، ويجري عبر عدة دول، منها مصر، السودان، وإثيوبيا، ليصب في النهاية في البحر الأبيض المتوسط",
          },
        ],
        ch: [
          {
            name: "尼罗河",
            info: "尼罗河是世界上最长的河流，全长6650千米，它位于非洲东北部，发源于非洲中部的布隆迪高原，流经多个国家，包括埃及、苏丹、埃塞俄比亚等，最终注入地中海。",
          },
        ],
      },
    },
    economy: {
      title: {
        ar: "الموارد الطبيعية و مصادر الدخل",
        ch: "自然资源与收入来源",
      },
      content: {
        ar: [
          {
            icon: "./images/planting.png",
            title: "الزراعة",
            text: "تتمتع المناطق الواقعة على ضفاف نهر النيل ودلتا النيل بخصوبة التربة ووفرة في مصادر الري، مما يجعلها من أهم المناطق الزراعية في مصر. وتشمل المحاصيل الرئيسية القمح، والذرة، والأرز، والقطن، وقصب السكر. ويُعد القطن المصري طويل التيلة، المعروف بطوله وجودة  ولونه المميز، من المنتجات الزراعية المشهورة عالميًا، ويُعتبر من أهم الصادرات الزراعية المصرية.",
          },
          {
            icon: "./images/icons/port.png",
            title: "قناة السويس",
            text: "تُعد قناة السويس ممرًا مائيًا دوليًا بالغ الأهمية، حيث تربط البحر الأبيض المتوسط بالبحر الأحمر، وتصل بين  أوروبا وآسيا وأفريقيا. وتتمتع القناة بأهمية استراتيجية واقتصادية عالية، إذ تُفرض رسوم عبور على السفن المارة، مما يجعل عائدات القناة مصدرًا رئيسيًا للعملة الأجنبية في مصر. ومع تطور التجارة العالمية، ارتفعت كمية البضائع المنقولة عبر القناة، مما أدى إلى زيادة ملحوظة في إيراداتها.",
          },
          {
            icon: "./images/gold.png",
            title: "الموارد الطبيعية",
            text: " تتمتع  مصر باحتياطيات كبيرة من النفط والغاز الطبيعي، فضلاً عن مجموعة متنوعة من المعادن مثل الفوسفات وخام الحديد، مما  يوفر فرصًا للصناعات مثل الطاقة والتعدين.",
          },
        ],
        ch: [
          {
            icon: "./images/planting.png",
            title: "农业",
            text: "尼罗河沿岸和三角洲地区土壤肥沃，灌溉水源充足，是埃及重要的农业产区 。主要农作物有小麦、玉米、水稻、棉花、甘蔗等 。埃及长绒棉以其纤维长、色泽好、品质高而闻名世界，是重要的出口农产品 。",
          },
          {
            icon: "./images/icons/port.png",
            title: "苏伊士运河",
            text: "苏伊士运河是连接地中海和红海的重要国际航道，贯通欧、亚、非三大洲，具有极高的战略和经济价值 。过往船只需缴纳通行费，运河收入成为埃及重要的外汇来源 。随着全球贸易的发展，苏伊士运河的货运量不断增加，收入也相应增长 。​",
          },
          {
            icon: "./images/gold.png",
            title: "自然资源",
            text: "埃及有大量石油、天然气储备，还蕴藏磷酸盐、铁矿石等多种矿产，可为能源、矿业等产业提供机遇。",
          },
        ],
      },
    },
    cities: {
      title: {
        ar: "العاصمة و الوجهات السياحية",
        ch: "首都与旅游地",
      },
      content: {
        ar: [
          {
            img: "./images/eg/Cairo.jpeg",
            title: "القاهرة",
            description:
              "القاهرة هي عاصمة مصر وأكبر مدنها، كما أنها أكبر مدينة في إفريقيا والعالم العربي.وواحدة من أقدم المدن في العالم، وهي المركز السياسي والاقتصادي والتجاري والثقافي لمصر.",
          },
          {
            img: "./images/eg/The-Pyramids.jpeg",
            title: "أهرامات الجيزة",
            description:
              "بُنيت أهرامات الجيزة عام 2500 قبل الميلاد، وهي واحدة من عجائب الدنيا السبع . تضم ثلاث أهرامات هرم خوفو، وهرم خفرع، وهرم منقرع.",
          },
          {
            img: "./images/eg/Alexandria.jpeg",
            title: "الأسكندرية",
            description:
              "تعتبر الإسكندرية نجمة الحضارة المصرية القديمة وأحد أهم المدن ثقافياً وتاريخياً في العالم العربي. ويرجع ذلك أساسًا إلى أن المدينة كانت تتمتع بمكانة اقتصادية وثقافية مهمة في العصور القديمة. وتسمى الإسكندرية أيضًا 'لؤلؤة البحر الأبيض المتوسط'.",
          },
        ],
        ch: [
          {
            img: "./images/eg/Cairo.jpeg",
            title: "开罗",
            description:
              "开罗是埃及首都及最大城市，是非洲及阿拉伯世界最大城市。也是世界上最古老的城市之一。是埃及的政治、经济、商业和文化中心。",
          },
          {
            img: "./images/eg/The-Pyramids.jpeg",
            title: "吉萨金字塔",
            description:
              "吉萨金字塔群建造于大约公元前2500年，是古代世界七大奇迹之一。包括三座金字塔：胡夫金字塔、哈夫拉金字塔和孟卡拉金字塔。",
          },
          {
            img: "./images/eg/Alexandria.jpeg",
            title: "亚历山大",
            description:
              "亚历山大是古埃及的文明之星,也是阿拉伯世界上文化和历史最重要的城市之一。主要是因为这座城市在古代具有重要的经济和文化地位。还把亚历山大叫做'地中海的明珠',因为虽然古城市有悠久的历史,但是还像新娘一样美丽。",
          },
        ],
      },
    },
    recipies: {
      title: {
        ar: "الأطباق المميزة",
        ch: "特色菜",
      },
      content: {
        ar: [
          {
            img: "./images/eg/Molokhia.jpeg",
            title: "الملوخية",
            description:
              "الملوخية هي طبق تقليدي مصري يُحضّر باستخدام أوراق نبات الملوخية، التي تُزرع  على ضفاف نهر النيل. يتم تحضير الحساء عن طريق غلي أوراق الملوخية المفرومة مع الدجاج أو اللحم، ويُضاف إليها الثوم والزبدة. يتميز الحساء بلونه الأخضر الداكن وقوامه اللزج. و يتميز بنكهة فريدة من نوعها .",
          },
          {
            img: "./images/eg/Koshari.jpeg",
            title: "الكشري",
            description:
              "الكشري هو أحد أشهر الأطباق الشعبية في مصر، ويُعتبر من الأطعمة الوطنية. يتكون من خليط من الأرز، والمعكرونة، والعدس الأسود، والبصل المقلي، ويُضاف إليه صلصة الطماطم الحارة أو الخل والثوم حسب الرغبة. يتم تحضير المكونات بشكل منفصل ثم تُخلط معًا عند التقديم. يُمكن إضافة الحمص أو صلصة الفلفل الحار حسب الذوق.",
          },
          {
            img: "./images/eg/Hamam-Mahshi.jpeg",
            title: "حمام محشي",
            description:
              "يعتبر حمام المحشي من الأطباق التقليدية الشهيرة على موائد الطعام المصرية. يتم حشو الحمام الصغير بالأرز المتبل بالتوابل ا، وأحيانًا تُضاف إليه قطع صغيرة من الكبدة ، ثم يتم تحميرة حتى يصبح جلده ذهبيًا ومقرمشًا.يتميز لحم الحمام بنعومته ونكهته الشهية، مما يجعل الطبق له مذاق خاص .",
          },
        ],
        ch: [
          {
            img: "./images/eg/Molokhia.jpeg",
            title: "锦葵汤",
            description:
              "锦葵汤是由盛产于尼罗河两岸的锦葵菜叶，搭配鸡肉、羊肉和大蒜，与黄油一起炖制而成的一道埃及传统美食。这道汤色泽浓绿，口感粘稠，其味道鲜美而具有独特风味。",
          },
          {
            img: "./images/eg/Koshari.jpeg",
            title: "库莎丽",
            description:
              "库莎丽是埃及的平民特色美食，也是最出名的美食，由米饭、通心粉、洋葱、黑扁豆及番茄酱等制成。材料分开烹调，吃时再拌在一起，可根据喜好加入醋、蒜、辣酱、炸圆葱等调味。",
          },
          {
            img: "./images/eg/Hamam-Mahshi.jpeg",
            title: "鸽子饭",
            description:
              "鸽子饭常常是埃及宴席上的必备菜肴，以烤鸽子为主要食材，通常会将乳鸽的腹部塞满香料调味的大米，有时还会加入些许碎羊肝，再用炭火烧至表皮金黄，烹饪后的鸽子肉质鲜美，酥脆可口，整体口感十分美妙。",
          },
        ],
      },
    },
  },
  lb: {
    flag: "./images/waving-flags/lebanon-flag-gif.gif",
    countryName: {
      ar: "لبنان",
      ch: "黎巴嫩",
    },
    geo: {
      map: "./images/maps/lb.svg",
      title: {
        ar: "الموقع الجغرافي",
        ch: "地理位置",
      },
      content: {
        ar: "تقع في جنوب غرب قارة آسيا على الساحل الشرقي للبحر الأبيض المتوسط. يحدها من الشرق والشمال سوريا، ومن الجنوب فلسطين، ومن الغرب البحر الأبيض المتوسط. تبلغ مساحتها 10,452 كيلومترًا مربعًا، ويبلغ طول ساحلها 220 كيلومترًا. يتميز الساحل بصيف حار ورطب وشتاء دافئ. تنقسم تضاريس لبنان إلى السهل الساحلي، وجبال لبنان شرق الساحل، وسهل البقاع الذي يقع شرق جبال لبنان، وجبال لبنان الشرقية.",
        ch: "位于亚洲西南部地中海东岸。东、北部邻叙利亚，南界巴勒斯坦，西濒地中海。国土面积10452平方公里，海岸线长220公里。沿海夏季炎热潮湿，冬季温暖。黎巴嫩全境按地形可分为沿海平原、沿海平原东侧的黎巴嫩山地、黎巴嫩山东侧的贝卡谷地和东部的黎巴嫩山。",
      },
      popover: {
        ar: [],
        ch: [],
      },
    },
    economy: {
      title: {
        ar: "الموارد الطبيعية و مصادر الدخل",
        ch: "自然资源与收入来源",
      },
      content: {
        ar: [
          {
            icon: "./images/gold.png",
            title: "الموارد الطبيعية",
            text: "تمتلك لبنان موارد غنية من الحجر الجيري والرخام. يُستخدم الحجر الجيري على نطاق واسع في مواد البناء والمواد الخام للصناعات الكيميائية، أما الرخام، لما يتمتع به من جمال ومتانة، فهو يحظى بإقبال كبير في الأسواق، ويوفّر دعمًا مهمًا لقطاعي البناء والصناعة.",
          },
          {
            icon: "./images/travel-and-tourism.png",
            title: "السياحة",
            text: "تتمتع لبنان بتراث تاريخي وثقافي غني ومناظر طبيعية ساحرة، مما يوفر ظروفًا فريدة لتنمية السياحة. تجذب المواقع التاريخية مثل الآثار الرومانية القديمة في بيروت، والمعابد الرائعة في بعلبك، ومدينة صور الفينيقية القديمة العديد من عشاق التاريخ والثقافة. كما تجذب الشواطئ الساحلية الجميلة والمناظر الطبيعية للجبال والمناخ المتوسطي الفريد أيضًا عددًا كبيرًا من السياح الباحثين عن الترفيه والعطلات. لقد أدى تطور السياحة إلى ازدهار الصناعات ذات الصلة مثل الفنادق والمطاعم والنقل.",
          },
        ],
        ch: [
          {
            icon: "./images/gold.png",
            title: "自然资源",
            text: "石灰石和大理石资源丰富，石灰石广泛用于建筑材料和化工原料，大理石因美观耐用受市场青睐，为建筑业和制造业提供重要支持。",
          },
          {
            icon: "./images/travel-and-tourism.png",
            title: "旅游业",
            text: "黎巴嫩拥有丰富的历史文化遗产和迷人的自然风光，为旅游业发展提供了得天独厚的条件 。贝鲁特的古罗马遗址、巴勒贝克的宏伟神庙、提尔的腓尼基古城等历史遗迹，吸引着众多历史文化爱好者 。沿海的美丽海滩、山区的自然风光以及独特的地中海气候，也吸引了大量休闲度假游客 。旅游业的发展带动了酒店、餐饮、交通等相关产业的繁荣 。",
          },
        ],
      },
    },
    cities: {
      title: {
        ar: "العاصمة و الوجهات السياحية",
        ch: "首都与旅游地",
      },
      content: {
        ar: [
          {
            img: "./images/lb/Beirut.jpeg",
            title: "بيروت",
            description:
              "بيروت هي عاصمة لبنان وأكبر مدينة ساحلية على الضفة الشرقية للبحر الأبيض المتوسط. وتُعرف بيروت بجمال طرازها المعماري ومناخها المميز، حتى أنها تُلقب بـ'باريس الشرق الأوسط'.",
          },
          {
            img: "./images/lb/Beirut-Museum.jpeg",
            title: "متحف بيروت الوطني",
            description:
              "يضم متحف بيروت الوطني مجموعة كبيرة من الآثار التي تعكس تاريخ وثقافة لبنان، حيث يعرض تطور الحضارات من العصور القديمة إلى الفنون الحديثة.",
          },
          {
            img: "./images/lb/Baalbek-Temple.jpeg",
            title: "معبد بعلبك",
            description:
              "معبد بعلبك من أشهر المعالم الأثرية في لبنان، يقع في سفوح سهل البقاع على بعد أكثر من 80 كيلومترًا شمال شرق بيروت، وعلى ارتفاع نحو 1160 مترًا فوق سطح البحر. 'بعلبك' تعني 'أرض الشمس'، وقد بنى الفينيقيون هذا المعبد قبل أكثر من 2000 عام لعبادة إله الشمس 'بعل'، مما جعله مركزًا هامًا للعبادة.",
          },
        ],
        ch: [
          {
            img: "./images/lb/Beirut.jpeg",
            title: "贝鲁特",
            description:
              "贝鲁特是黎巴嫩的首都，地中海东岸最大的港口城市。贝鲁特，凭借独特的建筑风格与气候环境，又有'中东小巴黎'之美誉。",
          },
          {
            img: "./images/lb/Beirut-Museum.jpeg",
            title: "贝鲁特国家博物馆",
            description:
              "贝鲁特国家博物馆，收藏了大量反映黎巴嫩历史和文化的文物，展示了从古代文明到现代艺术的发展历程 。",
          },
          {
            img: "./images/lb/Baalbek-Temple.jpeg",
            title: "巴勒贝克神庙",
            description:
              "巴勒贝克神庙是黎巴嫩著名古迹，位于黎巴嫩贝卡谷地外山麓，贝鲁特东北80 多公里，海拔约1160 米。'巴勒贝克'意为'太阳之域'。公元前2000 多年腓尼基人崇拜太阳神巴勒修建这座神庙，使之成为祭祀中心。",
          },
        ],
      },
    },
    recipies: {
      title: {
        ar: "الأطباق المميزة",
        ch: "特色菜",
      },
      content: {
        ar: [
          {
            img: "./images/lb/Tabbouleh.jpeg",
            title: "التبولة",
            description:
              "هي نوع من السلطات التي تعتمد بشكل رئيسي على الخضروات والحبوب. تتكوّن من البرغل المجروش، والطماطم، والخيار، والبصل، والبقدونس، والنعناع، وتُتبل بعصير الليمون وزيت الزيتون والملح. تُقدّم التبولة عادةً كطبق جانبي في المطبخ اللبناني، مع أطباق المشاوي وغيرها من الأطباق الرئيسية.",
          },
          {
            img: "./images/lb/Kibbeh.jpeg",
            title: "الكبة",
            description:
              "تعتبر الكبة واحدة من الأطباق التقليدية في لبنان، وتتوفر بأشكال متعددة.عادةً تُحضَّر من خليط البرغل الناعم واللحم المفروم، مع إضافة البصل والنعناع والقرفة، ويتم تشكيلها إلى كرات أو أقراص، ثم تُطهى بالقلي أو الخبز أو السلق.",
          },
          {
            img: "./images/lb/Fattoush.jpeg",
            title: "الفتوش",
            description:
              "الفتوش سلطة لبنانية تقليدية تجمع بين الخضروات الطازجة وقطع خبز البيتا المحمص، وتُتبّل بزيت الزيتون وعصير الليمون. تتميز بطعمها المنعش وتُعتبر من المقبلات المحببة في لبنان والشرق الأوسط.",
          },
        ],
        ch: [
          {
            img: "./images/lb/Tabbouleh.jpeg",
            title: "塔博勒沙拉",
            description:
              "一种以蔬菜和谷物为主的沙拉 。主要原料有碾碎的干小麦、番茄、黄瓜、洋葱、欧芹、薄荷等，再加入柠檬汁、橄榄油和盐等调料拌匀 。它在黎巴嫩饮食中常作为配菜，与烤肉等主菜搭配食用",
          },
          {
            img: "./images/lb/Kibbeh.jpeg",
            title: "基布贝",
            description:
              "黎巴嫩的传统美食之一，有多种形式 。常见的一种是将碎小麦和碎羊肉混合，加入洋葱、薄荷、肉桂等香料，制成球状或饼状，可油炸、烘焙或水煮",
          },
          {
            img: "./images/lb/Fattoush.jpeg",
            title: "法图什",
            description:
              "法图什是一种黎巴嫩传统沙拉，由新鲜蔬菜如生菜、黄瓜、西红柿、萝卜与烤皮塔面包混合制成，再搭配橄榄油和柠檬汁调味。它口感清爽，酸香可口，是黎巴嫩及中东地区非常受欢迎的开胃菜之一。",
          },
        ],
      },
    },
  },
  sa: {
    flag: "./images/waving-flags/saudi-arabia-flag-gif.gif",
    countryName: {
      ar: "المملكة العربية السعودية",
      ch: "沙特阿拉伯",
    },
    geo: {
      map: "./images/maps/sa.svg",
      title: {
        ar: "الموقع الجغرافي",
        ch: "地理位置",
      },
      content: {
        ar: "تقع المملكة العربية السعودية في شبه الجزيرة العربية في جنوب غرب آسيا. وهي أكبر دولة في شبه الجزيرة العربية، حيث تبلغ مساحتها الإجمالية 2.25 مليون كيلومتر مربع. وتحتل حوالي 80% من مساحة شبه الجزيرة. يحدها من الغرب البحر الأحمر بساحل يبلغ طوله نحو 1800 كيلومتر، ومن الشرق الخليج العربي بساحل يبلغ طوله نحو 610 كيلومتر. يحدها من الشمال الكويت والعراق والأردن، ومن الجنوب عمان واليمن، ومن الجنوب الشرقي قطر والإمارات العربية المتحدة. تتمتع معظم المناطق بمناخ صحراوي استوائي.",
        ch: "沙特阿拉伯位于亚洲西南部的阿拉伯半岛,是阿拉伯半岛最大的国家，国土总面积达 225 万平方千米。占据该半岛约80%的土地面积。西临红海，海岸线长达约 1800 千米，东阿拉伯湾，海岸线长约 610 千米。北与科威特、伊拉克和约旦接壤,南与阿曼和也门相邻,东南则与卡塔尔及阿联酋。大部分地区属热带沙漠气候。",
      },
      popover: {
        ar: [],
        ch: [],
      },
    },
    economy: {
      title: {
        ar: "الموارد الطبيعية و مصادر الدخل",
        ch: "自然资源与收入来源",
      },
      content: {
        ar: [
          {
            icon: "./images/gold.png",
            title: "الموارد الطبيعية",
            text: "تبلغ احتياطات النفط في السعودية 297.6 مليار برميل، مما يجعلها تحتل المرتبة الثانية عالميًا. كما تبلغ احتياطيات الغاز الطبيعي حوالي 9.23 تريليون متر مكعب، وتأتي في المرتبة السادسة عالميًا. فبالإضافة إلى ثروتها من النفط والغاز، تمتلك السعودية أكثر من 30 نوعًا من المعادن مثل الذهب والنحاس والحديد والقصدير والألمنيوم والزنك.",
          },
          {
            icon: "./images/icons/oil-barrel.png",
            title: "النفط والغاز الطبيعي",
            text: "يُعد النفط وصناعة البتروكيماويات العمود الفقري للاقتصاد السعودي. إذ تملك السعودية احتياطات نفطية مؤكدة تبلغ 297.6 مليار برميل، أي ما يعادل نحو 17.85% من إجمالي الاحتياطات العالمية، كما تبلغ احتياطيات الغاز الطبيعي المؤكدة ما يعادل 9.23 تريليون متر مكعب، وهو ما يمثل نحو 4.6% من الاحتياطات العالمية، وتحتل بذلك المرتبة السادسة عالميًا.",
          },
          {
            icon: "./images/travel-and-tourism.png",
            title: "السياحة",
            text: "تتمتع المملكة العربية السعودية بتراث تاريخي وثقافي غني ومناظر طبيعية مميزة، وقد شهد قطاع السياحة تطورًا ملحوظًا في السنوات الأخيرة. وتعد المدينتان المقدستان، مكة المكرمة والمدينة المنورة، من أهم الوجهات الدينية في العالم، حيث تستقبلان سنويًا ملايين الحجاج والمعتمرين من مختلف أنحاء العالم الإسلامي.",
          },
        ],
        ch: [
          {
            icon: "./images/gold.png",
            title: "自然资源",
            text: "沙特已探明石油储量为2976亿桶，居世界第二位；天然气储量9.23万亿立方米，居世界第六位。除丰富的油气资源外，沙特有金、铜、铁、锡、铝、锌等30多种金属矿藏。",
          },
          {
            icon: "./images/icons/oil-barrel.png",
            title: "石油与天然气产业",
            text: "石油和石化工业是沙特的经济命脉。沙特已探明石油储量2976亿桶，居全球第二位，约占全球总储量的17.85%，石油产业产值占GDP比重接近一半。已探明天然气储量9.23万亿立方米，居全球第六位，约占全球总储量的4.6%。",
          },
          {
            icon: "./images/fishermen.png",
            title: "旅游业",
            text: "沙特阿拉伯有着丰富的历史文化遗产和独特的自然景观，近年来大力发展旅游业。伊斯兰教圣地麦加和麦地那每年吸引着大量来自世界各地的穆斯林朝圣者。",
          },
        ],
      },
    },
    cities: {
      title: {
        ar: "العاصمة و الوجهات السياحية",
        ch: "首都与旅游地",
      },
      content: {
        ar: [
          {
            img: "./images/sa/Riyadh.jpeg",
            title: "الرياض",
            description:
              "الرياض هي عاصمة المملكة العربية السعودية وأكبر مدنها. كما أنها المركز السياسي والاقتصادي والثقافي والنقل الرئيسي للبلاد. يتميز الطراز المعماري في المدينة بتنوعه، حيث تضم مباني حديثة شاهقة مثل برج المملكة الذي يبلغ ارتفاعه 302 متر، ويُعد من أبرز معالم الرياض.",
          },
          {
            img: "./images/sa/Mekkah.jpeg",
            title: "مكة المكرمة",
            description:
              "تقع مكة المكرمة غرب المملكة العربية السعودية. تتمتع مكة بمكانة دينية عظيمة لدى المسلمين حول العالم، إذ يتوجه إليها ملايين الحجاج سنويًا لأداء مناسك الحج. وتُعد المسجد الحرام في مكة أكبر مسجد في العالم.",
          },
          {
            img: "./images/sa/kingdom-tower.jpeg",
            title: "برج المملكة",
            description:
              "برج المملكة هو ناطحة سحاب تجارية تقع في العاصمة السعودية الرياض، ويُعد من أبرز معالم المدينة العمرانية والمعمارية. يبلغ ارتفاع برج المملكة 300 متر، ويمكن للزوار الصعود إلى الجسر العلوي في قمته للاستمتاع بإطلالة بانورامية على المدينة من خلال الواجهات الزجاجية على الجانبين.",
          },
        ],
        ch: [
          {
            img: "./images/sa/Riyadh.jpeg",
            title: "利雅得",
            description:
              "利雅得是沙特阿拉伯的首都，也是全国第一大城市，也是沙特阿拉伯的政治、经济、文化和交通中心。城市建筑风格多样，既有现代化的高楼大厦，如王国塔，高达 300 米，是利雅得的地标性建筑。",
          },
          {
            img: "./images/sa/Mekkah.jpeg",
            title: "麦加",
            description:
              "麦加位于沙特阿拉伯西部。麦加对于全球穆斯林来说具有极其重要的宗教意义，每年都有大量穆斯林前往麦加朝觐。麦加大清真寺是世界上最大的清真寺。",
          },
          {
            img: "./images/sa/kingdom-tower.jpeg",
            title: "王国塔",
            description:
              "王国塔是一座商业摩天大楼，位于沙特阿拉伯王国首都利雅得。是利雅得的城市和建筑地标之一。王国塔高 300 米，游客可前往大楼顶端的廊桥，透过两侧的玻璃幕墙欣赏全景景致。",
          },
        ],
      },
    },
    recipies: {
      title: {
        ar: "الأطباق المميزة",
        ch: "特色菜",
      },
      content: {
        ar: [
          {
            img: "./images/sa/kabsa.jpeg",
            title: "الكبسة",
            description:
              "الكبسة هي من أشهر الأطباق التقليدية في السعودية، وتُعتبر أيضًا الطبق الوطني. تتكون من الأرز والدجاج المطهو مع مجموعة من التوابل، وأحيانًا يُستخدم لحم البقر أو الغنم بدلًا من الدجاج. غالبًا ما يُضاف إلى الأرز زبيب أو لوز محمص أو صنوبر، وتُقدم الكبسة مع صلصة الطماطم الحارة أو صلصة الفلفل الحار، مما يمنحها نكهة مميزة.",
          },
          {
            img: "./images/sa/Saleeg.png",
            title: "السليق",
            description:
              "السلق هو طبق تقليدي يتكون من الدجاج المطهو مع مزيج شهي من التوابل، ويُقدَّم فوق أرز. يتم طهي الأرز في شوربة الدجاج، مما يمنحه نكهة غنية. وفي النهاية، يُضاف الحليب الكامل الدسم والزبدة أو السمن إلى الأرز، ليمنحه قوام ناعم وطعم كريمي لذيذ.",
          },
          {
            img: "./images/sa/mutabbaq.jpeg",
            title: "المطبق",
            description:
              "المطبّق هو نوع الفطائراللذيذة . يتم فرد طبقة من حشوة اللحم المفروم والبصل والبيض ومجموعة من التوابل على العجين بشكل متساوي. يتميز المطبّق بمذاقه الغني؛ فالطبقة الخارجية مقرمشة و الحشوة الداخلية طرية وغنية.",
          },
        ],
        ch: [
          {
            img: "./images/sa/kabsa.jpeg",
            title: "卡布萨",
            description:
              "卡布萨是沙特著名的传统美食，也被认为是国菜。它由米饭和用多种香料烹调的鸡肉组成，有时也用牛肉或羊肉代替。饭中常加入葡萄干、烤杏仁或松子，搭配辣番茄酱或辣椒酱，风味独特。",
          },
          {
            img: "./images/sa/Saleeg.png",
            title: "赛利格",
            description:
              "赛利格的主要成分是用美味的香料混合烹制的鸡肉，并放在香米上。米饭是在鸡汤中烹制的，鸡汤赋予米饭美味浓郁的味道，最后用全脂牛奶和黄油或酥油制成，使米饭具有柔软、奶油般的口感。",
          },
          {
            img: "./images/sa/mutabbaq.jpeg",
            title: "穆塔巴克",
            description:
              "穆塔巴克是一种美味的薄饼。在面饼上均匀地铺上一层由碎肉、洋葱、鸡蛋以及各种香料调制而成的馅料。穆塔巴克口感丰富，外皮酥脆，内部的馅料鲜嫩多汁。",
          },
        ],
      },
    },
  },
  jo: {
    flag: "./images/waving-flags/jordan-flag-gif.gif",
    countryName: {
      ar: "الأردن",
      ch: "约旦",
    },
    geo: {
      map: "./images/maps/jo.svg",
      title: {
        ar: "الموقع الجغرافي",
        ch: "地理位置",
      },
      content: {
        ar: "تقع الأردن في غرب قارة آسيا، شمال غرب شبه الجزيرة العربية. تبلغ مساحتها حوالي 89,300 كيلومتر مربع. تحدها فلسطين من الغرب، وسوريا من الشمال، والعراق من الشمال الشرقي، والمملكة العربية السعودية من الجنوب والجنوب الشرقي. تقع الصحراء في شرق وجنوب شرق البلاد، وتغطي نحو 78٪ من المساحة الإجمالية. يسود البلاد مناخ صحراوي حار.وتعتمد الأردن بشكل رئيسي على نهر الاردن كمصدر رئيسي للمياه",
        ch: "约旦位于亚洲西部，阿拉伯半岛西北部。国土面积8.93万平方公里。约旦西邻巴勒斯坦，北接叙利亚，东北与伊拉克接壤，东南部与沙特阿拉伯相接。东部和东南部为沙漠，占全国面积的78%。约旦气候类型主要为热带沙漠气候。约旦主要依赖约旦河作为水源。",
      },
      popover: {
        ar: [],
        ch: [],
      },
    },
    economy: {
      title: {
        ar: "الموارد الطبيعية و مصادر الدخل",
        ch: "自然资源与收入来源",
      },
      content: {
        ar: [
          {
            icon: "./images/fishermen.png",
            title: "السياحة",
            text: "تعد السياحة أحد الركائز الاقتصادية المهمة في الأردن.تتمتع الأردن بتراث تاريخي وثقافي غني ومناظر طبيعية فريدة، مما يجذب عدد كبير من السياح المحليين والأجانب.مدينة البتراء القديمة هي واحدة من أشهر المواقع السياحية في الأردن، تقع في الصحراء جنوب الأردن، وتُعد مدينة غامضة من العصور القديمة فمعظم مباني المدينة منحوتة في الصخور. مثل معبد الخزنة الشهير، ويجذب طرازه المعماري الرائع وتاريخه الفريد أعدادًا هائلة من الزوار. مثل معبد الخزنة. فبسبب الأسلوب المعماري المذهل والخلفية التاريخية الفريدة جذب عددًا لا يحصى من السياح.",
          },
          {
            icon: "./images/gold.png",
            title: "الموارد الطبيعية",
            text: "الموارد الطبيعية في الأردن محدودة نسبيًا، وتتمثل بشكل رئيسي في الصخر الزيتي، الفوسفات، والبوتاس. حيث ان احتياطيات الصخر الزيتي وفيرة.",
          },
        ],
        ch: [
          {
            icon: "./images/fishermen.png",
            title: "旅游业",
            text: "旅游业是约旦重要的经济支柱之一。约旦拥有丰富的历史文化遗产和独特的自然景观，吸引着大量国内外游客。佩特拉古城是约旦最著名的旅游景点之一，是约旦南部沙漠中的神秘古城，古城中的建筑大多是在岩石上雕刻而成，如卡兹尼神殿，其壮观的建筑风格和独特的历史背景吸引了无数游客。",
          },
          {
            icon: "./images/gold.png",
            title: "自然资源",
            text: "约旦自然资源相对匮乏，主要矿产为油页岩、磷酸盐、钾盐。约旦油页岩储量丰富",
          },
        ],
      },
    },
    cities: {
      title: {
        ar: "العاصمة و الوجهات السياحية",
        ch: "首都与旅游地",
      },
      content: {
        ar: [
          {
            img: "./images/jo/Amman.jpg",
            title: "عمّان",
            description:
              "تقع عمّان عاصمة الأردن شمال . تُعد مدينة جبلية ذات تاريخ عريق، بنيت على سبعة تلال. تتميز بمناخ معتدل ومناظر طبيعية جميلة، وتجمع بين الطابع التقليدي والحديث. كما تُعد أكبر مدن الأردن والمركز الأقتصادي والثقافي والإداري للبلاد.",
          },
          {
            img: "./images/jo/Petra.jpg",
            title: "مدينة البتراء القديمة",
            description:
              "مدينة البتراء القديمة هي واحدة من أشهر المواقع السياحية في الأردن، تقع في صحراء جنوب الأردن، وتُعد مدينة غامضة من العصور القديمة معظم مباني المدينة منحوتة في الصخور. مثل معبد الخزنة الشهير، ويجذب طرازه المعماري الرائع وتاريخه الفريد أعدادًا هائلة من الزوار.",
          },
          {
            img: "./images/jo/Jerash.jpg",
            title: "مدينة جرش",
            description:
              "تقع مدينة جرش شمال الأردن، على بُعد نحو 48 كيلومترًا من عمّان، وهي من أكبر وأفضل المدن الرومانية القديمة المحفوظة في العالم.",
          },
        ],
        ch: [
          {
            img: "./images/jo/Amman.jpg",
            title: "安曼",
            description:
              "安曼约旦首都，位于约旦北部。是一座历史悠久的山城，坐落在7个山头之上。安曼气候宜人，景色秀丽，是一座融传统与现代为一体的城市。也是全国最大的城市和经济、文化、交通中心。",
          },
          {
            img: "./images/jo/Petra.jpg",
            title: "佩特拉古城",
            description:
              "佩特拉古城是约旦最著名的旅游景点之一，是约旦南部沙漠中的神秘古城，古城中的建筑大多是在岩石上雕刻而成，如卡兹尼神殿，其壮观的建筑风格和独特的历史背景吸引了无数游客。",
          },
          {
            img: "./images/jo/Jerash.jpg",
            title: "杰拉什古城",
            description:
              "杰拉什古城 位于约旦北部，距离安曼约 48 公里，是世界上保存最完好、规模最大的古罗马城市遗址之一。",
          },
        ],
      },
    },
    recipies: {
      title: {
        ar: "الأطباق المميزة",
        ch: "特色菜",
      },
      content: {
        ar: [
          {
            img: "./images/jo/Mansaf.jpg",
            title: "المنسف",
            description:
              "المنسف هو الطبق الوطني في الأردن، ويُعد من أشهر الأطباق التقليدية في البلاد. يتكون من لحم الضأن، حيث يُنقع اللحم في اللبن/الزبادي مع مجموعة متنوعة من التوابل، ثم يُطهى حتى يصبح طريًا. يُقدَّم فوق خبز أو الأرز، وغالبًا ما يُطهى الأرز في شوربة اللحم والتوابل ليكتسب نكهة غنية من لحم الضأن.",
          },
          {
            img: "./images/jo/Maqlooba.jpg",
            title: "المقلوبة",
            description:
              "المقلوبة معناها الحرفي رأسًا على عقب، وهو طبق يُرتّب فيه الخضروات واللحم والأرز في طبقات داخل القدر، وبعد طهيه يُقلَب القدر ليخرج الطبق على شكل طبقات مرتبة. يُقدَّم عادةً مع السلطة.",
          },
          {
            img: "./images/jo/Kebab.jpg",
            title: "الكباب",
            description:
              "الكباب هو لحم مشوي يتكوّن من قطع الدجاج أو اللحم البقري أو الضأن، وغالبًا ما يتكون من اللحوم مفرومة ومتبّلة. يُقدَّم مع طماطم وبصل مشويَّين، ويتميّز بطعمه الشهي ورائحته المميّزة.",
          },
        ],
        ch: [
          {
            img: "./images/jo/Mansaf.jpg",
            title: "曼萨夫",
            description:
              "约旦的国菜，是一道极具代表性的传统美食。主要食材是羊肉，将羊肉用酸奶和多种香料腌制后，炖煮至软烂。搭配的主食是阿拉伯烤饼或米饭，米饭通常会用肉汤和香料煮熟，吸收了羊肉的香味。",
          },
          {
            img: "./images/jo/Maqlooba.jpg",
            title: "颠倒米饭",
            description:
              "颠倒米饭的原意是上下颠倒，这道菜烹饪时把蔬菜、肉、米分层放在锅中，熟了之后将锅小心地颠倒倒出，使其看起来是层状的，食用时配上沙拉。",
          },
          {
            img: "./images/jo/Kebab.jpg",
            title: "烤肉",
            description:
              "烤肉是把烤制的鸡肉块、牛肉块和羊肉（搅碎和调制过的肉末）拼在一起，再配以烤西红柿、烤洋葱，味道还是很不错的。",
          },
        ],
      },
    },
  },
  kw: {
    flag: "./images/waving-flags/kuwait-flag-gif.gif",
    countryName: {
      ar: "الكويت",
      ch: "科威特",
    },
    geo: {
      map: "./images/maps/kw.svg",
      title: {
        ar: "الموقع الجغرافي",
        ch: "地理位置",
      },
      content: {
        ar: "تقع الكويت غرب قارة آسيا، شمال شرق شبه الجزيرة العربية، على الساحل الشمالي الغربي للخليج العربي. تحدها العراق من الشمال والغرب، والمملكة العربية السعودية من الجنوب. تبلغ مساحتها حوالي 17,818 كيلومتر مربع، ويبلغ طول سواحلها حوالي 500 كيلومترًا. تتمتع البلاد بمناخ صحراوي حار. التضاريس بشكل عام مسطحة، حيث يكون الغرب مرتفعًا والشرق منخفضًا، والجزء الشمالي الشرقي عبارة عن سهول، والمناطق الأخرى صحراء مع تلال وأراض منخفضة متوزعة. لا توجد أنهار أو بحيرات دائمة المياه في البلاد،، وتعتمد بشكل رئيسي على تحلية مياه البحر وإمدادات المياه الجوفية.",
        ch: "科威特国位于亚洲西部，阿拉伯半岛东北部，阿拉伯湾西北岸。北、西与伊拉克接壤，南与沙特阿拉伯相邻。面积约为17,818平方公里，海岸线长约500公里，属于热带沙漠气候。大部分地势平坦，西高东低，东北部为平原，其余地区主要为沙漠，间有丘陵和洼地分布。​境内无常年有水的河流和湖泊，主要依赖海水淡化和地下水供给。",
      },
      popover: {
        ar: [],
        ch: [],
      },
    },
    economy: {
      title: {
        ar: "الموارد الطبيعية و مصادر الدخل",
        ch: "自然资源与收入来源",
      },
      content: {
        ar: [
          {
            icon: "./images/gold.png",
            title: "الموارد الطبيعية",
            text: "تتمتع الكويت بثروة كبيرة من موارد النفط والغاز. وتبلغ احتياطيات النفط في البلاد 14 مليار طن، لتحتل المرتبة السابعة عالمياً. احتياطيات الغاز الطبيعي تبلغ 1.78 تريليون متر مكعب، لتحتل المرتبة 18 في العالم. يشكل استخراج وتصدير موارد النفط والغاز جزءاً كبيراً من اقتصاد الكويت، ويشكلان مصدراً مهماً للثروة الوطنية.",
          },
          {
            icon: "./images/fishermen.png",
            title: "الثروة السمكية",
            text: "تطل الكويت على الخليج العربي، و لهذا تتمتع بثروة سمكية لها دور معين في اقتصادها.تحتوي مياه الخليج العربي على أنواع متعددة من الأسماك مثل الهامور، والشعري، والجمبري.",
          },
          {
            icon: "./images/planting.png",
            title: "السياحة",
            text: "تتميّز الكويت بطبيعتها المتنوعة، حيث تتداخل المباني الحديثة مع العمارة العربية التقليدية في العاصمة الكويت. كما تُعرف بشواطئها الجميلة ومناظرها الصحراوية.وقد أسهم تطور قطاع السياحة في ازدهار قطاعات أخرى مثل الفنادق والمطاعم والمواصلات،مما أضاف بُعدًا جديدًا للاقتصاد الكويتي.",
          },
        ],
        ch: [
          {
            icon: "./images/gold.png",
            title: "自然资源",
            text: "科威特油气资源极其丰富。石油储量达 140 亿吨，居世界第七位。天然气储量 1.78 万亿立方米，居世界第十八位。油气资源的开采和出口在科威特经济中占据主导地位，是国家财富的重要来源。",
          },
          {
            icon: "./images/fishermen.png",
            title: "渔业资源",
            text: "科威特濒临阿拉伯湾，渔业资源在其经济中也有一定体现。波斯湾海域有多种鱼类，如石斑鱼、鲷鱼、对虾等。",
          },
          {
            icon: "./images/planting.png",
            title: "旅游业",
            text: "科威特拥有独特自然景观。科威特城有众多现代化建筑与传统阿拉伯建筑交相辉映。此外，科威特还有美丽的海滩、沙漠景观等。旅游业的发展带动了酒店、餐饮、交通等相关产业的繁荣，成为科威特经济新的增长点。",
          },
        ],
      },
    },
    cities: {
      title: {
        ar: "العاصمة و الوجهات السياحية",
        ch: "首都与旅游地",
      },
      content: {
        ar: [
          {
            img: "./images/kw/Kuwait-City.jpg",
            title: "مدينة الكويت",
            description:
              'مدينة الكويت هي عاصمة دولة الكويت والمركز السياسي والاقتصادي والثقافي للبلاد. تتميز بتاريخها العريق، كما أنها"مدينة تدمج بين النمط المعماري المعاصر والملامح الثقافية التقليدية . تنتشر فيها ناطحات السحاب الحديثة، وتُعد أبراج الكويت من أبرز معالمها .',
          },
          {
            img: "./images/kw/Kuwait-Towers.jpg",
            title: "أبراج الكويت",
            description:
              "تُعد أبراج الكويت من رموز المدينة ، وتتكوّن من ثلاث أبراج، يُستخدم اثنان منها كخزانات للمياه، بينما يُخصَّص البرج الثالث كمركز للمراقبة. يمكن للزوار الصعود إلى برج المراقبة لمشاهدة المنظر البانورامي لمدينة الكويت والخليج العربي بمناظره الخلابة.",
          },
        ],
        ch: [
          {
            img: "./images/kw/Kuwait-City.jpg",
            title: "科威特城",
            description:
              "科威特城是科威特的首都，也是全国政治、经济、文化中心。科威特城历史悠久，也是一座现代化与传统相结合的城市。现代化的高楼大厦林立，其中科威特塔是城市的标志性建筑。",
          },
          {
            img: "./images/kw/Kuwait-Towers.jpg",
            title: "科威特塔",
            description:
              "科威特塔是城市的标志性建筑，科威特塔由三座塔组成，其中两座用作水塔，另一座为观景塔。游客可以登上观景塔，俯瞰科威特城的全貌和波斯湾的壮丽景色。",
          },
        ],
      },
    },
    recipies: {
      title: {
        ar: "الأطباق المميزة",
        ch: "特色菜",
      },
      content: {
        ar: [
          {
            img: "./images/kw/Majboos.jpg",
            title: "المجبوس",
            description:
              "يُعد المجبوس واحد من الأطباق التقليدية في الكويت، ويتكون من أرز مُتبّل، ولحوم مشوية، وخضروات، وصلصة مميزة. تُحضّر الصلصة عادةً من الطماطم والبصل والثوم والزنجبيل والكركم، ويُضاف إلى الطبق لحم الدجاج أو البقر أو الضأن أو حتى السمك حسب الرغبة.",
          },
          {
            img: "./images/kw/Harees.jpg",
            title: "الهريس",
            description:
              "الهريس هو أحد الأطباق التقليدية الشهيرة في الكويت، يُطهى ببطء من القمح المجروش مع لحم الدجاج أو الضأن، ويتميّز بقوامه الناعم وطعمه الغني، ويُقدَّم غالبًا خلال شهر رمضان أو في الأعياد.",
          },
          {
            img: "./images/kw/Arabic-Grills.jpg",
            title: "المشاوي العربية",
            description:
              "تُعد المشاوي من أكثر الأطباق شعبية في الكويت، حيث تُحضَّر من أنواع مختلفة من اللحوم مثل الضأن والدجاج والبقر، وتُتبّل بمجموعة متنوعة من التوابل ثم تُشوى. تُقدَّم غالبًا مع الأرز المبهر والسلطات",
          },
        ],
        ch: [
          {
            img: "./images/kw/Majboos.jpg",
            title: "马什布斯",
            description:
              "这是科威特的国菜之一，一道由香料米饭、烤肉、蔬菜和调味汁组成的菜肴。调味汁通常由番茄、洋葱、大蒜、姜和黄姜等香料制成。有些人会将鸡肉、牛肉、羊肉或鱼肉添加到这道菜中。",
          },
          {
            img: "./images/kw/Harees.jpg",
            title: "哈里斯粥",
            description:
              "哈里斯粥是一道传统的科威特美食，由碾碎的小麦与鸡肉或羊肉慢炖而成，口感细腻浓郁，常在斋月或节日期间享用。",
          },
          {
            img: "./images/kw/Arabic-Grills.jpg",
            title: "阿拉伯烤肉",
            description:
              "这是科威特最受欢迎的美食之一，采用各种肉类，如羊肉、鸡肉和牛肉，配以多种香料烤制而成。通常搭配香气扑鼻的米饭和沙拉一起食用。",
          },
        ],
      },
    },
  },
  pa: {
    flag: "./images/waving-flags/palestine-flag.gif",
    countryName: {
      ar: "فلسطين",
      ch: "巴勒斯坦",
    },
    geo: {
      map: "./images/maps/pa.svg",
      title: {
        ar: "الموقع الجغرافي",
        ch: "地理位置",
      },
      content: {
        ar: "تقع فلسطين غرب قارة آسيا، على الساحل الشرقي للبحر الأبيض المتوسط، تتمتع فلسطين بمناخ البحر المتوسط. تحدها من الشمال لبنان، ومن الشرق سوريا والأردن، ومن الجنوب الغربي مصر تقع فلسطين في نقطة تقاطع بين قارات أوروبا وآسيا وأفريقيا، مما جعل لها أهمية استراتيجية كبيرة.بسبب الصراع الفلسطيني الإسرائيلي ، لا تزال هناك العديد من النزاعات حول الحدود، والتي لم تُحدد بشكل كامل حتى الآن.",
        ch: "巴勒斯坦位于亚洲西部，地处地中海东岸，属于热带地中海式气候。北接黎巴嫩，东邻叙利亚和约旦，西南接埃及。处于欧、亚、非三洲交通的要冲，战略地位十分重要。巴勒斯坦属于热带地中海式气候。由于巴以冲突，巴勒斯坦与以色列在领土边界等方面存在诸多争议，其边界划分尚未完全确定。",
      },
      popover: {
        ar: [],
        ch: [],
      },
    },
    economy: {
      title: {
        ar: "الموارد الطبيعية و مصادر الدخل",
        ch: "自然资源与收入来源",
      },
      content: {
        ar: [
          {
            icon: "./images/planting.png",
            title: "الزراعة",
            text: "تشغل الزراعة جزءًا مهمًا في الاقتصاد الفلسطيني، حيث توفر صادرات المنتجات الزراعية جزءًا من الدخل الوطني،حيث تعد شجرة الزيتون من النباتات المميزة لفلسطين، ولها تاريخ طويل في زراعتها ، ويعد زيت الزيتون من المنتجات الزراعية الهامة والبضائع المصدرة.",
          },
          {
            icon: "./images/travel-and-tourism.png",
            title: "السياحة",
            text: "تتمتع فلسطين بتاريخ وثقافة عريقة ، وتُعد القدس من أشهر الأماكن الدينية في العالم، إذ تضم العديد من المواقع الدينية والتاريخية الهامة، ومن أشهرها المسجد الأقصى. ولا تقتصر أهميته على المسلمين فحسب، بل يجذب أيضًا الزوار من جميع أنحاء العالم. بالإضافة إلى ذلك، فإن شواطئ غزة المطلة على البحر الأبيض المتوسط تتميز بجمال طبيعتها، وتُعد مكانًا رائعًا للاسترخاء والاستمتاع بجمال الطبيعة.",
          },
        ],
        ch: [
          {
            icon: "./images/planting.png",
            title: "农业",
            text: "农业在巴勒斯坦经济中占有一定比重，农产品出口为国家带来了部分收入。橄榄树是巴勒斯坦具有代表性的植物，其种植历史悠久，橄榄油是重要的农产品和出口商品。",
          },
          {
            icon: "./images/travel-and-tourism.png",
            title: "旅游业",
            text: "巴勒斯坦拥有丰富的历史和文化，耶路撒冷是世界著名的宗教圣地，拥有许多重要的宗教和历史遗迹，其中最著名的是阿克萨清真寺。不仅对穆斯林具有重要意义，也吸引了世界各地的游客。还有加沙的地中海海滩风景优美，是放松和欣赏自然美景的好地方。",
          },
        ],
      },
    },
    cities: {
      title: {
        ar: "العاصمة و الوجهات السياحية",
        ch: "首都与旅游地",
      },
      content: {
        ar: [
          {
            img: "./images/pa/jerusalem.jpg",
            title: "القدس",
            description:
              "القدس هي عاصمة فلسطين ، تعد واحدة من أشهر المدن التاريخية والثقافية في العالم . تتمتع هذه المدينة بأهمية دينية كبرى لدى الديانات السماوية الثلاث: الإسلام والمسيحية واليهودية، حيث تضم العديد من المواقع الدينية الشهيرة مثل المسجد الأقصى وكنيسة القيامة.",
          },
          {
            img: "./images/pa/al-aqsa.jpg",
            title: "المسجد الأقصى",
            description:
              "المسجد الأقصى هو أحد الأماكن المقدسة في الإسلام، ويقع في البلدة القديمة في القدس. يتمتع المسجد بتاريخ عريق وطراز معماري فريد من نوعه. المسجد الأقصى لا بعد فقط مكانًا دينيًا، بل هو أيضًا رمز مهم في الثقافة الفلسطينية.",
          },
        ],
        ch: [
          {
            img: "./images/pa/jerusalem.jpg",
            title: "耶路撒冷",
            description:
              "耶路撒冷是巴勒斯坦的首都，也是世界著名的历史文化名城之一。这座城市对三大宗教都有重要意义：伊斯兰教、基督教和犹太教。拥有许多著名的宗教圣地，如阿克萨清真寺和圣墓教堂。",
          },
          {
            img: "./images/pa/al-aqsa.jpg",
            title: "阿克萨清真寺",
            description:
              "阿克萨清真寺是伊斯兰教的重要圣地之一，位于耶路撒冷老城。清真寺有着悠久的历史和独特的建筑风格。阿克萨清真寺不仅是宗教场所，也是巴勒斯坦文化重要象征。",
          },
        ],
      },
    },
    recipies: {
      title: {
        ar: "الأطباق المميزة",
        ch: "特色菜",
      },
      content: {
        ar: [
          {
            img: "./images/pa/musakhan.jpg",
            title: "المسخن",
            description:
              "المسخن من أشهر الأطباق التقليدية في فلسطين، ويُقدّم في التجمعات العائلية. يتكوّن من دجاج يُطهى بزيت الزيتون مع كميات كبيرة من البصل وتوابل مميزة مثل السماق،ثم يُوضع فوق طبقة من الخبز المُنقوع في شوربة الدجاج والبصل. يُزين الطبق بالصنوبر أو اللوز المحمّص، ثم يُخبز ليجمع بين قرمشة الخبز وطراوة الدجاج. يتميز بطعمه الغني ورائحته الزكية، ويُعتبر رمزًا من رموز المطبخ الفلسطيني الاصيل.",
          },
          {
            img: "./images/pa/maqluba.jpg",
            title: "المقلوبة",
            description:
              "المقلوبة هي أحد أشهر الأطباق التقليدية في فلسطين، وتتكوّن من طبقات من الأرز واللحم والخضروات والتوابل تُطهى معًا في قدر واحد، ثم تُقلب في طبق التقديم راساً على عقب ، ولهذا سُمّيت 'المقلوبة'. تُعد المقلوبة من الأكلات المحببة لدى الفلسطينيين، كما أنها تُعبّر عن الكرم ومهارة الطهي. تمتاز المقلوبة بنكهة غنية وقوام متنوع، فالأرز طريّ و منكه، واللحم طريّ، والخضروات تضيف لمسة منعشة، بينما تمنح التوابل مذاقًا عميقًا ومتوازنًا. وغالبًا ما تُقدّم المقلوبة مع السلطة.",
          },
          {
            img: "./images/pa/hummus.jpg",
            title: "الحمص",
            description:
              "الحمص هو نوع من المقبلات الكريمية الشهيرة في فلسطين، يُحضّر من الحمص المهروس ممزوجًا بطحينة السمسم وزيت الزيتون وعصير الليمون والثوم. يتميّز الحمص بقوامه الكريمي ونكهته المتوازنة والمنعشة، وهو من الأطعمة المحبوبة لدى الفلسطينيين. يُقدَّم الحمص عادة كمقبلات أو وجبة خفيفة، وغالبًا ما يُؤكل مع الخبز، أو يُقدَّم إلى جانب الخضروات الطازجة.",
          },
        ],
        ch: [
          {
            img: "./images/pa/musakhan.jpg",
            title: "穆萨汉",
            description:
              "穆萨汉是巴勒斯坦的国菜之一，也是一道非常适合家庭聚餐的菜肴。它是由用橄榄油、洋葱、盐肤木等香料煎炸的鸡肉，放在一层浸泡过鸡汤和洋葱汁的面包上，再撒上松子和杏仁，然后在烤箱中烘烤而成的。穆萨汉有着浓郁的香气和多层次的口感，鸡肉鲜嫩多汁，面包软硬适中，坚果增加了香脆感。",
          },
          {
            img: "./images/pa/maqluba.jpg",
            title: "马卡卢巴",
            description:
              "马卡卢巴是一种由米饭、肉类、蔬菜和香料层层堆叠在锅中烹制，然后倒扣在盘子上的菜肴，意思是'倒过来的'。它是巴勒斯坦人最喜爱的一道菜，也是一种展示厨艺和款待的方式。马卡卢巴有着丰富的口感和色彩，米饭软糯香甜，肉类嫩滑多汁，蔬菜清爽爽口，香料增添了层次感。马卡卢巴通常配以沙拉食用。",
          },
          {
            img: "./images/pa/hummus.jpg",
            title: "鹰嘴豆泥",
            description:
              "鹰嘴豆泥是一种由鹰嘴豆、芝麻酱、橄榄油、柠檬汁和大蒜等食材打成的浓稠酱料，是巴勒斯坦人非常喜欢的一种食物。它可以作为开胃菜、小吃或主食，通常与面包、蔬菜等搭配食用。",
          },
        ],
      },
    },
  },
  iq: {
    flag: "./images/waving-flags/iraq-flag-gif.gif",
    countryName: {
      ar: "العراق",
      ch: "伊拉克",
    },
    geo: {
      map: "./images/maps/iq.svg",
      title: {
        ar: "الموقع الجغرافي",
        ch: "地理位置",
      },
      content: {
        ar: "تقع العراق في جنوب غرب قارة آسيا، في شمال شرق شبه الجزيرة العربية. تحدها تركيا من الشمال، وإيران من الشرق، وسوريا والأردن من الغرب، والسعودية والكويت من الجنوب، ولها منفذ بحري على الخليج العربي من الجنوب الشرقي. يمر نهر دجلة والفرات من الشمال الغربي إلى الجنوب الشرقي في العراق. يبلغ طول ساحلها نحو 60 كيلومترًا تتمتع العراق بالمناخ الصحراوي الاستوائي باستثناء المناطق الجبلية في الشمال الشرقي.",
        ch: "伊拉克位于亚洲西南部，阿拉伯半岛东北部。北接土耳其，东临伊朗，西毗叙利亚、约旦，南接沙特、科威特，东南阿拉伯湾。幼发拉底河和底格里斯河自西北向东南流贯全境。海岸线长60千米。除东北部山区外，属热带沙漠气候。",
      },
      popover: {
        ar: [],
        ch: [],
      },
    },
    economy: {
      title: {
        ar: "الموارد الطبيعية و مصادر الدخل",
        ch: "自然资源与收入来源",
      },
      content: {
        ar: [
          {
            icon: "./images/gold.png",
            title: "الموارد الطبيعية",
            text: "يعد النفط من ابرز و اهم الموارد الطبيعية في العراق، إذ تُشكّل العمود الفقري للاقتصاد الوطني. حيث يبلغ احتياطي النفط المؤكد في العراق يتجاوز 143 مليار برميل، مما يجعلها في مرتبة متقدمة في الترتيب العالمي. وتتركّز أهم الحقول النفطية في محافظتي البصرة وكركوك. ويُعتمد على تصدير النفط كمصدر رئيسي للإيرادات العامة.",
          },
          {
            icon: "./images/planting.png",
            title: "الزراعة",
            text: "علي الرغم من ان معظم العراق تتمتع بالمناخ الجاف، إلا أن السهول الخصبة الواقعة في وادي الرافدين، والتي تغذيها شبكات الري من نهري دجلة والفرات، توفّر بيئة مناسبة للزراعة. تُقدّر مساحة الأراضي الزراعية بحوالي 12% من إجمالي مساحة البلاد، وتُنتج محاصيل أساسية مثل القمح والشعير والأرز.",
          },
          {
            icon: "./images/travel-and-tourism.png",
            title: "السياحة",
            text: "تمتلك العراق تراثًا حضاريًا عريقًا وطبيعة متنوعة وتُعد مدينة بابل الأثرية من أبرز المعالم التي تُجسد آثار مدينة بابل القديمة أحد أهم رموز الحضارة البابلية، حيث تُظهر بقاياها روعة تلك الحضارة القديمة.",
          },
        ],
        ch: [
          {
            icon: "./images/gold.png",
            title: "自然资源",
            text: "伊拉克的石油资源极为丰富，是其最重要的自然资源，伊拉克已探明石油储量超过 1430 亿桶，位居世界前列。其石油产区主要分布在巴士拉省、基尔库克省等地区。石油开采和出口在伊拉克经济中占据主导地位，是国家财政收入的主要来源。",
          },
          {
            icon: "./images/planting.png",
            title: "农业",
            text: "尽管伊拉克气候干旱，但在两河流域的冲积平原地区，凭借丰富的灌溉水源，农业资源具有一定优势。全国约 12% 的土地用于农业生产，主要农作物有小麦、大麦、水稻等。",
          },
          {
            icon: "./images/travel-and-tourism.png",
            title: "旅游业",
            text: "伊拉克拥有丰富的历史文化遗产和独特的自然景观。巴比伦古城是古代巴比伦文明的重要象征，其宏伟的建筑遗址见证了古代文明的辉煌。",
          },
        ],
      },
    },
    cities: {
      title: {
        ar: "العاصمة و الوجهات السياحية",
        ch: "首都与旅游地",
      },
      content: {
        ar: [
          {
            img: "./images/iq/baghdad.jpg",
            title: "بغداد",
            description:
              "بغداد هي عاصمة العراق، وتُعد من المدن التاريخية والثقافية البارزة في العالم الإسلامي. تقع في وسط العراق، وتمتد على ضفتي نهر دجلة. تُعد بغداد أكبر مدن العراق، وهي مركزه الاقتصادي والثقافي.",
          },
          {
            img: "./images/iq/hatra.jpg",
            title: "مدينة الحضر",
            description:
              "مدينة الحضر الأثرية تقع في شمال العراق، وكانت في الماضي مركزًا تجاريًا مهمًا. لا تزال تحتوي على العديد من المعابد والساحات التي حافظت على حالتها بشكل جيد. وتتميز هذه المعالم المعمارية بأسلوب فريد يمزج بين العناصر الإغريقية والرومانية والشرقية، مما يمنحها قيمة فنية مميزة.",
          },
        ],
        ch: [
          {
            img: "./images/iq/baghdad.jpg",
            title: "巴格达",
            description:
              "巴格达是伊拉克的首都，伊斯兰世界历史文化名城。位于伊拉克中部，横跨底格里斯河两岸。巴格达是伊拉克最大城市及经济文化中心，是全国政治、商业、交通中心。",
          },
          {
            img: "./images/iq/hatra.jpg",
            title: "哈特拉古城",
            description:
              "哈特拉古城是帕提亚王国时期的城市，位于伊拉克北部。这里曾是重要的贸易据点，留存有许多保存较为完好的神庙和广场等建筑遗迹，其建筑风格融合了希腊、罗马和东方元素，具有独特的艺术价值。",
          },
        ],
      },
    },
    recipies: {
      title: {
        ar: "الأطباق المميزة",
        ch: "特色菜",
      },
      content: {
        ar: [
          {
            img: "./images/iq/dolma.jpg",
            title: "الدولمة",
            description:
              "الدولمة هي طبق تقليدي يُحضَّر من أوراق العنب أو خضروات محشوة بالأرز واللحم المفروم. تُطهى ا بعد حشوها على نار هادئة حتى تنضج، وتتميّز بطعمها المتوازن الذي يجمع بين نكهة الخضار الطازجة واللحم المتبل. تُعتبر من الأكلات الأساسية على موائد العائلات العراقية.",
          },
          {
            img: "./images/iq/quzi.jpg",
            title: "القوزي",
            description:
              "القوزي هو طبق رئيسي غني ومشهور، يُحضَّر غالبًا في المناسبات والأعياد. يتكوّن من لحم الضأن أو الدجاج المطهو مع التوابل، ويُقدَّم فوق طبقات من الأرز المقلي مع المكسرات والزبيب. أحيانًا يُقدَّم معه مرق لحم غني، مما يمنح الطبق رائحة شهية وطعمًا لا يُقاوَم.",
          },
          {
            img: "./images/iq/masgouf.jpg",
            title: "المسكوف",
            description:
              "هو أحد أشهر الأطباق العراقية، يُحضّر من سمك الشبوط المشوي على نار مفتوحة بطريقة تقليدية، مع إضافة الليمون والتوابل. يتميّز بطعمه الطبيعي ورائحته الشهية، ويُقدَّم غالبًا مع الطماطم والبصل.",
          },
        ],
        ch: [
          {
            img: "./images/iq/dolma.jpg",
            title: "多尔玛",
            description:
              "多尔玛是一种将米饭和肉馅包裹在葡萄叶或蔬菜中的传统菜肴。制作时，先将葡萄叶焯水软化，再包入调味好的馅料，最后慢炖至熟。这种菜肴口感丰富，既有蔬菜的清香，又有肉馅的鲜美，是伊拉克家庭餐桌上的常客。",
          },
          {
            img: "./images/iq/quzi.jpg",
            title: "古斯",
            description:
              "古斯是一道丰盛的主食，常在节日或家庭聚会中出现。它由香料炖煮的羊肉或鸡肉与炒香的米饭、坚果和葡萄干层层叠加而成。有时还会搭配浓郁的肉汤，使整道菜肴香气四溢，令人垂涎。",
          },
          {
            img: "./images/iq/masgouf.jpg",
            title: "玛斯古夫",
            description:
              "玛斯古夫是伊拉克最具代表性的传统美食之一。通常选用鲤鱼，切开后涂上柠檬汁、盐和香料，然后在明火上慢慢烤制，有时会加入洋葱和番茄作为配料。",
          },
        ],
      },
    },
  },
  sy: {
    flag: "./images/waving-flags/syria-flag-gif.gif",
    countryName: {
      ar: "الجمهورية العربية السورية",
      ch: "阿拉伯叙利亚共和国",
    },
    geo: {
      map: "./images/maps/sy.svg",
      title: {
        ar: "الموقع الجغرافي",
        ch: "地理位置",
      },
      content: {
        ar: "تقع سوريا غرب من قارة آسيا، على الساحل الشرقي للبحر الأبيض المتوسط. تحدها تركيا من الشمال، والعراق من الجنوب الشرقي، والأردن من الجنوب، ولبنان وفلسطين من الجنوب الغربي. تبلغ مساحتها الإجمالية 185180 كيلومترًا مربعًا، وطول سواحلها 183 كيلومترًا. يتمتع شمال البلاد بمناخ البحر الأبيض المتوسط شبه الاستوائي، بينما يتمتع جنوبها بمناخ الصحراء الاستوائي.",
        ch: "叙利亚位于亚洲大陆西部，地中海东岸。北靠土耳其，东南邻伊拉克，南连约旦，西南与黎巴嫩、巴勒斯坦接壤。总面积185180平方千米，海岸线长183千米。北部地区属于亚热带地中海气候，南部地区属热带沙漠气候。",
      },
      popover: {
        ar: [],
        ch: [],
      },
    },
    economy: {
      title: {
        ar: "الموارد الطبيعية و مصادر الدخل",
        ch: "自然资源与收入来源",
      },
      content: {
        ar: [
          {
            icon: "./images/gold.png",
            title: "الموارد الطبيعية",
            text: "تتمتع سوريا بموارد غنية، بما في ذلك النفط والفوسفات والغاز الطبيعي وملح الصخور والأسفلت والفوسفات والذهب والنحاس والحديد.",
          },
          {
            icon: "./images/planting.png",
            title: "الزراعة",
            text: "تشمل الزراعة في سوريا محاصيل مثل القمح والشعير والذرة. سوريا هي واحدة من الدول المهمة في منطقة الشرق الأوسط في إنتاج القمح، الذي يعد المحصول الغذائي الأساسي، وتزرع مساحات كبيرة من الأراضي بهذه المحاصيل. كما تشتهر سوريا بإنتاج أنواع متعددة من الفواكه مثل العنب والتفاح والحمضيات والموز.",
          },
          {
            icon: "./images/travel-and-tourism.png",
            title: "السياحة",
            text: "تتمتع سوريا بشواطئ جميلة على البحر الأبيض المتوسط،. فالرمال ناعمة والمياه صافية، والجو مشمس، مما يجعلها مكانًا مثاليًا للاسترخاء والاستجمام. يمكن للزوار الاستمتاع بأشعة الشمس، السباحة، وركوب الأمواج، وغيرها من الأنشطة المائية.",
          },
        ],
        ch: [
          {
            icon: "./images/gold.png",
            title: "自然资源",
            text: "叙利亚资源丰富，主要有石油、磷酸盐、天然气、岩盐、沥青、磷灰石，铜、铁等。",
          },
          {
            icon: "./images/planting.png",
            title: "农业",
            text: "叙利亚主要有小麦、大麦、玉米等。是中东地区重要的小麦生产国之一，小麦是其主要的粮食作物，种植面积广泛。叙利亚也盛产各种水果，如葡萄、苹果、香蕉。",
          },
          {
            icon: "./images/travel-and-tourism.png",
            title: "旅游业",
            text: "叙利亚的地中海沿岸拥有美丽的海滩，沙滩细腻，海水清澈，阳光明媚，是度假休闲的好去处。游客可以在这里享受阳光浴、游泳、冲浪等水上活动。",
          },
        ],
      },
    },
    cities: {
      title: {
        ar: "العاصمة و الوجهات السياحية",
        ch: "首都与旅游地",
      },
      content: {
        ar: [
          {
            img: "./images/sy/damascus.jpg",
            title: "دمشق",
            description:
              "دمشق هي عاصمة سوريا، وأكبر مدنها، كما تُعد المركز الاقتصادي والثقافي للبلاد. تقع في جنوب غرب سوريا. وتتمتع دمشق بتاريخ عريق، وتُعد من أقدم المدن في العالم.",
          },
          {
            img: "./images/sy/aleppo.jpg",
            title: "مدينة حلب القديمة",
            description:
              "تقع مدينة حلب القديمة شمال سوريا،. وقد أدرجتها منظمة الأمم المتحدة للتربية والعلم والثقافة (اليونسكو) ضمن قائمة مواقع التراث الثقافي العالمي.",
          },
        ],
        ch: [
          {
            img: "./images/sy/damascus.jpg",
            title: "马士革",
            description:
              "马士革是叙利亚的首都，也是全国最大的城市和经济、文化中心。它位于叙利亚西南部。大马士革具有悠久的历史，是世界上最古老的城市之一。",
          },
          {
            img: "./images/sy/aleppo.jpg",
            title: "阿勒颇古城",
            description:
              "阿勒颇古城位于叙利亚北部。阿勒颇古城同样被联合国教科文组织列为世界文化遗产。",
          },
        ],
      },
    },
    recipies: {
      title: {
        ar: "الأطباق المميزة",
        ch: "特色菜",
      },
      content: {
        ar: [
          {
            img: "./images/sy/shawarma.jpg",
            title: "الشاورما",
            description:
              "الشاورما من الأطباق الشهيرة في سوريا. يتم تقطيع اللحم غالبًا لحم الضأن أو البقر بعد أن يتم تتبيله إلى شرائح رقيقة. يتم تقطيع اللحم إلى قطع صغيرة، ثم يوضع على الخبز العربي مع إضافة الخس، والطماطم، والبصل، والمخلل، وأحيانًا توابل خاصة مثل صلصة الطحينة أو صلصة الثوم.",
          },
          {
            img: "./images/sy/hummus.jpg",
            title: "الحمص",
            description:
              "الحمص هو نوع من المقبلات الكريمية الشهيرة، يُحضّر من الحمص المهروس ممزوجًا بطحينة السمسم وزيت الزيتون وعصير الليمون والثوم. يتميّز الحمص بقوامه الكريمي ونكهته المتوازنة والمنعشة، وهو من الأطعمة المحبوبة لدى السوريين و الكثير من العرب . يُقدَّم الحمص عادة كمقبلات أو وجبة خفيفة، وغالبًا ما يُؤكل مع الخبز، أو يُقدَّم إلى جانب الخضروات الطازجة.",
          },
          {
            img: "./images/sy/manakish.jpg",
            title: "المناقيش",
            description:
              "المناقيش هي وجبة فطور شائعة في سوريا، يتم تحضيرها باستخدام العجينة مع توابل الزعتر أو الجبن أو اللحم المفروم. تشبه البيتزا ويمكن تقطيعها إلى شرائح أو طيّها مثل الساندويتش.",
          },
        ],
        ch: [
          {
            img: "./images/sy/shawarma.jpg",
            title: "沙瓦玛",
            description:
              "沙瓦玛在叙利亚非常流行。将腌制好的羊肉或牛肉切成薄片。将肉切成小块，放入阿拉伯面饼中，加入生菜、番茄、洋葱、酸黄瓜等蔬菜，再挤上特制的酱料，如芝麻酱、蒜蓉酱等。",
          },
          {
            img: "./images/sy/hummus.jpg",
            title: "鹰嘴豆泥",
            description:
              "一种由鹰嘴豆、芝麻酱、橄榄油、柠檬汁和大蒜等食材打成的浓稠酱料，是叙利亚和许多阿拉伯人非常喜欢的一种食物。它可以作为开胃菜、小吃或主食，通常与面包、蔬菜等搭配食用。",
          },
          {
            img: "./images/sy/manakish.jpg",
            title: "玛纳基什",
            description:
              "一种受欢迎的叙利亚特早餐食物，由面团配以百里香、奶酪或碎肉制成。类似于披萨，可以切片或折叠。",
          },
        ],
      },
    },
  },
  so: {
    flag: "./images/waving-flags/somalia-flag-gif.gif",
    countryName: {
      ar: "جمهورية الصومال",
      ch: "索马里共和国",
    },
    geo: {
      map: "./images/maps/so.svg",
      title: {
        ar: "الموقع الجغرافي",
        ch: "地理位置",
      },
      content: {
        ar: "تقع الصومال في شمال شرق قارة أفريقيا، وتطل من الشرق على بحر العرب وخليج عدن. تبلغ مساحتها الإجمالية حوالي 637,660 كيلومترًا مربعًا. يحدها من الشرق المحيط الهندي، ومن الغرب كينيا وإثيوبيا، ومن الشمال الغربي جيبوتي. ويعد ساحل الصومال أطول ساحل في إفريقيا. حيث تكتسب موقعًا جغرافيًا مهمًا، إذ تقع على طريق الملاحة المؤدي إلى قناة السويس. يسود معظم أراضيها مناخ شبه مداري و صحراوي حار، بينما يتمتع الجنوب الغربي بمناخ السافانا المدارية.",
        ch: "索马里位于非洲东北部，东临阿拉伯海和亚丁湾，总面积约为63.7万平方千米。东濒印度洋，西接肯尼亚和埃塞俄比亚，西北接吉布提。索马里是非洲海岸线最长的国家。总面积637660平方公里，地理位置十分重要，是苏伊士运河航线的必经之地。索马里大部地区属亚热带和热带沙漠气候，西南部属热带草原气候。",
      },
      popover: {
        ar: [],
        ch: [],
      },
    },
    economy: {
      title: {
        ar: "الموارد الطبيعية و مصادر الدخل",
        ch: "自然资源与收入来源",
      },
      content: {
        ar: [
          {
            icon: "./images/gold.png",
            title: "الموارد الطبيعية",
            text: "تمتلك الصومال العديد من الموارد الطبيعية مثل اليورانيوم، والحديد، والقصدير، والجبس، والبُوكسيت، والنحاس، والرصاص، والفحم، بالإضافة إلى النفط والغاز الطبيعي.",
          },
          {
            icon: "./images/fishermen.png",
            title: "الموارد السمكية",
            text: "تتمتع الصومال بخطًا ساحليًا طويلاً، و تتمتع بموارد بحرية غنية، مما يجعلها واحدة من الدول الإفريقية المهمة في مجال الصيد البحري. وتضم مياهها أنواعًا عديدة من الأسماك، ومن أهم الأسماك الاقتصادية: التونة، والسردين، والقرش، والهامور وغيرها.",
          },
          {
            icon: "./images/icons/port.png",
            title: "النقل والخدمات اللوجستية",
            text: "تتمتع الصومال بموقع جغرافي استراتيجي مهم في منطقة القرن الأفريقي، حيث انها تطل على بحر العرب والمحيط الهندي، مما يجعلها ممرًا بحريًا حيويًا يربط بين آسيا وأفريقيا وأوروبا. وتمتلك الصومال أطول ساحل في قارة أفريقيا، ما يمنحها إمكانيات كبيرة لتطوير اقتصاد الموانئ.",
          },
        ],
        ch: [
          {
            icon: "./images/gold.png",
            title: "自然资源",
            text: "主要有铀、铁、锡、石膏、铝土、铜、铅、煤等。此外，石油和天然气。",
          },
          {
            icon: "./images/fishermen.png",
            title: "渔业资源",
            text: "索马里拥有漫长海岸线，渔业资源丰富，是非洲重要的渔业国家之一。海域内鱼类品种繁多，主要经济鱼类有金枪鱼、沙丁鱼、鲨鱼、石斑鱼等。",
          },
          {
            icon: "./images/icons/port.png",
            title: "物流与运输业",
            text: "索马里凭借其战略性地理位置，在非洲之角占据重要位置，临阿拉伯海和印度洋，是连接亚洲、非洲与欧洲的重要海上通道。索马里拥有非洲最长的海岸线，具备发展港口经济的巨大潜力。",
          },
        ],
      },
    },
    cities: {
      title: {
        ar: "العاصمة و الوجهات السياحية",
        ch: "首都与旅游地",
      },
      content: {
        ar: [
          {
            img: "./images/so/mogadishu.jpg",
            title: "مقديشو",
            description:
              "مقديشو هي عاصمة الصومال، وتقع في جنوب البلاد على الساحل، كما أنها أكبر مدينة في البلاد، وتُعد المركز الاقتصادي والثقافي للصومال.",
          },
          {
            img: "./images/so/mogadishu-beach.jpg",
            title: "شاطئ مقديشو",
            description:
              "يقع شاطئ مقديشو في المنطقة الساحلية لمدينة مقديشو، ويتميز برماله الناعمة ومياهه الصافية. لا تزال المناظر الطبيعية الخلابة للشاطئ تجذب العديد من الزوار. على الشاطئ، يمكن للسياح الاستمتاع بمشاهدة مناظر المحيط الهندي الجميلة وقضاء وقت ممتع تحت أشعة الشمس وعلى الرمال الذهبية.",
          },
        ],
        ch: [
          {
            img: "./images/so/mogadishu.jpg",
            title: "摩加迪沙",
            description:
              "摩加迪沙是索马里的首都，位于索马里南部沿海，也是全国最大城市和经济、文化中心。",
          },
          {
            img: "./images/so/mogadishu-beach.jpg",
            title: "摩加迪沙海滩",
            description:
              "摩加迪沙海滩位于摩加迪沙市沿海地区，拥有细腻的沙滩和清澈的海水。滩的自然美景依旧吸引着众多游客。在海滩上，游客可以欣赏到美丽的印度洋风光，享受阳光沙滩。",
          },
        ],
      },
    },
    recipies: {
      title: {
        ar: "الأطباق المميزة",
        ch: "特色菜",
      },
      content: {
        ar: [
          {
            img: "./images/so/biryani.jpg",
            title: "البرياني الصومالي",
            description:
              "البرياني الصومالي هو طبق تقليدي شهير يتكون من الأرز المطهو مع التوابل واللحم البقري أو الدجاج. يتميز هذا الطبق بنكهته القوية وألوانه الزاهية، ويُقدَّم غالبًا في المناسبات والأعياد أو أثناء تجمعات العائلة. يشبه البرياني الهندي ، لكنه يستخدم توابل محلية تعكس الثقافة الأكل الفريدة للصومال.",
          },
          {
            img: "./images/so/sambusa.jpg",
            title: "السمبوسة الصومالية",
            description:
              "السمبوسة هي وجبة خفيفة تقليدية محبوبة لدى الصوماليين، تتميز بقشرتها المقرمشة وحشوتها التي غالبًا ما تكون مزيجًا من اللحم البقري المفروم والبصل والتوابل. وتُقدم أيضًا كمقبلات أو وجبة خفيفة يومية.",
          },
        ],
        ch: [
          {
            img: "./images/so/biryani.jpg",
            title: "索马里香饭",
            description:
              "索马里香饭是一道受欢迎的传统菜肴，由香料、米饭和牛肉或鸡肉炖煮而成。这道菜口味浓郁，颜色丰富，常在节日或家庭聚餐时食用。它与印度的香饭类似，但使用了本地特有的调料，展现了索马里独特的饮食文化。",
          },
          {
            img: "./images/so/sambusa.jpg",
            title: "萨莫萨",
            description:
              "萨莫萨索马里人喜爱的传统小吃，外皮酥脆，内馅通常是碎牛肉、洋葱和香料的混合。常作为日常点心或开胃菜。",
          },
        ],
      },
    },
  },
};

const home = {
  ar: "الرئيسية",
  ch: "主页",
};
// The language can either be 'ar' for Arabic or 'ch' for Chinese (or any other languages you support)
let selectedLanguage = "ar"; // Default language is Arabic
let c = countries.li;
async function renderRecipes(recipes) {
  try {
    // Fetch the EJS template
    const response = await fetch("recipies-template.ejs");
    const templateText = await response.text();

    // Render the template with EJS
    const compiledTemplate = ejs.render(templateText, { recipes });

    // Insert the rendered content into the page
    document.getElementById("recipies-content").innerHTML = compiledTemplate;
  } catch (error) {
    console.error("Error loading the recipe template:", error);
  }
}

async function renderCities(cities) {
  try {
    console.log("Cities passed to renderCities:", cities); // Debug
    const response = await fetch("cities.ejs");
    if (!response.ok) throw new Error("Failed to fetch cities template");
    const templateText = await response.text();
    const compiledTemplate = ejs.render(templateText, { cities });
    document.getElementById("cities-content").innerHTML = compiledTemplate;
  } catch (error) {
    console.error("Error loading the cities template:", error);
  }
}

// Function to create the popover HTML
// Function to generate popover HTML with an image
function generatePopoverHTML(name, info) {
  return `
    <span 
      class="city-name-li" 
      data-bs-toggle="popover" 
      data-bs-trigger="hover focus" 
      data-bs-html="true" 
      data-bs-placement="right"
      data-bs-content='<div class="popover-container">
          <svg
            class="bd-placeholder-img card-img-top"
            width="100%"
            height="225"
            xmlns="http://www.w3.org/2000/svg"
            role="img"
            aria-label="Placeholder: Thumbnail"
            preserveAspectRatio="xMidYMid slice"
            focusable="false"
          >
            <title>Placeholder</title>
            <rect width="100%" height="100%" fill="#55595c"></rect>
            <text x="50%" y="50%" fill="#eceeef" dy=".3em">${name}</text>
          </svg>
          <p>${info.replace(/"/g, "&quot;")}</p>
        </div>'>
      ${name}
    </span>`;
}

// Function to insert popovers into the text (replaces all occurrences)
async function insertPopovers(text, popovers) {
  let markedText = text;
  const markers = {};

  popovers.forEach(({ name, info }, index) => {
    const marker = `%%POPOVER_${index}%%`;
    markers[marker] = { name, info };
    markedText = markedText.replace(new RegExp(name), marker);
  });

  // Then replace markers with popover HTML
  let processedText = markedText;

  for (const [marker, { name, info }] of Object.entries(markers)) {
    const popoverHTML = await generatePopoverHTML(name, info);
    processedText = processedText.replace(new RegExp(marker, "g"), popoverHTML);
  }
  return processedText;
}
// Function to update the Geography section when the user opens the city info
async function updateGeographySection(selectedLanguage) {
  // Get the plain text for the selected language
  const plainText = c.geo.content[selectedLanguage];
  // Get the popovers for the selected language
  const popovers = c.geo.popover[selectedLanguage];
  // Add popovers to the text
  const finalHTML = await insertPopovers(plainText, popovers);
  // Set the updated text as the innerHTML of the geo-content element
  document.getElementById("geo-content").innerHTML = finalHTML;
  // Initialize Bootstrap popovers
  document.querySelectorAll('[data-bs-toggle="popover"]').forEach((element) => {
    new bootstrap.Popover(element);
  });
}

// Example: Update the Geography section for Arabic
async function renderEconomySections(sectionsData) {
  try {
    const response = await fetch("income.ejs");
    const template = await response.text();
    const rendered = ejs.render(template, { sections: sectionsData });
    document.getElementById("economy-content").innerHTML = rendered;
  } catch (error) {
    console.error("Error rendering cards:", error);
  }
}
// Function to set the content based on selected language
function setContent(c, country) {
  // document.querySelector("#country-flag img").src = c.flag;
  // Update the country name
  const landingSection = document.getElementById("landing");
  landingSection.classList.remove("default-bg", "libya-bg", "sudan-bg");

  landingSection.classList.add(`${country}-bg`);

  document.getElementById("app-bar").textContent = home[selectedLanguage];

  document.getElementById("country-name").textContent =
    c.countryName[selectedLanguage];

  updateGeographySection(selectedLanguage);
  // Update the geographical information
  document.getElementById("geo-title").textContent =
    c.geo.title[selectedLanguage];

  document.getElementById("geo-map").src = c.geo.map;
  // document.getElementById("geo-content").innerHTML =
  //   c.geo.content[selectedLanguage];
  // Initialize popovers

  // Reinitialize popovers
  // document.querySelectorAll('[data-bs-toggle="popover"]').forEach((popover) => {
  //   new bootstrap.Popover(popover);
  // });
  // Update the economy information
  document.getElementById("economy-title").textContent =
    c.economy.title[selectedLanguage];
  // // document.getElementById("economy-content").textContent =
  // //   c.economy.content[selectedLanguage];
  renderEconomySections(c.economy.content[selectedLanguage]);
  // // Update the economy information
  document.getElementById("cities-title").textContent =
    c.cities.title[selectedLanguage];
  // document.getElementById("cities-content").innerHTML =
  //   c.cities.content[selectedLanguage];
  renderCities(c.cities.content[selectedLanguage]);
  document.getElementById("recipies-title").textContent =
    c.recipies.title[selectedLanguage];
  renderRecipes(c.recipies.content[selectedLanguage]);
  const popoverTriggerList = document.querySelectorAll(
    '[data-bs-toggle="popover"]'
  );
  const popoverList = [...popoverTriggerList].map(
    (popoverTriggerEl) => new bootstrap.Popover(popoverTriggerEl)
  );
}

function changeTextDirection() {
  const sections = document.querySelectorAll("section");
  const img = document.getElementById("lang-switcher-icon");
  const geoMap = document.getElementById("geo-map");
  const geoContent = document.getElementById("geo-content");
  const carouselTexts = document.querySelectorAll(".carousel-text");

  sections.forEach((section) => {
    if (selectedLanguage === "ar") {
      section.style.direction = "rtl";
      geoMap.style.float = "right";
      geoContent.style.textAlign = "right";
    } else {
      section.style.direction = "ltr";
      geoMap.style.float = "left";
      geoContent.style.textAlign = "left";
    }
  });

  carouselTexts.forEach((text) => {
    if (selectedLanguage === "ar") {
      text.setAttribute("text-align", "right");
    } else {
      text.setAttribute("text-align", "right");
    }
  });

  if (selectedLanguage === "ar") {
    img.setAttribute("src", "./square.png");
  } else {
    img.setAttribute("src", "images/saudi-arabia (3).png");
  }
}

// Function to switch language
function switchLanguage() {
  // Toggle the language
  selectedLanguage = selectedLanguage === "ar" ? "ch" : "ar";
  setContent(c);
  changeTextDirection();
}

// Initialize the content with the default language

// Initialize all popovers on the page
// document.addEventListener("DOMContentLoaded", () => {
//   const popoverTriggerList = [].slice.call(
//     document.querySelectorAll('[data-bs-toggle="popover"]')
//   );
//   const popoverList = popoverTriggerList.map(function (popoverTriggerEl) {
//     return new bootstrap.Popover(popoverTriggerEl, {
//       trigger: "hover",
//       container: "body",
//     });
//   });
// });

// // Function to check if an element is in the viewport
// function isElementInViewport(el) {
//   const rect = el.getBoundingClientRect();
//   return rect.top >= 0 && rect.bottom <= window.innerHeight;
// }

// // Function to apply the animation when the section is in the viewport
// function handleScroll() {
//   const sections = document.querySelectorAll("section");

//   sections.forEach((section) => {
//     if (isElementInViewport(section)) {
//       section.classList.add("section-visible"); // Add animation class
//     }
//   });
// }

// // Run the function on page load and scroll
// window.addEventListener("scroll", handleScroll);
// window.addEventListener("load", handleScroll);

// Get the query parameters from the URL
const urlParams = new URLSearchParams(window.location.search);
const country = urlParams.get("country");

if (country) {
  console.log("Selected country:", country);
  if (country in countries) {
    console.log("it is in .... ");
    c = countries[country];
    setContent(c, country);
  }
  // You can use this variable in your logic
}
